[
    {
        "id": "b1b4983c-9aba-4fa0-a6a2-8367be2ec30b",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/b1b4983c-9aba-4fa0-a6a2-8367be2ec30b",
        "created_at": "Thu Feb 18 10:02:01 UTC 2021",
        "company": "enote GmbH",
        "company_url": "https://www.enote.com/",
        "location": "Berlin",
        "title": "NodeJS Service Developer (m/w/d)",
        "description": "<p><strong>About the position</strong></p>\n<p>We are a passionate about music and create a revolutionary product which will affect the way millions of people study and play music every day. We are searching for an experienced senior software engineer ready to join our effort and help us build the foundation of our solution – a scalable backend capable of handling thousands of simultaneous users by means of latest cloud technologies. Our product will provide millions of amateurs and professionals instant access to the majority of world’s music heritage.\n<strong>Please only apply if you have a valid work permit for Germany!</strong></p>\n<p><strong>Job Responsibilities</strong></p>\n<ul>\n<li>Establish a scalable ecosystem of microservices to serve mobile/web clients around the world</li>\n<li>Design and maintain services in close collaboration with other teams for internal and public use</li>\n<li>Contribute to best practices, improving code style and a culture of improvement over iteration</li>\n<li>Troubleshoot, improve and extend services from open-source communities</li>\n</ul>\n<p><strong>What we expect from you</strong></p>\n<ul>\n<li>You have at least 4 years of experience in developing and maintaining cloud services</li>\n<li>You see Docker as an essential part of any large software project</li>\n<li>You are confident in frameworks like Express, hapi, Restify and/or NestJS</li>\n<li>You prefer TypeScript over JavaScript</li>\n<li>You are self-driven, collaborative and constantly learning</li>\n<li>You are confident at the Linux command line</li>\n<li>You follow basic principles like DRY (Don’t Repeat Yourself) and PFE (Proudly Found Elsewhere)</li>\n<li>You apply Kanban and Scrum principles in your daily work</li>\n<li>Fluent English skills</li>\n</ul>\n<p><strong>What will be a bonus</strong></p>\n<ul>\n<li>You have already contributed to open-source projects</li>\n<li>Practical experience in other languages (e. g. Python, Rust, Go, Java)</li>\n<li>Hands-on experience with AWS, GCP and/or Azure</li>\n<li>Confident in creating efficient SQL and data organization (PostgreSQL, MySQL/MariaDB)</li>\n<li>In-depth experience with Elasticsearch used as a search engine</li>\n<li>You do care about data and have experience with data processing tools and/or platforms</li>\n<li>Experience with writing GitLab CI pipelines</li>\n<li>You know how to get the best out of Git</li>\n<li>Professional experience in securing services and protecting data</li>\n<li>You prefer test driven development (TDD)</li>\n</ul>\n<p><strong>What we offer you</strong></p>\n<ul>\n<li>Competitive compensation scheme</li>\n<li>Comfortable modern office in the heart of Berlin’s tech scene, very well connected to all local transportation services</li>\n<li>Small team, flat hierarchy, founder-led start-up</li>\n<li>We value diversity. You will only be judged based on your skills and fit for the job</li>\n<li>We are open minded! You are more than welcome to criticize and improve our processes and working culture</li>\n<li>High quality standards, your colleagues are experienced professionals</li>\n<li>Top-notch hardware equipment</li>\n<li>Great career opportunities – you will be an essential part of a new product, shaping its architecture and software design</li>\n<li>Work in a start-up with a high valuation and a 7-figure funding</li>\n</ul>\n<p><img src=\"https://camo.githubusercontent.com/37e64f096821659fe5edf34a6b712f327fb2904d/68747470733a2f2f742e676f686972696e672e636f6d2f682f62363431363866626432363962333030633966613334666230316632313962323533613133383736623764316565303830396637346531323364393864326137\"></p>\n",
        "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/0e8dbabd408e777445446bf049cb8b58d5d4650be35da223dc6585e4afe3189b\">application form</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGVaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--eab17839ce167dccb20fd19c9429de91875bb7b5/enote%20GmbH.png"
    },
    {
        "id": "274a58c3-1f2e-4c24-a8d8-8dd2e41301b1",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/274a58c3-1f2e-4c24-a8d8-8dd2e41301b1",
        "created_at": "Thu Feb 18 07:39:14 UTC 2021",
        "company": "InnoGames GmbH",
        "company_url": "https://www.innogames.com",
        "location": "Hamburg",
        "title": "Frontend Developer (Haxe) - Video Game: Forge of Empires",
        "description": "<p>Our agile and cross-functional <strong>Forge of Empires</strong> team is searching for a <strong>Frontend Developer</strong>:</p>\n<p>As a Frontend Developer, you will join a feature team of the Forge of Empires project to support growth, technical stability and longevity of our game.</p>\n<p>Are you a talented Game Developer and passionate about online games? Live your passion for online games/Game Development and collaborate with like-minded people to provide the best user experience for our players!</p>\n<p><strong>Your mission:</strong></p>\n<ul>\n<li>Contribute to the continuous development and improvement of one of our keystone games</li>\n<li>Develop new features and improve existing game features with a strong focus on UI and UX</li>\n<li>Participate in the whole feature development lifecycle with a commitment to high-quality results</li>\n<li>Collaborate closely with Mobile- &amp; Backend Developers, Game Designers, and Artists to implement new game features for our browser clients</li>\n</ul>\n<p><strong>Your skillset:</strong></p>\n<ul>\n<li>Working experience in Frontend/Game Development with Haxe. ActionScript 3 or JavaScript experience is a bonus.</li>\n<li>A right eye for details and a passion for implementing UI and UX</li>\n<li>Well-versed in design patterns and software architecture</li>\n<li>Experience with writing browser automation tests</li>\n<li>Solution-oriented and efficient style of work</li>\n<li>Team player and a good communicator with fluent English language skills</li>\n</ul>\n<p><em>Favorable</em></p>\n<ul>\n<li>Passion for online games (strategy/F2P) and knowledge of relevant game mechanics</li>\n<li>Professional experience in the gaming industry, ideally working on comparable browser games</li>\n<li>Theoretical understanding of Software Development, ideally based on a University degree in Computer Sciences, Business Information Systems or similar studies</li>\n<li>Know your way around popular scripting languages (Python / Bash / Groovy)</li>\n<li>A proactive and motivated individual with a willingness to learn</li>\n</ul>\n<p><strong>Your power-ups:</strong></p>\n<ul>\n<li>Get competitive compensation as well as a sabbatical, mobile device, contribution to your public transport ticket, and more</li>\n<li>De-stress your private life with flexible working hours, the in-house gym, services such as a hairdresser, massage, bike inspection, and more</li>\n<li>Participate in tons of the company's get-togethers ranging from an in-house sofa concert to a virtual wine tasting</li>\n<li>Make the most of our excellent training and development opportunities</li>\n<li>Feel comfortable in an atmosphere to empower creative thinking and strong results</li>\n<li>Work in an agile multicultural team – enabling you and your team to form and actively optimize work processes</li>\n<li>Our company language is English, and we support all our employees and their partners with optional German lessons</li>\n<li>Receive exceptional support with your relocation to Hamburg</li>\n<li>Shape the success story of InnoGames with our international team of driven experts in a stable growing company and award-winning employer</li>\n</ul>\n<p><strong>Our story:</strong></p>\n<p>InnoGames is Germany's leading developer and publisher of mobile and online games.\nThe company based in Hamburg is best known for Forge of Empires, Elvenar, and Tribal Wars. InnoGames' complete portfolio encompasses seven live games and several mobile titles in production.</p>\n<p>Born as a hobby, InnoGames today has a team of 400 employees from more than 30 nations who share the passion of creating unique games that players across the globe enjoy for years.\nTo further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.</p>\n<p>Excited to start your journey with InnoGames and join our dynamic team as a <strong>Frontend Developer</strong>?\nWe look forward to receiving your application as well as your salary expectations and earliest possible starting date through our <a href=\"https://www.innogames.com/career/detail/job/frontend-developer-haxe-video-game-forge-of-empires/?s=GitHub\">online application form</a>. <strong>Maximilian Kaeding</strong> would be happy to answer any questions you may have.</p>\n<p><strong>Apply and #stayhome!</strong>\nDue to the <strong>coronavirus</strong> outbreak, we switched our operations company-wide to home office and turned our hiring process into a <strong>fully virtual one</strong>.\nWhen hiring, we are also open for our new team members starting their work remotely at the time being or adjusting contract start dates accordingly.\nStay home and safe!</p>\n",
        "how_to_apply": "<p><a href=\"https://www.innogames.com/career/detail/job/frontend-developer-haxe-video-game-forge-of-empires/?s=GitHub\">https://www.innogames.com/career/detail/job/frontend-developer-haxe-video-game-forge-of-empires/?s=GitHub</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcFdaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0c0cdf1659e2ef3dfa4239866de1db61f1f4a2d9/logo_innogames_devlop.png"
    },
    {
        "id": "2b78c92c-c8a4-420a-88e9-4a5fc232284b",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/2b78c92c-c8a4-420a-88e9-4a5fc232284b",
        "created_at": "Wed Feb 17 22:37:26 UTC 2021",
        "company": "Openforce",
        "company_url": "http://www.oforce.com",
        "location": "Remote in US",
        "title": "Senior Software Engineer",
        "description": "<p>Overview: As Senior Software Engineer, you will join a team of mainly full stack engineers with exposure to everything, collaborating with product and other technology leaders to jointly chart the platform roadmap.</p>\n<p>General Summary:\nOur team builds and maintains all client facing interfaces (e.g. web app, APIs, etc.) to enable the independent contractor model through the platform. We are mostly full stack engineers with exposure to back-end, front-end, and everything in between. The collaborative nature of the team allows you to constantly learn new things. You’ll work closely with other software engineers across the engineering organization to innovate on our platform architecture, and to continue building a world-class technology platform.\nTo be successful in this role, you should be confident contributing to the development of our products, making recommendations for solutions and new technology approaches, and pushing for better software practices.</p>\n<p>Responsibilities:</p>\n<ul>\n<li>Serve as technical/development lead on specific initiatives</li>\n<li>Review architecture and technical design on key projects</li>\n<li>Collaborate with Product to validate use cases and requirements</li>\n<li>Lead code quality and testing across engineering teams</li>\n<li>Provide technical mentorship to junior engineers</li>\n<li>Influence and evangelize new software technologies to other team members</li>\n<li>Work closely with other software architects to make engineering wide architecture recommendations and decisions</li>\n<li>Experiment with new ways of visualizing large amounts of data</li>\n<li>Ensure our technology stack stays current</li>\n<li>Passionate about building a world-class technology platform</li>\n</ul>\n<p>Key Competencies and Skills:</p>\n<ul>\n<li>Technical Expertise: Possesses an in-depth knowledge and skill in a technical area</li>\n<li>Problem Solving: Frames problems before trying to solve them. Breaks down problems and identifies all of their facets, including hidden or tricky aspects</li>\n<li>Analytical Thinking: Weights the costs, benefits, risks, and chances for success in making a decision</li>\n<li>Fostering Innovation and Teamwork: Sponsors the development of new products, services, methods, or procedures while working cooperatively with others to produce initiative solutions</li>\n<li>Developing Others: Provides helpful, behaviorally specific feedback to others and gives people assignments that will help develop their abilities</li>\n<li>Results Orientation: Maintains commitment to goals in the face of obstacles and frustrations; develops challenging but achievable goals</li>\n</ul>\n<p>Knowledge, Skills, And Abilities</p>\n<ul>\n<li>Degree in Computer Science or equivalent work experience</li>\n<li>10+ years of software development experience</li>\n<li>High degree of comfort in Elixir, ASP or other functional or object-oriented language</li>\n<li>Experience with scalable, high performance, multi-tier, enterprise application development</li>\n<li>Familiarity with JavaScript frameworks such as React</li>\n<li>Experience with data storage technologies</li>\n<li>Experience with queuing and messaging frameworks</li>\n<li>Experience with service-oriented architecture</li>\n<li>Keen sense of information architecture and visual design</li>\n<li>Motivated by writing fast, scalable code with testability in mind</li>\n<li>Excited by working in a fast-paced environment</li>\n</ul>\n<p>The Perks</p>\n<ul>\n<li>Continued training and career development</li>\n<li>Full Benefits Package including: Medical, Dental, Vision, Disability, and 401k</li>\n<li>Vacation and Holiday pay</li>\n<li>Casual dress code and creative office environment</li>\n</ul>\n<p>Job Type:\tFull Time Exempt</p>\n<p>Reports to: \tDirector of Engineering</p>\n<p>Salary: \t\tDOE</p>\n<p>Travel: \t        Up to 5% quarterly or as needed</p>\n<p>Passion, excellence, respect, accountability and having fun are just the beginning. Openforce believes that our culture is at the core part of what makes us successful. We are looking forward to hiring someone who understands good culture and will help shape it as it evolves.</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:careers@oforce.com\">careers@oforce.com</a>!</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcE9aIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--96b6c0ac096d817f4f10586852474d5491a6d6e4/oforce-stacked-pms-color.png"
    },
    {
        "id": "c7b845ef-2ab6-416d-931f-17edcc54b384",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/c7b845ef-2ab6-416d-931f-17edcc54b384",
        "created_at": "Wed Feb 17 22:25:22 UTC 2021",
        "company": "Openforce",
        "company_url": "http://www.oforce.com",
        "location": "Remote in US",
        "title": "Software Product Manager - Insurtech",
        "description": "<p>Overview: Openforce is an industry leader in enterprise software as a service (SaaS) located in the Metro Phoenix area. Openforce is seeking an experienced software product manager to join our product delivery team. You will work directly on new product features and improving the quality and value of our software. Above all you will impact the way the world defines working without limits. </p>\n<p>The Product Manager Role:\nIn this role you will help define a product vision that comes from market and competitive analysis to build value for the business and its customers. Project timelines, milestones, and hypothesis are defined with the product team for building prioritized product features for the business. The product manager will have to communicate effectively and synthesize information across multiple teams like sales, marketing, support, QA, design, and engineering in order to organize priorities and expectations across the business.</p>\n<p>Metrics and feedback loops are created and utilized to inform product development. You are able to define OKRs, or use the business OKRs, to define and manage features that support those objectives. This role must be able to define enough detail of the features and hypothesis so that team has actionable features and work prioritized to deliver on. A product manager will be able to understand and help define the roles of the users in the product through research, user focus groups, or working with customers directly.</p>\n<p>You leverage agile and lean values to continually improve, collaborate, and deliver the highest priority and value features to your clients. This can include things like running inceptions, grooming upcoming work with the involved stakeholders, gathering business needs from other teams, writing user stories and defining features, monitoring user and business metrics to inform upcoming hypothesis or features, reviewing and accepting work delivered, tracking releases and milestones.</p>\n<p>Responsibilities:</p>\n<ul>\n<li>Owns the vision and success of the product within functional boundaries and focus of the\nproduct</li>\n<li>Utilizes metrics-based approach to identify problems and opportunities, prioritize them, and evaluate success of implementations</li>\n<li>Writes clear and detailed users’ stories with value-driving acceptance criterion and metrics to validate success</li>\n<li>Gather customer feedback, hypothesize the impact of changes, and write up new stories as necessary</li>\n<li>Organizes resources effectively to keep the entire process on track</li>\n<li>When direct customer interfacing is not possible, acts as a proxy customer</li>\n<li>Conducts cost analysis, estimating expected costs for the project</li>\n<li>Conducts risk assessments; reports identified risks to management; provides recommendations for mitigation of risk (including termination of the project if appropriate)</li>\n<li>Addresses questions, concerns, and/or complaints throughout the project</li>\n<li>Acts as a liaison between company, customers, and vendors</li>\n<li>Communicates and collaborates with sales and marketing teams to provide training and information required to promote and sell new projects, programs, and systems</li>\n<li>Ensures compliance with federal, state, local, industry, contractual, and company regulations, standards, specifications, and best practices</li>\n<li>Performs other related duties as assigned</li>\n<li>Can help define and relate work back to OKRs defined by the teams and business as a whole</li>\n</ul>\n<p>You’re a good fit at Openforce if:</p>\n<ul>\n<li>You have an understanding of agile and lean values and know that one-process does not fit all, and each team can have different approaches to arrive at the right solution.</li>\n<li>You are flexible and able to work within a variety of team processes to get what needs to be done, done.</li>\n<li>You have a customer-centric approach to all products and projects you roll out; you constantly put yourself in the users’ shoes.</li>\n<li>You are a good listener.</li>\n<li>You are detailed and thorough.</li>\n<li>You understand how metrics can drive value.</li>\n<li>You are a quick learner, and hungry for product mastery.</li>\n<li>When faced with a hard problem you can break it down into units of smallest deliverable value.</li>\n<li>You’re always looking to improve and innovate but understand the benefit of an MVP.</li>\n</ul>\n<p>Knowledge, Skills, And Abilities</p>\n<ul>\n<li>Previous experience working within teams that follow agile and lean values</li>\n<li>Must be able to clearly communicate with team, participate actively in discussions</li>\n<li>Lead discussions when expected</li>\n<li>Excellent written skills</li>\n<li>Must be able to clearly demonstrate command and control of meetings (as appropriate)</li>\n<li>Earn total respect and confidence from the team</li>\n<li>Comfortable communicating at all levels and is effective at doing so</li>\n<li>Can construct presentation material, and deliver it, to audiences of any level</li>\n<li>Communicates tactfully, in a mature and controlled manner (both verbally and written)</li>\n<li>Organized and transparent with teams and the business on progress and deliverables</li>\n<li>Insurance or Insurtech experience preferred</li>\n</ul>\n<p>The Perks</p>\n<ul>\n<li>Continued training and career development</li>\n<li>Full Benefits Package including: Medical, Dental, Vision, Disability, and 401k</li>\n<li>Vacation and Holiday pay</li>\n<li>Casual dress code and creative office environment</li>\n</ul>\n<p>Job Type:\tFull Time Exempt</p>\n<p>Reports to: \tVP of Technology and Engineering</p>\n<p>Salary: \t\tDOE</p>\n<p>Travel: \t        Up to 5% quarterly or as needed</p>\n<p>Passion, excellence, respect, accountability and having fun are just the beginning. Openforce believes that our culture is at the core part of what makes us successful. We are looking forward to hiring someone who understands good culture and will help shape it as it evolves.</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:careers@oforce.com\">careers@oforce.com</a>!</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEdaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b74048c213d5da7b62e3cacf20821da8777fe289/oforce-stacked-pms-color.png"
    },
    {
        "id": "b8e61523-a198-4c23-a9cc-1c344434b5b1",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/b8e61523-a198-4c23-a9cc-1c344434b5b1",
        "created_at": "Wed Feb 17 21:03:39 UTC 2021",
        "company": "Applaudo Studios",
        "company_url": "https://applaudostudios.com",
        "location": "Mexico",
        "title": "iOS Developer",
        "description": "<p>We are looking for an experienced iOS Developer to create functional and attractive applications that perfectly meet the needs of our customers.</p>\n<p><strong>Technical skills</strong></p>\n<ul>\n<li>Languages: Swift</li>\n<li>Frameworks: UIKit, SwiftUI, RxSwift/Combine, CoreLocation</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Bachelor’s Degree in Computer Science, Software Engineering, Computer Engineering, or\na related field (preferred) or an equivalent combination of education and experience.</li>\n<li>Excellent organizational, writing, and communication skills.</li>\n<li>3 to 5 years of experience as an iOS Developer.</li>\n<li>Strong proficiency with Swift, and the iOS development ecosystem.</li>\n<li>Ability to multitask, prioritize tasks, manage deadlines, and quickly adjust to a rapidly\nchanging environment.</li>\n<li>Ability to work independently or as a member of a team.</li>\n<li>English is a requirement, as you will be working directly with US-based clients.</li>\n</ul>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Proven track record of high productivity and excellent attention to detail in software\ndesign, coding, design adherence, and debugging with multiple apps in the App\nStore.</li>\n<li>Ability to work independently with limited need for supervision in a fast-paced\nenvironment.</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://applaudostudios.com/careers/376587\">https://applaudostudios.com/careers/376587</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbjZaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d35926328fb54be8a650468314461aabef85f55a/logo-applaudo-studios_019cccde.png"
    },
    {
        "id": "377e8e58-7bd1-45ca-8ccf-4d633381d4c8",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/377e8e58-7bd1-45ca-8ccf-4d633381d4c8",
        "created_at": "Thu Jan 07 06:47:16 UTC 2021",
        "company": "Ikayzo",
        "company_url": "http://ikayzo.com",
        "location": "United States",
        "title": "Senior Enterprise Software Engineer (Kotlin)",
        "description": "<p><em>Work with an award-winning team designing and implementing systems for customers from New York to Tokyo.</em> Ikayzo, a boutique software development and interactive design agency, is looking for a Senior Enterprise Software Engineer (Kotlin / Spring) capable of taking complex projects from ideation to release. In this role he/she will be responsible for designing and implementing applications for a wide range of customers ranging from fintech startups and renewable energy companies to global banks. We promote from within, and this position has the potential to develop into a tech lead role. Ikayzo offers competitive compensation and benefits including 24 days of paid time off per annum for full time employees.</p>\n<p><em>Note: We are currently only hiring in the United States and Japan. Remote developers are being considered, but they must be US or Japanese citizens or have valid work visas.</em></p>\n<p><strong>Job Description</strong></p>\n<p>The position of Senior Enterprise Software Engineer entails software architecture, implementation, development of best operational practices, testing and documentation of non-trivial systems with massive scalability requirements. Full stack experience with popular client frameworks such as  React.js is preferred. As a boutique consultancy we are looking for motivated individuals who do not require step-by-step directions and can work cohesively with our team.</p>\n<p>Successful applicants will have a proven track record with non-trivial enterprise Kotlin and Java projects, be comfortable with agile development methodologies, have a solid grounding in OO software architecture / design patterns and be comfortable with the enterprise Kotlin / Java technology stack including frameworks such as Spring from front to back. Most importantly, candidates must have a passion for programming. Our interviews are rigorous, so only serious developers with the requisite skills need apply.</p>\n<p>Send your resume and a link to your GitHub profile to <a href=\"mailto:career@ikayzo.com\">career@ikayzo.com</a>.</p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>A solid grounding in OO software architecture / design patterns</li>\n<li>Experience designing and implementing successful non-trivial enterprise Kotlin projects</li>\n<li>Experience with agile development methodologies</li>\n<li>Deep knowledge of the de facto Kotlin enterprise stack including Spring and Hibernate</li>\n<li>Familiarity with React.js</li>\n<li>Firm grasp of data modeling</li>\n<li>A passion for software development</li>\n</ul>\n<p><strong>Preferred</strong></p>\n<ul>\n<li>PostgreSQL and MongoDB expertise</li>\n<li>Contributions to open source projects</li>\n<li>Financial systems experience a plus</li>\n</ul>\n<p><strong>About Ikayzo</strong></p>\n<p>Ikayzo is a boutique software development and interactive design agency working in areas ranging from fin-tech to renewable energy. Ikayzo develops desktop, web and mobile applications for multiple platforms including Ruby on Rails, Kotlin / Java, iPhone, Android, and .NET. We are active in the open source community.</p>\n<p>Ikayzo has worked with Google, IBM, Intel, Sun, Adobe, Oracle, Apache, Red Hat and SAP on developing technology standards for everything from enterprise software to scientific applications. From New York to Tokyo, our customers range from database leader Oracle to trusted financial institutions like Bank of America. We work with customers of all sizes in a variety of industries including biotechnology, banking, renewable energy, social media / web 2.0 and software.</p>\n",
        "how_to_apply": "<p>Email resume and GitHub profile to <a href=\"mailto:career@ikayzo.com\">career@ikayzo.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdG1VIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e254e5368909e8a838138a58a81c6d352af03cdd/logo-final.png"
    },
    {
        "id": "a63feabb-6976-4f74-b788-44afa96aed06",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/a63feabb-6976-4f74-b788-44afa96aed06",
        "created_at": "Wed Feb 17 20:07:40 UTC 2021",
        "company": "Quadio",
        "company_url": "https://quadio.com",
        "location": "New York",
        "title": "Senior Frontend Engineer",
        "description": "<p>Quadio, an exciting new ecosystem of IRL and digital businesses designed to champion college creativity, is looking to expand its tech team as it rapidly advances v2 of its mobile-first app toward release. Founded in 2019 by an EDM producer with a passion for innovation and artistic collaboration and a Cornell grad with stints in strategy and marketing at Twitter and BlizzardActivision, Quadio’s team has grown to 24 strong, with a renowned board of advisors and strong financial funding. With a culture of creativity, urgency, and candor, Quadio seeks a wicked-smart, super-energized engineer who loves the arts and the people who make them come to life, embraces intensity and challenge with enthusiasm, and finds transparency as refreshing as we do. Our in-house motto is, “LET’S GOOOO,” and if that kind of positivity appeals to you, read on.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Implement the features and user experiences that power Quadio’s web and mobile applications</li>\n<li>Architect efficient and reusable front-end systems that drive complex applications</li>\n<li>Collaborate closely with our Design, Marketing, and Product teams to build an engaging user experience for our users</li>\n<li>Build products and experiences people love through intuitive design and clear user experiences</li>\n<li>Take your ideas from concept to reality</li>\n<li>Put automated testing, tracking, and monitoring in place to ensure our systems are always working as expected</li>\n</ul>\n<h2>Experience</h2>\n<ul>\n<li>A minimum of 5 years of experience developing applications using Javascript/Typescript, including advanced knowledge of concepts like asynchronous programming, closures, types, and ES2015+</li>\n<li>Expertise in React Native, with experience in build and release pipelines - specifically publishing applications across both Apple’s iStore and Google’s Play Store.</li>\n<li>Expertise in browser APIs and optimizing for frontend performance</li>\n<li>Experience working with RESTful APIs and/or GraphQL as well as client/server architectures</li>\n</ul>\n<h2>Additional (Standout Qualifications)</h2>\n<ul>\n<li>Experience with frontend state management frameworks such as Redux, MobX-state-tree, or Vuex</li>\n<li>Experience in bridging React Native components across Java/Kotlin and/or Swift</li>\n<li>Experience with frontend frameworks like React, AngularJS, Vue.js, or another equivalent framework</li>\n<li>Expertise in HTML &amp; CSS, with a knack for layout, specificity, cross-browser compatibility, and accessibility</li>\n<li>Experience with AWS APIs, such as DynamoDB, Lambda, or CDK</li>\n<li>Excited about the opportunities and challenges of working on projects touching all areas of our codebase and associated microservices</li>\n<li>Experience with containerization tools, such as Docker or Kubernetes</li>\n<li>BS/MS in Computer Science or an equivalent major</li>\n</ul>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:anthony@quadio.com\">anthony@quadio.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWlaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--07552c41932649728393054d493fcd94b39f6a16/QuadioIcon.png"
    },
    {
        "id": "507628b3-95ce-431b-a531-4efef56b67e6",
        "type": "Contract",
        "url": "https://jobs.github.com/positions/507628b3-95ce-431b-a531-4efef56b67e6",
        "created_at": "Wed Feb 17 19:10:06 UTC 2021",
        "company": "SUNSOFT ONLINE",
        "company_url": "https://SunSoftOnline.com",
        "location": "Phoenix Arizona",
        "title": "APPS DEVELOPER (with GIS Knowledge prefferred)",
        "description": "<p>Description\nApplication Developer preferably with GIS knowledge We are looking for a dedicated, team orientated Application Developer to work with us to develop new software applications and update and modify existing applications.\nThe Application Developer processes user needs to customize software for computer programs, designs prototype applications, implements and tests source code, and troubleshoots software applications.\nTo be successful as an Application Developer, you should have a sound knowledge of software engineering as well as excellent analytical and communication skills.\nA good Application Developer is a lifelong learner and applies his knowledge to develop cutting-edge solutions. Application Developer Responsibilities:</p>\n<ul>\n<li>Developing software solutions to meet customer needs.</li>\n<li>Creating and implementing the source code of new applications.</li>\n<li>Testing source code and debugging code.</li>\n<li>Evaluating existing applications and performing updates and modifications.</li>\n<li>Developing technical documentation to represent the design and code of new applications.</li>\n</ul>\n<p>Preferred knowledge of: RDBMS - SQL Server, Postgres, PostGIS expertise Experience in designing and managing RDBMS in SQL Server/Postres\n.NET framework - .NET Core preferred Experience using ArcGIS for Desktop and ArcGIS Pro to create maps and analysis\nExperience in developing Python scripts to automate GIS tasks Experience developing web mapping applications in ArcGIS Online and Portal for ArcGIS Experience publishing hosted and federated map services using ArcGIS Server, ArcGIS Online and Portal for ArcGIS Experience in the ArcSDE and enterprise geodatabases</p>\n<p>Application Developer Requirements:</p>\n<ul>\n<li>A Bachelor's degree in Computer Science or related field.</li>\n<li>A working knowledge of programming languages such as C#, Java, Python, PHP, JavaScript etc.</li>\n<li>Experience in application and software development.</li>\n<li>Knowledge of software design and programming principles.</li>\n<li>Good mathematical and problem-solving skills.</li>\n<li>Good communication and team-working skills.</li>\n</ul>\n<p><a href=\"https://www.sunsoftonline.com/find-jobs/331/view?destination=find-jobs\">https://www.sunsoftonline.com/find-jobs/331/view?destination=find-jobs</a></p>\n",
        "how_to_apply": "<p>Please email your resume to <a href=\"mailto:Jobs@sunsoftonline.com\">Jobs@sunsoftonline.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbU9aIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6871b376d5291efd1f78dee7b2b057de6cf8321d/SunSoft-logo1.jpg"
    },
    {
        "id": "f4d51a91-b916-4438-b0fd-61106c188746",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/f4d51a91-b916-4438-b0fd-61106c188746",
        "created_at": "Wed Feb 17 15:43:54 UTC 2021",
        "company": "ALDI Einkauf SE & Co. oHG Loading",
        "company_url": "https://www.aldi-nord.de",
        "location": "Essen",
        "title": "DevOps Engineer (m/w/d)",
        "description": "<h2>Das sind deine Aufgaben</h2>\n<ul>\n<li>Umsetzung von DevOps für eine Cloud-basierte Analytics Plattform</li>\n<li>Aufbau automatischer Tools zu Orchestrierung, Monitoring und Entstörung automatisierter Daten- und Analysestrecken</li>\n<li>Optimierung existierender Datenbeladungsprozessen und ggf. Überführung in einen modernen Zielzustand</li>\n<li>Einhaltung von datenbezogenen Prioritäten zur Sicherstellung optimaler Verfügbarkeit der verschiedenen Daten zur richtigen Zeit</li>\n<li>Überwachung der Auslastung der Plattformkomponenten und Ableitung geeigneter Maßnahmen zur Performanceproblemen</li>\n<li>Dokumentation und Wissensvermittlung zu den Datenstrecken und deren Orchestrierung</li>\n<li>Anbindung und Aufbau neuer Daten- und Analysestrecken durch Mitarbeit in cross-funktionalen, agilen Projektteams zur Realisierung von Use Cases</li>\n<li>Enge Zusammenarbeit mit Data Engineering, Modelling und Quality</li>\n</ul>\n<h2>Das bringst du mit</h2>\n<ul>\n<li>Erfolgreich abgeschlossenes Studium der Informatik oder eine vergleichbare Qualifikation mit technischem Schwerpunkt</li>\n<li>Mehrjährige Erfahrung mit dem Aufsetzen von Cloud-Umgebungen für und dem Einsatz von DevOps-Technologien für das Data Management oder Analytics Use Cases</li>\n<li>Fundierte Kenntnisse in den Bereichen ETL/ELT, SQL, Automatisierungstechnologien und Software Engineering Methodiken</li>\n<li>Ausgeprägte technische und analytische Fähigkeiten, hohe Methodenkompetenz</li>\n<li>Hohe Kommunikations- und Beratungsstärke</li>\n<li>Sehr gute Deutsch- und Englischkenntnisse in Wort und Schrift</li>\n</ul>\n<h2>Das bieten wir dir</h2>\n<ul>\n<li>Top-Branchengehalt</li>\n<li>Eine abwechslungsreiche und anspruchsvolle Tätigkeit</li>\n<li>Einen sicheren Arbeitsplatz bei der Nr. 1 im Discount</li>\n<li>Ein leistungsstarkes und angenehmes Arbeitsumfeld in einem Team, das sich auf dich freut!</li>\n</ul>\n<h2>Interessiert?</h2>\n<p><a href=\"https://vonq.io/3u5cQQU\">Klick hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
        "how_to_apply": "<p><a href=\"https://vonq.io/3u5cQQU\">Klick hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHlaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b13f7473328b5e589c1cadb46970722e607115b2/Aldi.png"
    },
    {
        "id": "e5483130-371a-459b-aea8-89b7cef730f6",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e5483130-371a-459b-aea8-89b7cef730f6",
        "created_at": "Wed Feb 17 15:34:19 UTC 2021",
        "company": "Consors Finanz BNP Paribas S.A. Niederlassung Deutschland",
        "company_url": "https://www.bnpparibas.de",
        "location": "München",
        "title": "Java Software Developer (m/f/d)",
        "description": "<p>#loveyourjob #münchen</p>\n<h2>You will</h2>\n<ul>\n<li>Develop software solutions by studying the requirements, system and data flows, processes and investigate the problem areas by following the software development lifecycle</li>\n<li>Document the developed solutions by providing documentation, diagrams, flow charts, code comment and clear code</li>\n<li>Ensure compliance with the system architecture of all Java systems and applications</li>\n<li>Analyze operational risks in the Linux based software infrastructure (resource bottlenecks, vulnerabilities, errors) and develop appropriate countermeasures</li>\n<li>Provide support to software engineers to deliver the software solutions that fulfill the functional requirements and as well the non-functional requirements</li>\n<li>Work independent on the tasks allocated</li>\n</ul>\n<h2>You have</h2>\n<ul>\n<li>University degree in computer science, mathematics, natural sciences or engineering</li>\n<li>Several years (4+) of software development experience in the Linux environment and in the JEE environment</li>\n<li>In-depth knowledge of EJB3, JPA, REST, Hibernate, Spring, JSF, Vaadin is beneficial and application server knowledge (Tomcat, JBoss, Weblogic or Glassfish)</li>\n<li>Very good knowledge of SQL, Linux and script language as well as experience in database design</li>\n<li>Very good knowledge of IT security (especially web applications)</li>\n<li>Experience with the Unix based systems and desirable good knowledge of the banking industry</li>\n</ul>\n<h2>We offer</h2>\n<ul>\n<li>An attractive compensation package</li>\n<li>Company pension</li>\n<li>Opportunity to work from Home Office</li>\n<li>A versatile Development programme</li>\n<li>Water and Coffee for free</li>\n<li>(Inter-)national career oportunities at the BNP Paribas Group</li>\n<li>Subsidy to ÖPNV, Car- &amp; Bike- LeasingZuschuss zu ÖPNV, Car- &amp; Bike- Leasing</li>\n</ul>\n<h2>Wer wir sind</h2>\n<p>Consors Finanz ist Teil der BNP Paribas S.A. in Deutschland und hat ca. 1500 Mitarbeitende an fünf Standorten. BNP Paribas S.A. ist eine führende internationale Bank und in 73 Ländern mit 200.000 Mitarbeitenden vertreten.\nConsors Finanz BNP Paribas steht für finanzielle Selbstbestimmung in jeder Lebenssituation.</p>\n<p>Wir sind einer der führenden Anbieter für Konsumentenkredite in Deutschland und bieten Finanzierungs- und Versicherungslösungen, die sich an die Bedürfnisse unserer Kundinnen und Kunden anpassen. Ob dynamische Kreditrahmen, individuelle Finanzierungen oder flexible Kartenprodukte – mit dem digitalen Banking von Consors Finanz BNP Paribas nehmen Kundinnen und Kunden ihre Liquidität selbst in die Hand. Wir setzen dabei auf innovative Technologien, höchste Sicherheitsstandards und eine verantwortungsvolle Kreditvergabe.</p>\n<h2>Join us!</h2>\n<p>We are looking forward to your application via the <strong>\"Application\"</strong> form</p>\n<p>Your contact: Ralph Ullmann</p>\n<p>Telefon: 089/ 5511 333783</p>\n<p><a href=\"https://www.consorsfinanz.de/karrier\">https://www.consorsfinanz.de/karrier</a></p>\n<p><a href=\"https://vonq.io/2Nu2YPC\">Click here for the application form!</a></p>\n",
        "how_to_apply": "<p><a href=\"https://vonq.io/2Nu2YPC\">Click here for the application form!</a></p>\n",
        "company_logo": null
    },
    {
        "id": "8b7f6c33-241e-4b19-bbfa-fc3a997bba79",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/8b7f6c33-241e-4b19-bbfa-fc3a997bba79",
        "created_at": "Wed Feb 17 15:18:43 UTC 2021",
        "company": "CompuGroup Medical SE & Co. KGaA",
        "company_url": "https://vonq.io/3prfoVJ",
        "location": "Fürth",
        "title": "Softwareentwickler SQL / C# / .NET (m/w/d)",
        "description": "<h2>CompuGroup Medical hilft heilen</h2>\n<p>CompuGroup Medical liefert wichtige Software, um Gesundheit und Lebensqualität zu verbessern. Wir bauen Brücken zwischen Ärzten, Apothekern, Kostenträgern, Laboren, Reha- und Pflegeeinrichtungen und Krankenhäusern und helfen ihnen, Menschen optimal zu versorgen. Die Arbeit aller medizinischen Leistungserbringer zu verstehen und immer mehr zu erleichtern ist unser Ziel. Seit über 30 Jahren unterstützen wir unsere Kunden, Informationen sicher zu speichern, auszutauschen und Wissen abzufragen.</p>\n<ul>\n<li>Führendes internationales e-Health Unternehmen</li>\n<li>746 Mio. € Jahresumsatz in 2019</li>\n<li>Ca. 6100 Mitarbeiter weltweit</li>\n<li>Einzigartige Kundenbasis mit über 1 Mio. professionellen Nutzern weltweit</li>\n<li>Standorte in 18 und Produkte in 56 Ländern</li>\n<li>Über 30 Jahre erfolgreich im Markt</li>\n</ul>\n<p><strong>Als Softwareentwickler SQL / C# / .NET (m/w/d) gestalten Sie heute schon mit, was die Zukunft bringt!</strong></p>\n<p>Prägen Sie als Softwareentwickler unsere Apotheken-Software mit Ihrer Vision und programmieren Sie die digitale Zukunft des Gesundheitswesens! Mit CGM haben Sie Zugriff auf Erfahrungswerte von Jahrzehnten und gleichzeitig die Möglichkeit, mit uns gemeinsam Ihren Beitrag zu einer Verbesserung der medizinischen Versorgung zu leisten.</p>\n<h2>Ihr Beitrag:</h2>\n<ul>\n<li>Unter der Verwendung von Transact SQL und C# designen, entwickeln und implementieren Sie Anwendungsprogramme innerhalb unserer komplexen Apotheken-Systemlandschaft und konzipieren dazu Businesskomponenten</li>\n<li>Sie arbeiten mit Tools wie SQL Server und Visual Studio fortlaufend an der Weiterentwicklung unserer Produkte und sind für die Pflege der bereits bestehenden Frameworks zuständig</li>\n<li>Dabei unterstützen Sie bei der Planung und Organisation in einem agilen Softwareentwicklungsteam nach SAFe und Kanban sowie mit den Tools Jira und Confluence</li>\n</ul>\n<h2>Was uns wichtig ist:</h2>\n<ul>\n<li>Sie haben ein erfolgreich abgeschlossenes Studium im IT Bereich oder eine vergleichbare IT bezogene Ausbildung</li>\n<li>Sie können sehr gute Kenntnisse in der objektorientierten Programmierung, vorzugsweise C# / .NET vorweisen, haben gute Kenntnisse im Umgang mit Datenbanktechnologie und Microsoft SQL-Servern und kennen sich gut mit der Betriebssystemfamilie Microsoft Windows aus</li>\n<li>Von Vorteil sind weitere Kenntnisse mit Java oder Python sowie Kenntnisse über Apothekensoftware, idealerweise WINAPO®</li>\n<li>Sie zeichnen sich durch Engagement, Verantwortungsbewusstsein und Teamgeist aus und runden Ihre strukturierte Arbeitsweise mit Abstraktionsfähigkeit und logischem Denkvermögen ab</li>\n<li>Sie können fließend auf Deutsch und gut in Englisch kommunizieren</li>\n</ul>\n<h2>Was Sie von uns erwarten können:</h2>\n<ul>\n<li>Unser Marktführer-Umfeld stellt Ihnen die notwendigen Ressourcen für Ihre Erfolge bereit</li>\n<li>Flexible Arbeitszeiten fördern eine ausgewogene Work-Life-Balance</li>\n<li>Eine agile Lernkultur und hohen Zusammenhalt im Team</li>\n<li>Flache Hierarchien und kurze Entscheidungswege innerhalb der Abteilungen</li>\n<li>Gute Anbindungen zum Standort in Fürth sowie Vergünstigungen für den Stadtverkehr</li>\n<li>Zuschuss zur betrieblichen Altersvorsorge als Baustein einer sicheren Zukunft</li>\n<li>Auf Wunsch ermöglichen wir Ihnen die Teilnahme an Entwicklungsprogrammen und verschiedenen Weiterbildungen</li>\n<li>Ein umfangreiches Gesundheitsmanagement (Impfangebote, Augenuntersuchung) fördert Ihr Wohlbefinden</li>\n</ul>\n<p>Sie erleichtern es uns schnell richtige Entscheidungen zu treffen, wenn Sie uns über das <strong>Bewerbungsformular</strong> Ihre aussagekräftigen Unterlagen mit Ihren Gehaltsvorstellungen übermitteln.</p>\n<p><strong>Synchronizing Healthcare</strong></p>\n<p><strong>Werden Sie jetzt ein Teil davon!</strong></p>\n<p>Kennziffer:</p>\n<p><strong>req5675</strong></p>\n<p>Standort:</p>\n<p><strong>Fürth</strong></p>\n<p>Job Segment:</p>\n<p><strong>Software Development</strong></p>\n<p>Kontakt:</p>\n<p><strong><a href=\"mailto:career@cgm.com\">career@cgm.com</a></strong></p>\n<p><a href=\"https://vonq.io/3prfoVJ\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
        "how_to_apply": "<p><a href=\"https://vonq.io/3prfoVJ\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbG1aIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5573ed032e45275de4aa3ae53cbf9decc4692391/companyLogo-CGM_LOGO.jpg"
    },
    {
        "id": "30e2a50b-89ee-48b9-ac1f-15a46e8ac70c",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/30e2a50b-89ee-48b9-ac1f-15a46e8ac70c",
        "created_at": "Wed Feb 17 15:09:24 UTC 2021",
        "company": "SEAL Systems AG",
        "company_url": "https://www.sealsystems.de/",
        "location": "Röttenbach",
        "title": "Softwareentwickler für Convert & Publish Solutions (m/w/d)",
        "description": "<p>Wir bei SEAL Systems entwickeln Software Lösungen für Output Management, SAP, Konvertierung &amp; Publishing. Unsere Produkte sorgen in über 1.500 Installationen weltweit für schlanke Prozesse und einen hohen Kundennutzen. Unser Erfolgsrezept sind Innovation, Stabilität und die langfristige Zufriedenheit unserer Kunden und Mitarbeiter.</p>\n<p><strong>DEINE AUFGABEN:</strong></p>\n<p>Wir erschaffen unsere Software-Produkte mit viel Liebe zum Detail und haben noch einige Ideen, die in Code umzusetzen sind. Unser Convert &amp; Publish Solutions Team freut sich daher auf einen erfahrenen Softwareentwickler (m/w/d) mit sehr guten Kenntnissen in PDF und PostScript. Im Idealfall bist du ein Profi in der Druckvorstufe und setzt Kundenwünsche durch pragmatische Lösungen um.\nInteressiert? Dann bereichere unser Development-Team am Standort Röttenbach bei Erlangen als</p>\n<p><strong>Softwareentwickler für Convert &amp; Publish Solutions (m/w/d)</strong></p>\n<p>DEINE AUFGABEN:</p>\n<ul>\n<li>Entwickeln von Konverter-Microservices für unsere Cloudlösungen</li>\n<li>Weiterentwicklung und Pflege unserer Grafikkonverter und Ghostscript-Erweiterungen</li>\n<li>Mitarbeit bei der Konzeption und Umsetzung der nächsten Produktgeneration</li>\n</ul>\n<p><strong>DEIN PROFIL:</strong></p>\n<ul>\n<li>Sehr gute Kenntnisse in PDF und PostScript</li>\n<li>Fundierte praktische Erfahrung mit Ghostscript</li>\n<li>Gute C/C++ Kenntnisse</li>\n<li>NodeJS und JavaScript Kenntnisse vorzugsweise vorhanden</li>\n<li>GitHub, Cloud sowie agile Softwareentwicklung sollten Dir vertraut sein</li>\n<li>Gute Deutsch- und Englischkenntnisse</li>\n</ul>\n<p><strong>UNSERE BENEFITS:</strong></p>\n<ul>\n<li>Fachliche Weiterbildung</li>\n<li>Flexible Arbeitszeiten (incl. Homeoffice)</li>\n<li>Kostenlose Getränke und täglich frisches Bio Obst</li>\n<li>Massagen</li>\n<li>Firmeneigener Fitnessraum</li>\n<li>Bike Leasing</li>\n<li>Kindergarten-Zuschuss</li>\n<li>Vermögenswirksame Leistungen</li>\n</ul>\n<p><strong>UNSERE KULTUR:</strong></p>\n<p>Wir sind der Meinung, dass Firmenkultur die Persönlichkeit des Unternehmens ausmacht.\nFreue Dich auf ein Unternehmen, in dem flache Hierarchien, ein hervorragendes Betriebsklima, gegenseitige Wertschätzung und eine strukturierte Einarbeitung wesentliche Merkmale der Unternehmenskultur sind.</p>\n<p><strong>Kontakt</strong></p>\n<p>Deine Ansprechpartnerin für alle Fragen rund um unsere Jobs</p>\n<p>Carina Ott\nHR BUSINESS PARTNER\nE-Mail: <a href=\"mailto:bewerbung@sealsystems.de\">bewerbung@sealsystems.de</a>\nTelefon:  +49 9195-926-167</p>\n<p><img src=\"https://camo.githubusercontent.com/90dd8e3fe35eea06c8c7d871c29c61523cc73fcd/68747470733a2f2f742e676f686972696e672e636f6d2f682f38373663623264623964326361326463653134393664396365653930306538303663393136656235356365656361353930633835343463326234316630303238\"></p>\n",
        "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/1dcd3b14b8212e65064c4fd2efbdf5808016592b604eb2886bc36df6ee73a8b4\">application form</a></p>\n",
        "company_logo": null
    },
    {
        "id": "ae75d681-039a-4227-be73-24802275a160",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/ae75d681-039a-4227-be73-24802275a160",
        "created_at": "Wed Feb 17 10:16:13 UTC 2021",
        "company": "7digital Limited",
        "company_url": null,
        "location": "London, UK",
        "title": " Developer (C#/Node.js) ",
        "description": "<p>About us</p>\n<p>7digital is a platform product for the world’s music, hosting over 70 million tracks and processing thousands of new releases each week. As a B2B provider, we help our clients build innovative new music experiences, such as social video app Triller, home fitness challenger Apex Rides, and established streaming platforms like Soundtrack Your Brand.</p>\n<p>Founded in 2004, 7digital has spent over a decade at the cutting edge of music innovation. It started by building digital download stores for music labels, and it’s own direct to consumer offering for DRM-free downloads. 7digital was involved in a reverse merger with UBC Media in 2014, becoming publicly traded on the AIM. 2019 proved to be a pivotal year, and the business committed to investing in scalable, repeatable Product - its B2B API platform for music. In 2020, 7digital raised £6M to go after the emerging home fitness and social media markets, planning to double revenue and scale responsibly, in-line with client growth.</p>\n<p>About the role</p>\n<p>We’re working at scale – our service-oriented API Platform is handling billions of requests per month and growing quickly. Recent growth in our commercial pipeline into new industries, such as social media &amp; fitness, has led to increased use of our platform. We're hiring engineers into development &amp; SRE roles to build new functionality and scale up our API, media delivery &amp; content ingestion systems to meet the demand.</p>\n<p>You’ll be joining an enthusiastic technology team of 15 people who enjoy what they do and operate with autonomy. Techniques such as pair programming, TDD, and continuous delivery are deeply embedded and we’re constantly striving to improve the way we work. Development teams deploy into production multiple times a day and are empowered to deploy as soon as automated tests complete. However, we’re not perfect and not afraid to say so. We have problems to solve, and we’re on a journey of continuous improvement.</p>\n<p>We’re strong advocates of test-driven development, and would only consider you for a position if you have an interest in working with TDD. We value outcomes over output. We follow lean principles, building services based on measured impact rather than long lists of features. We use techniques such as kanban and user story mapping to ensure we deliver value at each step of the development process. We have regular sessions sharing ideas, discussing practices and technologies, and you’ll get two innovation days a month to investigate new technologies or ideas. We’re committed to an “inspect and adapt” philosophy.</p>\n<p>About You</p>\n<p>You care about software; you have a passion for what you do which you can clearly convey by your actions. You like to pick the right tool for the task at hand. You believe software development involves a lot more than just writing code. You see it as your remit to really understand our domain so we can all deliver as much value to the business as possible. To you, quality (both internal and external) really matters. These are things we really care about and make up a large part of our Tech Principles.</p>\n<p>Requirements</p>\n<p>Essential:</p>\n<p>Experience and a strong desire to develop using TDD\nWilling to participate and facilitate in paired programming\nExperience in either C# or Node.js\nCompetent in at least two languages (including any of C#, Node.js, Java, Ruby, Python etc)\nExperience of building pipelines to enable continuous delivery of features\nUnderstanding and caring of how your code runs in production (either in a data centre or cloud environment; Linux or Windows)\nExperience building REST APIs</p>\n<p>Desirable:</p>\n<p>AWS or GCP experience\nDocker &amp; Linux experience\nInfrastructure as code experience (CloudFormation, Terraform, etc)\nScripting experience (Bash, Python etc)\nMonitoring experience (ELK, DataDog, Grafana, Prometheus etc)\nData engineering experience (SQL, NoSQL, etc)\nUnderstand &amp; champion lean software development principles\nThe Development Team</p>\n<p>Our production systems run in a multi-cloud environment using various languages, primarily C# and Node.js. We are moving towards Linux and a cloud-native style architecture using technologies such as AWS Fargate and cloud functions. We have a strong DevOps culture and like to use externally managed services to allow us to focus on what makes our products great.</p>\n<p>The Development Team</p>\n<p>Day-to-day, here are some technologies you will be using:</p>\n<p>C#, Node.js\nLinux\nServerless - AWS Lambda &amp; Google Cloud Functions\nAWS &amp; GCP\nHTTP &amp; REST\nMessage Queues - SQS, PubSub\nRelational Databases - PostgreSQL &amp; SQL Server\nNoSQL &amp; Object Storage - MongoDB, S3, GCS\nInfrastructure as Code - Docker, CloudFormation, Terraform\nObservability - DataDog</p>\n<p>Benefits</p>\n<p>We are currently working 100% remote and will continue to embrace this in future, however we also love spending time with each other and will expect that in a post-Covid world there will be travel required into London at least 1-2 days per week for collaboration and team working.</p>\n<p>-We have a truly flexible and open working culture\n-Pet friendly, fully serviced offices in the heart of Camden with views over the canal\n-25 days holiday (increasing by one day each January, up to a maximum of 30 days\n-Bonus birthday day off\n-EMI Share Scheme Eligibility\n-A personal learning pot up to £500\n-Pension Scheme\n-Healthshield cash back scheme covering every-day medical expenses like dental, physio and - mental health support\n-Travel season ticket loan\n-Cycle to work scheme\n-Up to 3 days paid each year to do volunteer/charity work\n-Regular knowledge sharing talks\n-Pet friendly, fully serviced offices in the heart of Camden with views over the canal</p>\n<p>We are an equal opportunity employer and value diversity at our company. We welcome and encourage job applications from people of all underrepresented backgrounds.</p>\n<p>We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status or disability status. If you require any adjustments as part of our hiring process please let us know.</p>\n",
        "how_to_apply": "<p>To get in touch please go to; <a href=\"https://apply.workable.com/j/6E89C5B795\">https://apply.workable.com/j/6E89C5B795</a></p>\n<p>We are an equal opportunity employer and value diversity at our company. We welcome and encourage job applications from people of all underrepresented backgrounds.</p>\n<p>We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status or disability status. If you require any adjustments as part of our hiring process please let us know.</p>\n",
        "company_logo": null
    },
    {
        "id": "c9132c5d-616e-45f9-a6f9-d8f3fca50480",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/c9132c5d-616e-45f9-a6f9-d8f3fca50480",
        "created_at": "Tue Feb 16 17:08:08 UTC 2021",
        "company": "Fathom5",
        "company_url": "https://www.fathom5.co",
        "location": "Austin, TX",
        "title": "Mid- to Senior-Level Software Engineer",
        "description": "<h2>At Fathom5, we build the Operating System for the next generation of industrial technologies.</h2>\n<p>Our supply chains, manufacturing base, and critical infrastructure lag far beyond what our world needs in security, capability, and adaptability. We're here to fix that.</p>\n<p>Our team is in search of ambitious, curious, and mission-driven Software Engineers at all levels. You will have the opportunity to use the most modern software development tools to work on cutting-edge projects: <strong>building platforms for machine learning, cybersecure DEVOPS pipelines, enclaves for advanced manufacturing (e.g. 3D printing, robotics arms...)</strong> and much more.</p>\n<p>You will be a key part in realizing our technical vision and taking the company to the next level. We can't wait for you to be part of our swiftly growing team as we drive forward with our mission to <strong>Secure the Digital Future</strong>.</p>\n<h3>A Fathom5 Software Engineer will:</h3>\n<ul>\n<li>Have clear ideas about software architecture and design and the opportunity to express them when working alongside the CEO, Chief Engineer, and Director of Software Development to build cutting-edge technologies</li>\n<li>Find joy in: working alongside team members that are at, below, and above your skill-level to solve technical challenges; providing mentorship; and receiving mentorship (as a software engineer and as a leader) in turn</li>\n<li>Seek out, claim, and solve challenging tasks/issues for development, and support others as they do the same</li>\n<li>Depending on your interest, lead small teams of engineers OR become an internal subject matter expert on a core element of our software base</li>\n</ul>\n<h3>A Fathom5 Software Engineer will:</h3>\n<ul>\n<li>Be intimately familiar with developing and maintaining software projects with a microservices architecture</li>\n<li>Be accustomed to everyday use of Windows and UNIX CLI tools</li>\n<li>Have familiarity with cloud computing platforms</li>\n<li>Have proficiency in Git</li>\n<li>Be cognizant of project technical debt and its management</li>\n</ul>\n<h3>She/he will also preferably have two or more of the following technical qualities:</h3>\n<ul>\n<li>CI/CD experience</li>\n<li>System monitoring and logging experience</li>\n<li>Experience in the creation, use, and orchestration of containerization technologies</li>\n<li>Database engineering experience</li>\n<li>Agile development experience</li>\n<li>Asymmetric/symmetric encryption experience</li>\n</ul>\n<h3>An individual in the Fathom5 Software Engineer position will develop/possess the following traits:</h3>\n<ul>\n<li>Programming expertise -- Mastery of one or more statically-typed programming languages (Go, Rust, C, and C++ preferred) with the ability to address advanced programming concepts. At least 2 years of GOLANG experience is highly desirable.</li>\n<li>Clear and effective communication -- Written and oral communication skills sufficient to explain technical material to other team members and customers.</li>\n<li>Quick learning and problem-solving -- The ability and desire to learn new technologies swiftly and enact decisive solutions in development.</li>\n<li>Passion -- A natural disposition and passion for development as proven by an extensive portfolio of effective projects.</li>\n<li>Leads with initiative -- The desire to lead by example through effective management skills and proactive address of diverse needs on various projects.</li>\n<li>Ability to travel -- Occasional domestic and international travel in support of client projects and team goals.</li>\n</ul>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:hello@fathom5.co\">hello@fathom5.co</a></p>\n",
        "company_logo": null
    },
    {
        "id": "922bafc3-4234-46d6-a766-7945b05349d3",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/922bafc3-4234-46d6-a766-7945b05349d3",
        "created_at": "Tue Feb 16 16:50:20 UTC 2021",
        "company": "MentorMate",
        "company_url": "https://mentormate.com/",
        "location": "Remote",
        "title": "JavaScript Developer w/ Vue.js",
        "description": "<p><strong>OVERVIEW</strong></p>\n<p><em>Note: Due to the current public health situation, all job interviews will be conducted online until further notice.</em></p>\n<p>We are looking for a passionate JavaScript developer to join our super cool team of Vue experts. You’ll have the honor to participate in the creation of enterprise-class web applications, using proven design patterns on the latest technology platforms.</p>\n<p>You don’t need astronaut skills to become part of our incredible Vue team – you simply need to have experience building user interfaces and single-page applications with Vue, to love writing tests (or specs, whichever you prefer), and to work in a dynamic environment with international clients.</p>\n<p>Our software solutions tackle specific tech challenges across several industries. While our roots are in education, nearly half of our current projects are focused on healthcare and the large amounts of secure data that come with it. We also innovate in finance, real estate, commerce, IoT, and others.</p>\n<p><strong>WHAT YOU NEED TO HAVE:</strong></p>\n<ul>\n<li>1+ years of experience with Vue.js</li>\n<li>2+ years of experience with JavaScript</li>\n<li>Experience with HTML5, CSS3</li>\n<li>Experience with Vuex, Mobx, Flux or Redux</li>\n<li>Experience in developing cross-browser web applications</li>\n<li>Responsible team player with awesome communication skills</li>\n<li>Excellent spoken and written English</li>\n</ul>\n<p><strong>EXTRA POINTS IF YOU HAVE:</strong></p>\n<ul>\n<li>Experience with JS OOP Design Patterns</li>\n<li>Experience with React.js</li>\n<li>Experience with Angular</li>\n<li>BS/MS Degree in Computer Science or equivalent</li>\n</ul>\n<p><strong>WHAT WILL YOUR RESPONSIBILITIES BE:</strong></p>\n<ul>\n<li>Participate in the architecture, design and development phase of software production</li>\n<li>Build single page applications with Vue.js</li>\n<li>Build server-side RESTful APIs (JSON/XML)</li>\n<li>Deliver high-quality software with extensive Unit Testing</li>\n<li>Ensure the best possible performance, quality, and responsiveness of applications</li>\n<li>Enforce best coding and UI standards, evaluate others’ work</li>\n<li>Participate successfully in an established daily Scrum process</li>\n</ul>\n<p><strong>HOW WILL YOU SPEND YOUR TIME:</strong></p>\n<ul>\n<li>50% Writing code and tests</li>\n<li>25% Scrumming and helping others on the team</li>\n<li>10% Reviewing teammates’ code</li>\n<li>5% DevOps</li>\n<li>5% Refactoring</li>\n<li>5% Documenting</li>\n</ul>\n<p><strong>WHAT WE OFFER:</strong></p>\n<ul>\n<li>Freedom to work remotely from anywhere in the world</li>\n<li>Opportunity to join a community of 650+ developers worldwide</li>\n<li>Latest technologies to choose from</li>\n<li>Inspiring opportunities to work on various projects and software solutions that set standards</li>\n<li>Professional growth in a global company</li>\n<li>Chance to upgrade your benefits package based on the number of hours you work with us</li>\n<li>Employee referral program with bonuses</li>\n</ul>\n",
        "how_to_apply": "<p>Apply here: <a href=\"https://bit.ly/2ZvEqZf\">https://bit.ly/2ZvEqZf</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBazZaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--00e45544149b0ca2c12cd0ea34d47b14b59e11fb/MM-logo-stacked-color%20(1).png"
    },
    {
        "id": "dc764f86-69e6-4301-94f6-d9e5f4f2c1ab",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/dc764f86-69e6-4301-94f6-d9e5f4f2c1ab",
        "created_at": "Tue Feb 16 12:16:00 UTC 2021",
        "company": "Limango",
        "company_url": "https://www.limango.de/ehp",
        "location": "Munich",
        "title": "Backend Developer (m/w/d)",
        "description": "<p><strong>OUR MISSION</strong></p>\n<p>limango is the Online Shop for families – We wow our customers every day with a fantastic range of brands at very attractive prices. Based in Munich, our 300 employees share a passion for families. We do everything we can to understand their needs and fulfil their wishes. limango has everything families need: Fashion for Babies, Kids, Women and Men as well as Homeware, Toys, Cosmetics and Family holidays. At limango you’ll find both classic brands and upcoming brands from across Europe. Founded in 2007 and a member of the Otto Group since 2009 limango now has over 14 million members across Germany, Austria, France, the Netherlands and Poland and sells over 40 000 products daily to German customers alone. We want to continue to grow and win the trust of all mums in Europe. To help us achieve this, we’re looking for motivated, talented individuals to work with us and be a part of something big.</p>\n<p><strong>YOUR JOB</strong></p>\n<ul>\n<li>In the limango IT you get the chance to contribute your own ideas and know-how to the development of services all around the different processes of our ecommerce business</li>\n<li>Together with our experienced and international development teams you will improve and expand our backend systems</li>\n<li>You will become part of our well-rehearsed agile teams of versatile and experienced developers and a dedicated product owner</li>\n</ul>\n<p><strong>YOUR PROFILE</strong></p>\n<ul>\n<li>A degree with a focus on IT or a comparable training</li>\n<li>You have sound professional experience in the development of scalable eCommerce applications in common PHP frameworks such as Symfony3+ as well as knowledge of OOP and design patterns</li>\n<li>You bring practical experience with RESTful APIs and service-oriented architecture</li>\n<li>You have profound experience in relational databases (MySQL/MariaDB)</li>\n<li>DevOps and GoLang experience are desirable</li>\n<li>A well-functioning tool is not enough for you - you enjoy optimizing complex IT processes!</li>\n</ul>\n<p><strong>OUR OFFER</strong></p>\n<ul>\n<li>Exciting, technically demanding challenges in a highly frequented online shop with focus on high scalability and performance</li>\n<li>Agile development, Scrum teams, flat hierarchies and direct communication in a very comradely atmosphere</li>\n<li>A steep learning curve in a dynamic company with international orientation</li>\n<li>A great office in the Tech-Spot of Munich with probably the coolest roof terrace in the city</li>\n</ul>\n<p>Interested? We look forward to receiving your complete application including a letter of motivation, salary requirements and your earliest possible starting date.</p>\n<p><img src=\"https://camo.githubusercontent.com/48ee398c3c71a3dd8146a010f82d6dd2341a5066/68747470733a2f2f742e676f686972696e672e636f6d2f682f65633735356233343837643761333039633239333938393839386464316235313964656639363963346637306539386438633436633830303139366539346131\"></p>\n",
        "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/f879f58f8dba6fe4d97110abcd38f23bab97beeaecbbfef7a0ce5223b16625e1\">application form</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa0NaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d7e86dc77651a988fe8234df4e4a00a5fb78505e/Limango.jpg"
    },
    {
        "id": "ee163ad3-116c-49ec-bfd6-cabec6b88e13",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/ee163ad3-116c-49ec-bfd6-cabec6b88e13",
        "created_at": "Mon Feb 15 15:07:11 UTC 2021",
        "company": "Humanoo ",
        "company_url": "http://humanoo.com",
        "location": "Berlin ",
        "title": "SysOps / DevOps Engineer (f/m/d)",
        "description": "<p><strong>Humanoo. Making people healthier - together with you</strong></p>\n<p>We are looking for a <strong>SysOps / DevOps Engineer</strong> (f/m/d) to join us at Humanoo on our mission to become Europe’s leading health rewards platform. If you are looking to spearhead complex projects together with our Infrastructure Lead and Security Management - this role is for you.</p>\n<p><strong>WE OFFER</strong></p>\n<ul>\n<li>\n<p>The latest technologies available in the market</p>\n</li>\n<li>\n<p>Fun and dedicated cross-functional team</p>\n</li>\n<li>\n<p>Your personal growth plan and budget</p>\n</li>\n<li>\n<p>Up to 29 days off, including 3 Event Days, BVG-ticket contribution</p>\n</li>\n</ul>\n<p><strong>WHAT WILL YOU BE WORKING ON?</strong></p>\n<ul>\n<li>\n<p>You set up and manage our AWS infrastructure. In short: Keep HUMANOO fast and alive!</p>\n</li>\n<li>\n<p>You  monitor and maintain system performance. The bigger we get, the more complex our demands: We rely on you to keep our systems up.</p>\n</li>\n<li>\n<p>You manage automation of reproducible configuration and rollout processes. We all need an extra hour in our day, right? That’s where you come in!</p>\n</li>\n<li>\n<p>You keep track of future projects, supporting the team to recognise and solve roadblocks in time. We’re ambitious. Sometimes we go a bit too fast: Up to you to keep the ship on course.</p>\n</li>\n<li>\n<p>You perform infrastructure cost analysis and optimization</p>\n</li>\n<li>\n<p>You troubleshoot problems across a wide range of services and functional areas</p>\n</li>\n</ul>\n<p><strong>HOW DO YOU FIT IN?</strong></p>\n<ul>\n<li>\n<p>You have at least 3-5 years hands on maintaining AWS infrastructure</p>\n</li>\n<li>\n<p>You bring in strong understanding of how to secure AWS environments and meet compliance requirements</p>\n</li>\n<li>\n<p>You have experience with AWS Services (EC2, Fargate, ALB, RDS, VPC, SQS, S3 and CloudFormation)</p>\n</li>\n<li>\n<p>You know your way in Nginx, Tomcat, Docker and Queues</p>\n</li>\n<li>\n<p>Linux / Unix has no secrets for you</p>\n</li>\n<li>\n<p>Of course, you understand Git, ElasticSearch, MySQL, Redis</p>\n</li>\n<li>\n<p>You know at least two programming languages (Java, Python, NodeJS or Go)</p>\n</li>\n<li>\n<p>You have experience working with Microservices Architecture patterns, versioning and deployments</p>\n</li>\n<li>\n<p>And last but not least: you bring in a strong sense for action and ownership</p>\n</li>\n</ul>\n<p><strong>NICE TO HAVE:</strong></p>\n<ul>\n<li>\n<p>Kafka/Kinesis experience is a plus</p>\n</li>\n<li>\n<p>Data Warehouses (Redshift, Athena) experience is a big plus</p>\n</li>\n</ul>\n<p><strong>WORKING AT HUMANOO</strong></p>\n<p>At Humanoo, we make people healthier - by taking the digital health market to the next level and becoming the leading health rewards platform across Europe. With our digital health app we motivate our customers with daily routines to a healthier life and enable them to stay balanced and relaxed - both at work and in private life. So, are you ready to make your contribution?  <strong>Apply today and join us!</strong></p>\n",
        "how_to_apply": "<p><a href=\"https://smrtr.io/4_y3\">https://smrtr.io/4_y3</a>_</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBajJaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--98b26c906455125b4c54887a81d4eb3782c282e5/Humanoo%20Logos-02.jpg"
    },
    {
        "id": "196cec66-d906-4ace-8ba0-360132fb4693",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/196cec66-d906-4ace-8ba0-360132fb4693",
        "created_at": "Mon Feb 15 12:47:16 UTC 2021",
        "company": "BITGRIP GmbH",
        "company_url": "https://www.bitgrip.de",
        "location": "Berlin",
        "title": "Software Architect (w/m/x)",
        "description": "<p>BITGRIP erschafft exzellente digitale Erlebnisse. Wir zaubern unseren Partnern ein Lächeln aufs Gesicht. Mit über 500 Jahren geballter Projekterfahrung unterstützen wir in jedem Bereich der digitalen Wertschöpfung – von der Businessanalyse und Strategie-Beratung über IT-Architektur, UX-Design, Softwareentwicklung und -betrieb bis hin zur Prozessanalyse und -automatisierung.</p>\n<p><strong>Aufgaben</strong></p>\n<p>Wir suchen Dich als Software Architect (w/m/x) zur Verstärkung des #bestteamintown.</p>\n<p>In deiner Rolle stellst du im Team die technischen Weichen für das erfolgreiche Umsetzen von Projekten. Projektübergreifend bist du für das Design und die Architektur der entwickelten Lösung verantwortlich und schärfst in regelmäßigen Sessions die technischen Ziele der Implementierung. Dabei sind dir Wartbarkeit, Verständlichkeit und Stabilität ein besonderes Anliegen.</p>\n<p><em>Deine Aufgaben</em></p>\n<ul>\n<li>Du übernimmst die technische Verantwortung für das Lösungsdesign und die Architektur in unseren agilen Projekten</li>\n<li>Du analysierst, konzipierst, entwickelst und pflegst moderne Cloud native-Lösungen auf Basis von Kubernetes und Microservices</li>\n<li>Du hast den technischen Überblick über das gesamte Projekt und berätst Stakeholder und Productowner</li>\n<li>Du coachst Entwickler in Design-Sessions und beim Pair-Programming</li>\n<li>Du dokumentierst die entstandene Lösung mit arc42 Templates und UML2</li>\n<li>Du beteiligst dich aktiv an unseren agilen Prozessen und teilst dein Wissen</li>\n</ul>\n<p><strong>Qualifikation</strong></p>\n<ul>\n<li>Du hast ein abgeschlossenes Studium mit einer technischen Ausrichtung oder eine Ausbildung im IT-Bereich</li>\n<li>Du hast mindestens 8 Jahre Erfahrung in der Entwicklung von Backend-Anwendungen</li>\n<li>Du hast mindestens 3 Jahre Erfahrung in der Rolle als Software Architekt und warst technisch verantwortlich für die umgesetzten Projekte</li>\n<li>Du kennst die Vor- und Nachteile klassischer und moderner Software Architekturen</li>\n<li>Du denkst in architektonischen Konzepten und Mustern und kannst diese sicher anwenden und erklären</li>\n<li>Du kannst sicher auf Deutsch und Englisch kommunizieren</li>\n<li>Du hast den Anspruch, die beste Lösung für unsere Kunden zu finden</li>\n<li>Du arbeitest bestenfalls aktiv an Open-Source-Projekten mit</li>\n</ul>\n<p><em>Dein Werkzeugkasten enthält</em></p>\n<ul>\n<li>SOLID Principles</li>\n<li>Enterprise Integration Pattern</li>\n<li>Software Design Pattern</li>\n<li>API-Design</li>\n<li>SQL und NoSQL Datenbanken</li>\n<li>Memory Grids und Messaging Systeme</li>\n<li>Autorisierungsflows</li>\n<li>Netzwerkprotokolle</li>\n<li>UML2</li>\n<li>Docker, Kubernetes</li>\n<li>Java, Spring Boot, Spring Security, JPA und Hibernate</li>\n<li>Go, NodeJS</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Ein leistungsfähiges Tech Stack</li>\n<li>Flache Hierarchien, Eigenverantwortung, Spaß</li>\n<li>Auswahl deiner Hard- &amp; Software</li>\n<li>flexible Arbeitszeiten &amp; Homeoffice für alle</li>\n<li>Einen unbefristeten Voll- oder Teilzeitvertrag mit attraktiver Vergütung und ganz wichtig: bei uns werden Überstunden vermieden und in Freizeit umgewandelt</li>\n<li>Zertifizierte Schulungsangebote</li>\n<li>6 Wochen Urlaub</li>\n<li>BAV</li>\n<li>Jobrad / Jobticket</li>\n<li>Kein Dresscode</li>\n</ul>\n<p>Klingt gut soweit? Dann bewirb dich direkt oder melde dich via E-Mail, Twitter oder LinkedIn bei uns inklusive deines frühestmöglichen Eintrittstermins und deiner Gehaltsvorstellungen und wir bringen dich mit deinem neuen Team in Kontakt – unkompliziert und ohne zig Gesprächsrunden.</p>\n<p>Werde Teil des #bestteamintown!</p>\n",
        "how_to_apply": "<p><a href=\"https://bitgrip.join.com/jobs/1884535-software-architect-w-m-x?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=software%2Barchitect%2Bw%2Bm%2Bx\">https://bitgrip.join.com/jobs/1884535-software-architect-w-m-x?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=software%2Barchitect%2Bw%2Bm%2Bx</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanFaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--109070d4284342b032f221af4974c07cda648366/bitgrip.png"
    },
    {
        "id": "506693c3-258f-45c5-b77d-895eda1d77d1",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/506693c3-258f-45c5-b77d-895eda1d77d1",
        "created_at": "Mon Feb 15 11:23:42 UTC 2021",
        "company": "fibrisTerre Systems GmbH",
        "company_url": "http://www.fibristerre.de",
        "location": "Berlin",
        "title": "Experienced Software Developer C/C++ (m/f/d)",
        "description": "<p><strong>fibrisTerre is a young, Berlin-based tech company that designs and manufactures fiber-optic sensing instrumentation for infrastructure monitoring projects around the world.</strong></p>\n<p>We are offering a permanent position with exciting and diverse challenges to an experienced C/C++ developer with a broad range of skills and strong passion for problem-solving.</p>\n<p>Your main responsibility will be the development of desktop applications mostly using the Qt framework. You will help design and implement the user interface as well as the data processing back-end, making sure that our customers experience the exceptional performance, stability and usability that fibrisTerre’s products are known for.</p>\n<p><strong>Your Tasks and Responsibilities:</strong></p>\n<ul>\n<li>Develop complex software solutions (Windows and Linux) for industrial applications</li>\n<li>Design and implement TCP/IP-based communication protocols and data interfaces</li>\n<li>Identify bottlenecks and bugs and find efficient solutions for them</li>\n</ul>\n<p><strong>What we expect:</strong></p>\n<ul>\n<li>Professional experience with C/C++</li>\n<li>Good understanding of object-oriented programming concepts</li>\n<li>Professional experience implementing multi-threaded desktop applications</li>\n<li>Good understanding of memory management in non-garbage-collected environments</li>\n<li>Interest in developing automated test frameworks</li>\n</ul>\n<p><strong>Bonus skills:</strong></p>\n<ul>\n<li>Familiarity with the Qt framework and its development tools</li>\n<li>Good understanding of TCP/IP and experience with network analysis tools such as Wireshark</li>\n<li>Experience with modern C++</li>\n<li>Familiarity with Git</li>\n<li>Linux and/or MS Windows scripting skills</li>\n<li>Familiarity with embedded systems and low-level hardware interactions</li>\n<li>Experience with databases</li>\n<li>Experience with Matlab, Python</li>\n</ul>\n<p><strong>What we offer:</strong></p>\n<ul>\n<li>A fair compensation package that reflects your skills and experience</li>\n<li>Inspiring tasks driven by technology and innovation</li>\n<li>Becoming part of our small, dedicated team in Berlin-Friedrichshain</li>\n<li>Need to stay flexible with your work location? Let’s discuss, we will find a way!</li>\n</ul>\n<p>We are looking forward to your application! Please send to:</p>\n<p>fibrisTerre Systems GmbH | Torellstr. 7 10243 Berlin | Nils Nöther | <a href=\"mailto:jobs@fibristerre.de\">jobs@fibristerre.de</a> | +49 30 6290 1320</p>\n",
        "how_to_apply": "<p>Contact us at <a href=\"mailto:jobs@fibristerre.de\">jobs@fibristerre.de</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBamVaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--223d4fe86ed934d60893083ebe54d8064f22cb80/ft_logo_gv_rgb.jpg"
    },
    {
        "id": "1d4e9ba0-865c-41e6-96a2-88773ee01242",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/1d4e9ba0-865c-41e6-96a2-88773ee01242",
        "created_at": "Mon Feb 15 10:49:23 UTC 2021",
        "company": "Synedat Consulting GmbH",
        "company_url": "https://www.synedat.com/",
        "location": "Helmstedt",
        "title": "Full Stack Developer (m/w/d)",
        "description": "<p><strong>DEINE AUFGABEN</strong></p>\n<ul>\n<li>professionelle Umsetzung von kundenindividuellen Anforderungen in Projekten über alle Phasen des Entwicklungsprozesses hinweg (E-2-E)</li>\n<li>Entwicklung und Integration von modernen IT-Anwendungen insbesondere im Cloud-Umfeld</li>\n<li>Unterstützung beim Application-Management</li>\n</ul>\n<p><strong>DEIN PROFIL</strong></p>\n<ul>\n<li>Abgeschlossenes (Fach-)Hochschulstudium mit Fachrichtung Informatik oder einer vergleichbaren Ausbildung</li>\n<li>umfangreiche Berufs- und Projekterfahrung in der Anwendungsentwicklung im Bereich Automotive</li>\n<li>Sehr gute Kenntnisse in der Entwicklung mit aktuellen Java SE/EE Technologien</li>\n<li>fundierte und praktische Kenntnisse moderner Frameworks und Werkzeuge (z.B.: React, Spring, Angular, JPA, Hibernate, JSON, XML, Eclipse/IntelliJ)</li>\n<li>Sicherer Umgang in der Anwendung von bekannten Vorgehensmodellen / Methoden (z.B. Agile, Scrum, UML, Patterns, Refactoring)</li>\n<li>Kenntnisse im Einsatz von Applikationsservern, Datenbanksystemen oder Middleware-Produkten</li>\n<li>Erfahrungen mit der Konzeption und Implementierung von Schnittstellen zur Integration neuer und bestehender IT-Systeme in Cloud-Architekturen</li>\n<li>analytisches Denkvermögen</li>\n<li>ausgeprägte Kunden- und Serviceorientierung</li>\n<li>Teamfähigkeit und Kommunikationsstärke</li>\n<li>sehr gute Kenntnisse der deutschen Sprache in Wort und Schrift</li>\n</ul>\n<p><strong>WARUM WIR?</strong></p>\n<ul>\n<li>eine anspruchsvolle Tätigkeit in einem qualifizierten und engagierten Team</li>\n<li>Verantwortung von Anfang an mit weitergehenden Perspektiven</li>\n<li>angemessene, leistungsorientierte Vergütung</li>\n<li>regelmäßige, fachspezifische Weiterbildungen</li>\n<li>moderne Arbeitsmittel und hochwertig ausgestattete Arbeitsplätze</li>\n<li>Verlässlichkeit, Offenheit, Fairness und Respekt in der Zusammenarbeit</li>\n<li>flexible Arbeitszeiten für Ihre Work Life Balance</li>\n<li>Mitwirkung bei der Entwicklung eines dynamischen, wachsenden Dienstleistungsunternehmens</li>\n</ul>\n<p><strong>ÜBER UNS</strong></p>\n<p>Als agiles Technologie- und Beratungsunternehmen aus Niedersachsen ist es unsere Motivation, neue Impulse zu setzen und Optimierungsmöglichkeiten für unsere Partner aufzuzeigen. Damit aus dieser Vision auch ein echter Erfolg werden kann, braucht es die richtige Beratung und Umsetzung. Unternehmen kennen ihre Ziele und Herausforderungen, wir die Praktiken und Methoden auf dem Weg zur besten Lösung.\nIn Zeiten immer komplexer werdender Ansprüche heißt es, Zusammenhänge zu verstehen und verständlich zu machen. Die Herangehensweise an Projekte mit großer Komplexität meistern wir als Team und vor allen Dingen auch mit Spaß an der Arbeit.</p>\n<p>Verschiedene Charaktere und Stärken ergänzen sich bei uns zu einem erfolgreichen Team. Wir möchten uns miteinander wohlfühlen, während wir Lösungen für unsere Kunden erarbeiten. Unseren Kollegen begegnen wir auch nach der Arbeitszeit mit einem ehrlichen Lächeln.\nZur Bewältigung der wachsenden Auftragslage benötigen wir motivierte IT-Experten. Wenn Du Lust hast, mit einem dynamischen, innovativen Team die digitale Transformation voranzutreiben, dann bewirb Dich jetzt bei uns!</p>\n<p>Sende uns Deine Bewerbung mit Deiner Gehaltserwartung sowie dem frühestmöglichen Starttermin.</p>\n<p><strong>Hinweis für Personalvermittler:\nDie Ausschreibungen sowie die angegebenen Kontaktinformationen dienen ausschließlich zur Kontaktaufnahme durch freie Mitarbeiter und Stelleninteressenten. Wir bitten daher davon abzusehen, uns als Personalvermittler Recruiting-Dienstleistungen anzubieten.</strong></p>\n<p><img src=\"https://camo.githubusercontent.com/9a202139b06d2972d27d31bb3fa736197971a43d/68747470733a2f2f742e676f686972696e672e636f6d2f682f64326663613139616162613531326261316264336438366164326339306363656463363838373366616234373136616533343766363664626231656433353136\"></p>\n",
        "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/ccd8da240d65971991288dae01ae01ab6dbcef0b10592b3a07f5fbb1fc9831d2\">application form</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaldaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3cccb813e8c7ece7cb0d0347d1c0ce68f44a150b/Synedat.png"
    },
    {
        "id": "91382f4d-269e-49c8-b256-fbd06a4e20cb",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/91382f4d-269e-49c8-b256-fbd06a4e20cb",
        "created_at": "Sun Feb 14 23:20:36 UTC 2021",
        "company": "SKIES Inc",
        "company_url": "https://skieslearn.com",
        "location": "Remote",
        "title": "iOS Developer (Objective C) for Fast Growing Educational Technology Company",
        "description": "<p>Full-time mid-level iOS developer with experience programming in Objective C sought to help develop SKIES (<a href=\"https://skieslearn.com\">https://skieslearn.com</a>), a platform used every day by over 20,000 students and teachers from 100 schools.</p>\n<p>Small and fast-growing educational technology company started by Caltech alums seeks pioneering employees wanting to make an outsized positive impact on the world. Work on the challenge of a lifetime, improving student achievement in Los Angeles’ highest-need schools. Interesting projects combining high technology with broad, effective implementations will be yours, as you work alongside motivated and visionary school staff, and talented and intense co-workers. Make incredible differences while gaining far-ranging experiences, and see results right away in teachers you make happier and students you make smarter.</p>\n<p>You would be helping to develop the SKIES iOS app, a fully native app written in Objective C.</p>\n<p>An ideal candidate</p>\n<ul>\n<li>is able to build large and complex, yet maintainable, systems;</li>\n<li>is resourceful, motivated, and tenacious;</li>\n<li>is good at solving problems; and</li>\n<li>is good at communicating.</li>\n</ul>\n<p>The company is based in Pasadena, California, but the work is fully remote.</p>\n",
        "how_to_apply": "<p>Email your resume to co-founder <a href=\"mailto:julius@skieslearn.com\">julius@skieslearn.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBak9aIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--de3f94b2a15ec055d3a3a219a2dfffdf87e5ee34/SKIESLogoRoundedCorners.jpg"
    },
    {
        "id": "ba68c375-adf4-4317-8328-8bd82079fc61",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/ba68c375-adf4-4317-8328-8bd82079fc61",
        "created_at": "Sat Feb 13 01:29:29 UTC 2021",
        "company": "Nav Inc.",
        "company_url": null,
        "location": "Remote",
        "title": "Backend Software Engineer",
        "description": "<p>Backend Software Engineer - Remote or In Office (UT, PA, CA)</p>\n<p>Nav was founded to have a meaningful impact on the lives of millions of small business owners by bringing efficiency and transparency to financial decision making. We are changing the way these business owners secure lending with our innovative technology and customer-centric approach. We build intelligent software on top of data to solve issues in the small business financial ecosystem.</p>\n<p>We are passionate about empowering our teams and giving them the freedom to shape our future. Our teams lead with candor, charge hard, fail fast, all while working in a fun, diverse, and inclusive environment. If you are a high-energy innovator, enjoy a rapid-paced growing environment, and have the zest to solve big challenges, join us! Be a part of our history and co-create the future of FinTech here at Nav.</p>\n<p>YOUR ROLE AT NAV:\nBuild and maintain backend services written in Elixir, Go, Ruby or Python. Migrating functionality from legacy monoliths to new services.\nOptimize Nav’s customer experience, from first contact, through sign-up, and applying for loans and credit cards.\nBuild the framework that Nav’s solutions (credit reports, alerts, financing marketplace) plug into.\nTurn business requirements into technical solutions.\nHelp establish best practices within Nav's growing Engineering organization.</p>\n<p>WHAT YOU BRING TO THE TABLE:\nA track record of successfully delivering maintainable backend systems in a Linux environment.\nExperience or a strong interest in programming in Elixir or Go. Experience with Ruby or Python is a plus.\nRelentless problem solver.</p>\n<p>WHO YOU ARE:\nYou uplift those around you.\nYou’ve got great verbal and written communication skills.\nYou’ve got amazing relationship-building and relationship-management skills.\nYou are comfortable working on complex projects with multiple stakeholders.\nYou have an entrepreneurial spirit and thrive in a fast-paced environment.\nYou have a bias for action, a “driver” that gets stuff done, using analytical thinking.\nYou are comfortable with ambiguity, ability to change course quickly based on new insights.</p>\n",
        "how_to_apply": "<p><a href=\"https://nav.bamboohr.com/jobs/view.php?id=180&amp;source=aWQ9MTU%3D\">https://nav.bamboohr.com/jobs/view.php?id=180&amp;source=aWQ9MTU%3D</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaStaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1b67c64f0c6d9ca4d6a08dcb2ed783b49a6fc3a0/Nav%20Logo%20-%20Blue.png"
    },
    {
        "id": "eb294c80-0d62-47a3-9cf6-048daeaad041",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/eb294c80-0d62-47a3-9cf6-048daeaad041",
        "created_at": "Sat Feb 13 01:20:45 UTC 2021",
        "company": "Nav Inc.",
        "company_url": null,
        "location": "Remote",
        "title": "Senior Platform (DevOps) Engineer ",
        "description": "<p>Senior Platform (DevOps) Engineer - Remote or In Office (UT, PA, CA)</p>\n<p>Nav was founded to have a meaningful impact on the lives of millions of small business owners by bringing efficiency and transparency to financial decision making. We are changing the way these business owners secure lending with our innovative technology and customer-centric approach. We build intelligent software on top of data to solve issues in the small business financial ecosystem. Our ability to collect, aggregate, enrich and distribute this data makes us unique and presents many avenues for business growth.</p>\n<p>We are passionate about empowering our teams and giving them the freedom to shape our future. Our teams lead with candor, charge hard, fail fast, all while working in a fun, diverse, and inclusive environment. If you are a high-energy innovator, enjoy a rapid-paced growing environment, and have the zest to solve big challenges, join us… Be a part of history and co-create the future of FinTech.</p>\n<p>WHAT YOU’LL HELP US DRIVE\nDesigning, developing, and maintaining scalable, reusable code and operations infrastructure.\nMaintaining and cultivating the infrastructure and tool set for multiple development and production environments.\nDefining, creating and contributing to a range of tools used by Nav employees.\nActive participation on a diverse set of topics relating to business and or the engineering team.\nParticipating in Nav's agile process within Jira.\nBeing an effective communicator, having a positive attitude,\nIdentification of solutions, communication and alignment with engineering and stakeholders. \nPerforming as a coach and mentor to your team, and the organization as a whole.</p>\n<p>WHAT YOU BRING TO THE TABLE:\n2+ years of industry experience in Operations, DevOps, or SysAdmin Engineering.\nMust be comfortable or expert with Linux\nProficiency in managing and optimizing databases, preferably Postgres.\nExperience with configuration management, preferably Ansible\nFluency with Cloud infrastructure, preferably AWS (EC2, RDS, SAM, S3, VPC, EKS)\nExperience with SCM solutions, preferably git (specifically gitlab)\nUnderstanding and ability to create continuous integration and continuous deployment workflows for software projects\nStrong understanding of software security, and an ability to continually increase the security of our platform\nExperience in working in Agile teams and iterating to build sustainable and iterative solutions.\nIf you participate in any open source projects please send us links.\nExperience with containerization would be a plus, specifically Docker and Kubernetes</p>\n<p>WHO YOU ARE:\nYou are self directed and passionate driving solutions\nYou are a relentless problem solver\nYou are eager to learn and adapt quickly to change\nYou're an engaged team member with the ability to grow, mentor and challenge your peers to do their best work every day.\nYou're known for crossing the boundaries of your function to meet company goals.\nYou care about the people you work with but challenge them directly when necessary.\nYou are comfortable delivering feedback and coaching up, down and to the side.\nYou are customer (including internal customers) focused.</p>\n",
        "how_to_apply": "<p><a href=\"https://nav.bamboohr.com/jobs/view.php?id=176&amp;source=aWQ9MTU%3D\">https://nav.bamboohr.com/jobs/view.php?id=176&amp;source=aWQ9MTU%3D</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTJaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ea21c6cf91bccac0cbd2aa427cb64f6a70c47d92/Nav%20Logo%20-%20Blue.png"
    },
    {
        "id": "0a8dd9c0-6b66-44be-99b0-cca5c3556ca7",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0a8dd9c0-6b66-44be-99b0-cca5c3556ca7",
        "created_at": "Sat Feb 13 00:58:53 UTC 2021",
        "company": "University of California Berkeley",
        "company_url": "https://www.berkeley.edu",
        "location": "Berkeley, CA, USA",
        "title": "Director of The Bancroft Library and Associate University Librarian for Special Collections - Library",
        "description": "<p>Director of The Bancroft Library and Associate University Librarian for Special Collections - Library</p>\n<p>Director of The Bancroft Library and Associate University Librarian for Special Collections\nThe University Library, University of California, Berkeley</p>\n<p>Hiring range: Associate University Librarian\nSalary Range: Salary commensurate with experience and qualifications\nPercentage Time: 75 - 100% appointment, depending on Faculty status and Teaching preferences.</p>\n<p>The University of California, Berkeley invites both nominations and applications for the position of Director of The Bancroft Library and Associate University Librarian (AUL) for Special Collections. Bancroft's world-renowned special collections are among the largest and most actively used in the nation, providing a tremendous opportunity for the right visionary leader. The Director and AUL will assume a newly reimagined role, which unites the direction of a major research and collecting institution with strategic, innovative, and collaborative leadership for all special collections and archives within the University Library.</p>\n<p>The University Library at Berkeley comprises 24 general and subject libraries, with shared service units that support business functions, such as finance and development, and content functions, such as digitization and communications. Within the organization, The Bancroft Library is the principal special collections library, with other significant collections of rare and archival materials held in the Anthropology, Bioscience, East Asian, Environmental Design, and Music libraries. The Director and AUL will bring experience and energy to both the direct leadership and management of The Bancroft Library and the strategic and coordinated development and management of the Library's special collections, in collaboration with the AUL for Scholarly Resources and the Director of the East Asian Library. The Director and AUL will join the Library's executive leadership team, working in close partnership with the leaders of other Library units, and report to the University Librarian.</p>\n<p>BERKELEY'S SPECIAL COLLECTIONS</p>\n<p>The Bancroft Library welcomes patrons from Berkeley and beyond, serving as one of the most heavily used academic rare book and special collections libraries in the country. Bancroft staff annually teach sessions for about 3,000 students, support about 5,000 patrons in its reading rooms, and serve millions of visitors online. Founded in 1905, Bancroft's core holdings include the Bancroft Collection of Western North America, Mexico, and Central America, the Rare Books Collection, the History of Science and Technology Program, and the University Archives. Over the past 50 years, Bancroft's academic research groups, including the Mark Twain Papers &amp; Project, the Oral History Center, and the Center for the Tebtunis Papyri, have earned the Library additional international acclaim.</p>\n<p>The Bancroft Library continues to vigorously build its physical collections, spending about $1.5 million annually on new acquisitions and receiving gifts-in-kind of comparable value. The Library stewards nearly 400 million physical items (volumes, archival manuscripts and pictorial items, maps, microforms, etc.) and a growing collection of digital materials. In addition to its stewardship of analog holdings, the Library is building a robust program for securing and processing born-digital archives. With about 60 career staff/library professionals and many student employees, Bancroft supports world-class research both directly in its own units, and through engagement and collaboration with scholars at Berkeley and across the globe.</p>\n<p>The University Library includes other libraries with significant special collections, including the Anthropology Library, the Bioscience, Natural Resources &amp; Public Health Library, the C. V. Starr East Asian Library, the Environmental Design Library, and the Jean Gray Hargrove Music Library. The Music Library, for example, contains one of the most extensive U.S. collections of dramatic music, along with many other treasures. The East Asian Library holds over 100,000 rare items, including over 2,700 Chinese rubbings of reliefs and engravings, and the Fonoroff Collection for Chinese Film Studies, with over 70,000 periodicals, posters, photographs, and ephemera documenting the development of the film and entertainment industry of greater China. The special collections holdings of these libraries are diverse and unique, adding to the rich collections available to Berkeley faculty and students for research, teaching, and learning.</p>\n<p>Over the past 25 years, the University Library has digitized significant portions of its special collections, building one of the largest digital special collections in the University of California system.</p>\n<p>LEADERSHIP</p>\n<p>The University Library is looking for a leader with proven experience, bold ideas, and the confidence and political acumen to execute them. With crucial responsibility for fundraising and for interacting with scholars at Berkeley and internationally, this leader should be skillful at engaging in passionate content discourse with researchers, and preferably bring experience in one of Bancroft's major collecting areas. With both University Library-wide responsibilities and leadership of one constituent library, the Director and AUL will be an integral member of a tightly integrated, collaborative team that collectively supports the University Library's strategic vision (see: ucberk.li/our-plan). The Director and AUL should be able to foster a culture of innovation, engagement, and collaboration, and promote continuous professional growth and learning at all staff levels.</p>\n<p>The five AULs, the Director of the East Asian Library, the Director of Communications, and the Executive Director of Development report to the University Librarian; collectively these nine professionals constitute the Library Cabinet. This team works closely to set strategic directions and policies for the entire Library. They collaborate in an intensely matrix-organized institution, providing each other with partnership and support services. The special collections outside of Bancroft, for example, will benefit from coherent, coordinated practices in collection development, provenance, metadata creation, and ethical access led by this Director and AUL. Similarly, among other examples, Bancroft benefits from the fundraising research, cultivation, and stewardship services provided by the Library's development office.</p>\n<p>Director of The Bancroft Library</p>\n<p>This position's primary responsibility is to serve as the Director of The Bancroft Library. Bancroft's leadership team includes the Director; a Deputy Director, who leads the curatorial staff and oversees public access services and operations; and an Assistant Director, who leads the technical services operation. The Director of The Bancroft Library also leads the directors of the three academic research groups and is the principal Bancroft liaison to the Berkeley faculty. Bancroft's leadership team, together with other senior members of the Bancroft staff and in collaboration with other University Library leaders, has primary responsibility for collection development, research and academic engagement, technical services, public access services, and outreach and fundraising. The Director leads fundraising for Bancroft in collaboration with the University Librarian and the Executive Director of Development. The Director engages actively with scholars and members of the international antiquarian book and manuscript trade, as well as the wider scholarly community. The Director has overall responsibility for all Bancroft activity, while other members of Bancroft's leadership team oversee much of the day-to-day operations.</p>\n<p>The Director is responsible for leading Bancroft consistent with the Library's core principles and values. For example, the Director should promote a user-centered approach to the acquisition, processing, and accessibility of special collections in analog and digital formats. The Director will advance diversity, equity, inclusion, and belonging — both within The Bancroft Library and, through its user services, beyond.</p>\n<p>The Director is responsible for managing The Bancroft Library's annual budget of about $8 million (including substantial gift, endowment, and grant funds), as well as facilities and personnel. As do the directors of all constituent libraries that compose the University Library, the Director of The Bancroft Library collaborates closely with the leaders who have Library-wide responsibilities for communications, digital services, facilities, finance, fundraising, human resources, information technology, legal affairs, and security. The Director also collaborates with the leaders of special collections at the other University of California campuses, and is an active participant in the national community of leaders of the most prominent academic special collections libraries.</p>\n<p>Associate University Librarian for Special Collections</p>\n<p>The AUL for Special Collections is a new role, designed to provide overall leadership for the rare and archival materials we consider special collections at the University Library. This AUL will work with the leaders of other units holding special collections to provide coordinated, forward-looking strategies and practices for the development, management, and use of Berkeley's extraordinary collections. Together they will innovate and implement process efficiencies, reducing duplication and increasing consistency to improve the resource-finding and use experiences of scholars. During an era of limited budget growth, despite significant fundraising success, close collaboration and mutual support across the University Library have enabled the organization to continuously improve services for scholars.</p>\n<p>Selected strategic highlights</p>\n<p>Enhanced access to and use of the University Library's special collections is a top strategic priority. Bancroft and the other University Library special collections have been leaders in enhancing access to archival treasures in the age of digitized and networked information. Continuing digitization of its enormous special collections is a primary focus of the University Library's Digital Lifecycle Program, which currently adds about 1.5 million newly digitized files to its online collections annually. An important and exciting priority for this position is to work closely with the AUL for Digital Initiatives and Information Technology to scale up this program, including developing and adopting expanded selection, curation, and processing workflows, as well as exploring new methods and tools for increasing the computational usability of digitized collections in research and teaching.</p>\n<p>As with many cultural heritage and information resource organizations in higher education, Bancroft and other University Library special collections are simultaneously blessed by growing demand for existing and new services, and challenged by declining public investment in their operations. Fortunately, Bancroft is supported with the advice and philanthropy of the external nonprofit Friends of The Bancroft Library, a California nonprofit public benefit corporation, as well as strong philanthropic support from many loyal donors. The University Library has recently invested in expanding its fundraising team, with notable success, and the groundwork has been laid for even more growth in the coming years. It is crucial that the Director and AUL have a demonstrated talent or potential for fundraising and supporting initiatives through grants.</p>\n<p>Nature of appointment</p>\n<p>This is an academic leadership position. Qualified candidates may simultaneously hold a faculty position at the University of California, Berkeley. External candidates who wish a joint faculty appointment will need to seek such a position with a relevant department. The University Library will facilitate consideration, but is not the appointing unit and cannot guarantee such a position will be made available. The position will be for 75 percent or 100 percent effort, to be agreed upon with the preferred candidate, depending on faculty status and preference for teaching duties (through an academic department).</p>\n<p>THE ENVIRONMENT\nThe University of California, Berkeley, is one of the world's most iconic teaching and research institutions. Since 1868, Berkeley has fueled a perpetual renaissance, generating unparalleled intellectual, economic, and social value in California, the United States, and the world. Berkeley's culture of openness, freedom, and acceptance — academic and artistic, political and cultural — make it a very special place for students, faculty, and staff. Berkeley is committed to hiring and developing staff who want to work in a high-performing culture that supports the outstanding work of our faculty and students. Candidates are encouraged to read more about the UC Berkeley culture at <a href=\"http://jobs.berkeley.edu/why-berkeley.html\">http://jobs.berkeley.edu/why-berkeley.html</a>.\nIn a highly-diverse and intellectually-rich environment, Berkeley serves a campus community of over 30,000 undergraduate students, 11,000 graduate students, and 1,500 faculty. The University Library also serves the people of California and the world through lending to over 35 countries a year, and making available a rapidly-growing archive of digitized special collections materials.</p>\n<p>The University Library comprises 24 campus libraries, with a collection of over 13 million circulating volumes, including almost 1.5 million e-books, and subscriptions to over 130,000 journals and periodicals. We manage close to 10 million files (200 TB) in our digital holdings of special collections materials, and have contributed over 3 million digitized books from our circulating collections to HathiTrust. The University Library actively partners with the other nine UC campuses and the systemwide California Digital Library. The Library has a current operating budget of about $62 million with approximately 325 full-time employees and over 600 student employees each year.</p>\n<p>Minimum basic qualification at time of application:</p>\n<p>Advanced degree (For example, PhD or Masters or equivalent international degree)</p>\n<p>Preferred qualifications: Must be met by start date on the job</p>\n<p>The Director of The Bancroft Library and AUL for Special Collections should be a scholar who has substantial experience engaging in research using special collections materials, particularly in an area or areas of special strength for Bancroft. The successful candidate might have a background as a faculty member or professional librarian or archivist. Preferred candidates will have experience leading an academic unit (e.g., as academic department chair, dean, academic library, or archives director or associate director), including supervising and/or directing academic and professional staff. The Library at the University of California, Berkeley is committed to the support and encouragement of a multicultural environment and seeks candidates who can make positive and imaginative contributions in a context of ethnic and cultural diversity. Also preferred is experience and proven success with fundraising and grant writing.</p>\n<p>Recruitment information:</p>\n<p>This recruitment will remain open until filled. The identity of finalists will be public, and each will be expected to make a presentation in a public setting.</p>\n<p>Submit applications online at: <a href=\"https://apptrkr.com/2151594\">https://apptrkr.com/2151594</a>\nBerkeley has retained Isaacson, Miller, a higher education executive search firm, to assist in this search.</p>\n<p>Inquiries, nominations, and other application documents should be sent via the Isaacson, Miller website for the search: <a href=\"http://www.imsearch.com/7791\">http://www.imsearch.com/7791</a>.\nElectronic submission of materials is required.</p>\n<p>The university has an excellent retirement system and sponsors a variety of group health, dental, vision, and life insurance plans in addition to other benefits.</p>\n<p>The University of California is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or protected veteran status. For the complete University of California nondiscrimination and affirmative action policy see:\n<a href=\"http://policy.ucop.edu/doc/4000376/NondiscrimAffirmAct\">http://policy.ucop.edu/doc/4000376/NondiscrimAffirmAct</a></p>\n<p>This is a designated position requiring fingerprinting and a background check due to the nature of the job responsibilities. Berkeley does hire people with conviction histories and reviews information received in the context of the job responsibilities. The university reserves the right to make employment contingent upon successful completion of the background check.</p>\n<p>University Library contact:</p>\n<p>Susan Swarts, Associate University Librarian for Administration and Organizational Effectiveness, <a href=\"mailto:sswarts@berkeley.edu\">sswarts@berkeley.edu</a>.</p>\n<p>Immaculate Adesida, HR Generalist - <a href=\"mailto:immaculate@berkeley.edu\">immaculate@berkeley.edu</a></p>\n<p>Copyright ©2017 Jobelephant.com Inc. All rights reserved.</p>\n<p><a href=\"https://www.jobelephant.com/\">https://www.jobelephant.com/</a>\njeid-70a0f81e8ebba246bd2f8773815bbebf</p>\n",
        "how_to_apply": "<p>Submit applications online at: <a href=\"https://apptrkr.com/2151594\">https://apptrkr.com/2151594</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaXVaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--72cf6dbc9b7073b68cb08fc33d520e4138563263/University%20of%20California%20Berkeley.png"
    },
    {
        "id": "a7d8848e-0236-43e6-915e-c25915b2d38e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/a7d8848e-0236-43e6-915e-c25915b2d38e",
        "created_at": "Sat Feb 13 00:27:48 UTC 2021",
        "company": "Mercury Intermedia",
        "company_url": "http://www.mercury.io",
        "location": "Brentwood, TN",
        "title": "Android Engineer",
        "description": "<p><strong>Overview</strong></p>\n<p>The Android Engineer will develop and maintain mobile applications targeted at multiple Android versions and devices while employing best practices for creating beautiful and performant apps. In addition, code should follow best practices for programming in a team environment with an emphasis on code clarity and maintainability. The engineer will interact with various product owners including internal departments and directly with external clients. The engineer may be asked to lead technical development on some projects, and follow technical lead on others. Remote work acceptable for US-based engineers.</p>\n<p><strong>This a permanent, full-time position. No corp to corp/C2C, recruiters, or agencies please.</strong></p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Build beautiful and performant Android apps</li>\n<li>Write clean, readable, and maintainable code</li>\n<li>Develop for a variety of Android devices from phones to TVs</li>\n<li>Create pixel-perfect renditions of design comps</li>\n<li>Work with legacy code as well as create greenfield code</li>\n<li>Work with various data sources and APIs</li>\n<li>Work on bug fixes, application performance and architectural tasks</li>\n<li>Evaluate and implement new libraries, patterns and technologies to solve challenging problems</li>\n<li>Peer review code for correctness, adherence to style norms, efficiency</li>\n<li>Interact directly with product stake holders and collaborate with cross-functional teams</li>\n</ul>\n<p><strong>Skills and Experience</strong></p>\n<ul>\n<li>5+ years shipping Android apps</li>\n<li>Proficient in Kotlin and Java</li>\n<li>Expert understanding of threading/concurrency</li>\n<li>Solid understanding of Dependency Injection, with experience using Dagger</li>\n<li>Solid understanding of Reactive Programming with experience with RxJava and/or Kotlin Flow</li>\n<li>Experienced in writing and maintaining Android apps with MVVM, MVP, MVI (pick 2)</li>\n<li>Strong in the art of Git Fu</li>\n<li>Experience working with small teams and interacting directly with stake holders</li>\n</ul>\n<p><strong>This Developer:</strong></p>\n<ul>\n<li>Keeps up with updates to the Android Framework</li>\n<li>Values code simplicity over \"cleverness\"</li>\n<li>Forms strong opinions on new libraries and programming paradigms before putting them in production code</li>\n<li>Knows when to solicit opinions before they code, and when to demonstrate the solution first</li>\n<li>Holds a strong opinion of their code, but will throw it away when a better solution is needed</li>\n<li>Knows that they don’t know everything</li>\n<li>Wants to teach as much as learn</li>\n<li>Is comfortable in Agile or traditional workflows</li>\n</ul>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:jobs@mercuryintermedia.com\">jobs@mercuryintermedia.com</a></p>\n",
        "company_logo": null
    },
    {
        "id": "8a9f0789-ce91-4ceb-9557-dec56750d37c",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/8a9f0789-ce91-4ceb-9557-dec56750d37c",
        "created_at": "Fri Feb 12 22:06:17 UTC 2021",
        "company": "GetThru",
        "company_url": "http://GetThru",
        "location": "Anywhere in the United States",
        "title": "Lead Engineer (Remote)",
        "description": "<p>GetThru is hiring a Lead Engineer to support 3-5 of our ~15 engineers. This is a “manager who codes” role: that is, it’s a management role foremost but does require active web application development skills for code review and pair programming.  There will also be opportunities to work directly on software development “off the critical path” as time allows.</p>\n<p>Our software is built using Elixir and the Phoenix web framework. This role is open both to experienced leaders who are new to Elixir development and to experienced Elixir developers who are new to management: either will receive appropriate training, mentorship, and support.  (Those who have experience in both are also welcome and encouraged to apply, of course.) The role will be a part of the Engineering team and report to the Vice President of Engineering.</p>\n<p><strong>About GetThru</strong></p>\n<p>GetThru’s mission is to empower organizations to connect authentically with their audiences at scale while building a sustainable company committed to progressive social change. Our tools have been used by more than 2,000 organizations to send over 1 billion text messages and make more than 500 million phone calls for voter contact, volunteer recruitment, fundraising, polling, and more. We are an all-remote company with 40+ full time staff spread across 14 states. Prior to the pandemic, we had a once-yearly all staff retreat, and held semi-annual in-person team meetings (e.g., sales, support, engineering). And while our roots are in progressive politics, we love partnering with organizations of all kinds that share our passion for creating a better world.</p>\n<p><strong>Who you are</strong></p>\n<ul>\n<li>A seasoned software engineer with web application development experience who can take primary responsibility for a complex software project while supporting less experienced engineers collaborating on that project.</li>\n<li>A disciplined and creative problem solver who can create your own direction in a low-structure environment, and execute on it.</li>\n<li>The person who steps in when something needs to get done -- even if it’s not glamorous or fun or explicitly your responsibility -- and makes sure it happens.\nSomeone who has or wants management experience.</li>\n<li>A collaborative and supportive teammate who believes that a team is greater than the sum of its parts.</li>\n</ul>\n<p><strong>What you'll do</strong></p>\n<ul>\n<li>Quickly come up to speed on the functionality of our two products and the technology underlying them.</li>\n<li>Support your team members and teammates in developing their technical and other professional skills through mentorship, coaching, pair programming, and code review.</li>\n<li>Set and enforce clear expectations for your team members; provide support and structure for success; promptly and empathetically address occasions when expectations are not being met.</li>\n<li>Actively seek opportunities for your team members to grow by taking on new challenges and responsibilities.</li>\n<li>Guide your team members and collaborate closely with Product, Design, Support, and other Engineering teammates to achieve successful project completion.</li>\n<li>Delegate responsibilities and outcomes -- with appropriate guidance given their skills and experience -- to your team members in ways that will support their growth and career goals.</li>\n<li>Work with your team members to define and advance professional development goals</li>\n<li>Collaborate with teammates to resolve service interruptions and high-impact defects; participate in on-call rotation.</li>\n<li>Develop software “off the critical path” for our products, internal tooling, or build pipelines; collaborate with teammates on their assigned projects.</li>\n<li>Collaborate to optimize, refine, and codify Engineering processes and processes for collaborating with other departments.</li>\n<li>Lead hiring processes to fill any openings on your team.</li>\n<li>Ensure your team members’ focus remains aligned with department and company-level goals.</li>\n<li>Actively support the development of a trusting and collaborative team culture.</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<p>At least one of:</p>\n<ul>\n<li>Prior professional experience developing software using Elixir</li>\n<li>Prior experience as an engineering lead or manager</li>\n<li>A commitment to empathetic leadership</li>\n<li>Excellent written and verbal communication skills</li>\n<li>A commitment to / interest in progressive causes</li>\n<li>Authorized to work in the U.S. or Canada</li>\n</ul>\n<p>Our stack includes (prior experience in all of these is not necessary)</p>\n<ul>\n<li>Elixir</li>\n<li>Javascript (including Typescript and ES6)</li>\n<li>Phoenix</li>\n<li>Liveview</li>\n<li>ReactJS</li>\n<li>PostgreSQL</li>\n<li>Redis</li>\n<li>Docker</li>\n<li>Kubernetes</li>\n<li>AWS</li>\n</ul>\n<p><strong>Location</strong></p>\n<p>GetThru is an all-remote company with employees spread out across the country. Work from anywhere in the U.S. as long as there is good internet.</p>\n<p><strong>Compensation</strong></p>\n<ul>\n<li>$140,000-180,000 base salary, depending on experience</li>\n<li>Compensation for participation in on-call rotation</li>\n<li>Additional compensation via bonuses and participation in profit-sharing pool</li>\n<li>Participation in employee stock option pool</li>\n<li>401K + employer match that begins on or after 3 months of employment</li>\n<li>100% Health / dental / vision benefits for employees, 75% for dependents</li>\n<li>3 weeks of vacation time in year 1 and 2, with increases thereafter</li>\n<li>Additional benefits: ergonomic stipend, monthly wellness stipend, parental leave, charitable giving match</li>\n</ul>\n<p><strong>Equal Opportunity</strong></p>\n<p>GetThru provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, national origin, age, disability, or genetics. As our company grows, we strive to make space for all kinds of people to do amazing work with us. We especially encourage applications from women, people of color, LGBTQ+ people, people with disabilities, immigrants, and other communities underrepresented in technology startups. We believe that a team with a wide range of backgrounds and experiences will be more creative, more adaptable, and more effective. And we strive to build a team that reflects the communities we are working to support.</p>\n",
        "how_to_apply": "<p>Please apply by going to:\n<a href=\"https://getthru.freshteam.com/jobs/AFGfdNioz1rv/lead-engineer-remote\">GetThru - Lead Engineer</a></p>\n<p>Please submit a resume and in your cover note, please explain why you want to work for GetThru in this role. Tell us what experiences make you a good fit, what causes you are connected to, and why you are excited about this job. This position is open until filled.</p>\n",
        "company_logo": null
    },
    {
        "id": "9520f18c-dd70-4acd-a35e-dab400c1e491",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/9520f18c-dd70-4acd-a35e-dab400c1e491",
        "created_at": "Fri Feb 12 21:58:36 UTC 2021",
        "company": "Agiloft Inc",
        "company_url": null,
        "location": "Kyiv, Ukraine, Hungary, Russia, India,Czech Republic",
        "title": "Dev Ops Engineer (Remote)",
        "description": "<p><strong>THRIVE WITH AGILOFT</strong></p>\n<p>Are you an experienced DevOps Engineer who is successful, motivated, smart, energetic, and looking for a rewarding position in a growing, profitable, and dynamic company?</p>\n<p>Agiloft is expanding our developer team, looking for DevOps engineers that thrive working with enterprises in multiple industries, with unique business challenges requiring sophisticated solution design.</p>\n<p><strong>WHY JOIN AGILOFT?</strong></p>\n<ul>\n<li>\n<p>Agiloft was named the market leader in every category in the Gartner Critical Capabilities for CLM report, and a market leader in the Gartner Magic Quadrant.</p>\n</li>\n<li>\n<p>Contract Lifecycle Management (CLM) is one of the fastest-growing areas of enterprise sales, with a TAM projected to climb from $2B to $7B in the next 5 years.</p>\n</li>\n<li>\n<p>The Agiloft Contract and Commerce Lifecycle Platform has won over a dozen awards, including the Editor's Choice award from PC Mag, for the past five years in a row.</p>\n</li>\n<li>\n<p>Agiloft has a highly differentiated value proposition which is uniquely appealing to enterprises: pre-built applications with a deeply configurable, no-code platform for integrated Business Process Management throughout an organization.</p>\n</li>\n<li>\n<p>Agiloft is pioneering the applied use of Artificial Intelligence to enable next-generation business commerce at organizations ranging from small enterprises to U.S. government agencies and Fortune 100 companies.</p>\n</li>\n<li>\n<p>Agiloft is the only company in the industry with the confidence to provide an unconditional satisfaction guarantee, and you too will be successful with Agiloft.</p>\n</li>\n</ul>\n<p>As the leader in the CCLM market, Agiloft is winning many Enterprise deals and looking to hire the best talent to meet this demand with a competitive compensation plan that rewards overachievement.</p>\n<p><strong>POSITION OVERVIEW</strong></p>\n<p>This is a remote-only position. You must be comfortable with setting your own schedule and proactively collaborating in a globally dispersed team using a variety of communication channels.</p>\n<p>We are seeking a DevOps Engineer to join our engineering team. The ideal candidate is someone who has a solid background in software development infrastructure architecture, automation, configuration management, monitoring, and tools development for enterprise software and systems. The candidate must have a passion for automating everything, and a sense of ownership.</p>\n<p><strong>JOB RESPONSIBILITIES</strong></p>\n<ul>\n<li>\n<p>Develop new automation systems and improve existing ones that enable fast delivery and replace manual operating procedures wherever they exist</p>\n</li>\n<li>\n<p>Drive analysis, design, and development of automation tools for deployment, development, and operational tasks</p>\n</li>\n<li>\n<p>Lead architectural improvements in our software development- and delivery infrastructure and evaluate new technologies</p>\n</li>\n<li>\n<p>Assume ownership of Agiloft’s installer</p>\n</li>\n</ul>\n<p><strong>REQUIRED QUALIFICATIONS</strong></p>\n<ul>\n<li>At least two years of hands-on experience as a DevOps engineer</li>\n<li>Experience with configuration management systems</li>\n<li>Experience with the configuration of Linux and Windows operating systems</li>\n<li>Deep knowledge of Python- or Perl scripting languages</li>\n<li>Experienced with Java</li>\n<li>Good knowledge of Install4J</li>\n</ul>\n<p><strong>PREFERRED QUALIFICATIONS</strong></p>\n<ul>\n<li>Computer Science degree or equivalent</li>\n<li>Experience with continuous integration / either continuous delivery tools</li>\n<li>Deep knowledge of Unix bash or Windows PowerShell</li>\n<li>Experience using containers</li>\n<li>Experience supporting MySQL/MSSQL databases</li>\n<li>Experience with public cloud platforms</li>\n<li>Experience working in distributed teams\n*Fluent in the English language</li>\n</ul>\n<p><strong>BENEFITS AND PERKS</strong></p>\n<ul>\n<li>Competitive salary</li>\n<li>Referral bonuses</li>\n<li>Flexible work schedules</li>\n<li>Professional development and career growth opportunities</li>\n<li>Awesome team members</li>\n</ul>\n<p><strong>To Apply</strong></p>\n<p>For immediate consideration, visit <a href=\"https://tinyurl.com/1swelma6\">https://www.agiloft.com/DevOps</a> to apply.</p>\n",
        "how_to_apply": "<p>For immediate consideration, visit <a href=\"https://tinyurl.com/1swelma6\">https://www.agiloft.com/DevOps</a> to apply.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVNaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--aa453fa03692a4658a63b99b831103dfcee9a1de/Agiloft%20Logo%20plain%20(Indeed).png"
    },
    {
        "id": "74d9b458-d9be-4c6a-a36c-201d930c246c",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/74d9b458-d9be-4c6a-a36c-201d930c246c",
        "created_at": "Fri Feb 12 21:24:06 UTC 2021",
        "company": "netamorphosis",
        "company_url": "https://netamorphosis.com/",
        "location": "Remote",
        "title": "Technical Manager",
        "description": "<p>Job Title: Technical Manager</p>\n<p>Location: Remote</p>\n<p>Type: Full Time</p>\n<p>Min. Experience: 5+ Years</p>\n<p>Reports to: Sr. Operations Project Manager</p>\n<p>About Us:</p>\n<p>At netamorphosis, we get excited by new technology, innovative communication styles and finding new ways to captivate ever-evolving audiences. We believe in the power of the group. An empowered, trusted, open team format works better than a siloed hierarchal organization.  In true start-up fashion, we work hard, strive for balance and prioritize healthy living all while hustling to deliver cutting edge digital technology to emerging brands.</p>\n<p>Job Summary:</p>\n<p>Our Technical Manager will guide all phases of the system development and implementation process including: developer management, testing and ongoing support of our client digital platforms. You will oversee overarching development product roadmaps across multiple brands and sites, work closely with our project managers to make updates and additions to our client products to drive their overall business performance. You will be the liaison between our external development teams, internal design and product teams and our clients, so you have the technical expertise to architect solutions in addition to the communication skills to explain them and your process to a non-technical audience. You should not be afraid to get your hands dirty when needed, so familiarity with web infrastructure and development are a plus. You lead by example and can show how it’s done, setting and evolving development policies and standards as technology evolves. You are a strategic product owner, a team player and a skilled client partner all rolled into one. You’ll be a proactive thinker, collaborative problem solver, as well as, an engaging client and team builder.</p>\n<p>Responsibilities:</p>\n<ul>\n<li>Ownership of our development product roadmaps and release schedule of all data and development initiatives</li>\n<li>Manage multiple development projects simultaneously including timeline, project scope and resource management</li>\n<li>Client management, communication around technical system decisions with both technical and non-technical audiences</li>\n<li>Coordination between project manager, clients and developers on how technical decisions impact project management timelines and business goals</li>\n<li>Build and manage platform and development requirements documentation for each project</li>\n<li>Work closely with developers to understand and overcome technical challenges for platform features/enhancements</li>\n<li>Work with multiple platform development teams both locally and internationally, ensuring they architect solutions for scale, complexity, security and fault tolerance</li>\n<li>Help develop a development partner model that includes vendor selection, vendor management and continually growing our developer and technical partner network</li>\n<li>Complete management of the UAT process, including test plan creation, testing and verification</li>\n<li>Collaborate with our internal design team to understand current platform functionality and provide best practice guidance for development updates</li>\n<li>Advise tech stack exploration and consulting for both internal and client platforms development, keeping in-stride with industry developments that will inform the platform choices, development methods, tech architecture, etc.</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>At least 4-5+ years experience in development platform management</li>\n<li>An eager communicator with a sense of humor, comfortable with client work</li>\n<li>Bachelor’s degree with a major in computer science, engineering or business management</li>\n<li>Highly organized with the ability to prioritize/multi-task – demonstrated capabilities regarding written communications, calendar and spreadsheet creation/management</li>\n<li>Technical competence to perform data analytics and have utilized web analytics for marketing budget optimizations</li>\n<li>Experience with planning, building and executing UAT</li>\n<li>Experience with developer management, development cycle and industry standard launch protocol</li>\n<li>Strong experience with software design patterns and system architecture strategies</li>\n<li>Excellent communication skills, internally and externally. Know how to be the communication bridge between client services and technology teams, with ability to communicate technical decision points with non-technical audiences</li>\n<li>Coding skills or understanding coding a plus for development leadership</li>\n<li>Experience managing &amp;/or mentoring web development professionals (informally or formally) a plus</li>\n<li>Ability and preferably a general affinity for learning new technologies</li>\n</ul>\n<p>Technical Requirements:</p>\n<ul>\n<li>Exposure and experience with more than one of the following tools and channels to paid digital advertising platforms including: Google (Ad Words), YouTube, Facebook, native GDN, other 3rd Party platforms, SEO, Email Marketing Software, WordPress, Moz, SEMRush, Google Search Console, GT Matrix</li>\n<li>Must have experience/familiarity with CMS management, especially Wordpress, Shopify, etc.; experience building projects with a CMS from scratch a plus</li>\n<li>Experience with AWS and other hosting platform(s) best practice and knowledge of overarching database management strategies</li>\n<li>Solid experience in all Microsoft Office programs, as well as Keynote and Dropbox or similar file management systems</li>\n<li>Experience with Salesforce, Zendesk, or other 3rd Party CRM’s vital from an end-to-end customer value perspective</li>\n<li>Familiarity with Git versioning best practices a plus for developer coordination</li>\n</ul>\n<p>Skillset Snapshot:\nAdaptability, Development, Coding, Project Management, Product Management, Platform Management, Budget &amp; Resource Management, Product Roadmaps, Developer Management, System Development, UAT, Requirements Building, C-Suite client communication, Presentation Skills, Salesforce, Dropbox.</p>\n<p>When Applying:\nInclude a PDF of your Resume and Cover Letter.\nInterviews will be conducted by PHONE and ZOOM.</p>\n<p>Benefits:</p>\n<ul>\n<li>Paid earned vacation in year 1</li>\n<li>Medical, dental + vision plans</li>\n<li>401K employee match</li>\n<li>Short-term disability</li>\n<li>Company-wide bonding virtual events</li>\n</ul>\n",
        "how_to_apply": "<p>Apply for this position on our website here <a href=\"https://netamorphosis.com/join-us/technical-manager/\">https://netamorphosis.com/join-us/technical-manager/</a></p>\n<p>Reference GitHub in the \"How did you hear about netamorphosis?\" question.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUdaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bba5ad70630f1f5523017827567d4225c86b6bf4/Square_neta_logo.jpg"
    },
    {
        "id": "3f3ef4e5-9256-43bf-b393-972fb4a0a502",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/3f3ef4e5-9256-43bf-b393-972fb4a0a502",
        "created_at": "Fri Feb 12 20:35:39 UTC 2021",
        "company": "IQ PARTNERS INC.",
        "company_url": "http://www.iqpartners.com",
        "location": "Canada (remote)",
        "title": "PRINCIPAL ENGINEER",
        "description": "<p>Principal Engineer (full time)</p>\n<p>Our client is an advanced cloud-based ecosystem designed to replace the clunky legacy systems previously used by brokerages across North America. They are on a mission to consolidate, automate, and revolutionize the way brokerages do business from start to finish with:</p>\n<ul>\n<li>advanced front desk and appointment management</li>\n<li>customized offer strategy and feedback collection</li>\n<li>modern inter-office messaging</li>\n<li>actionable analytics</li>\n<li>North America’s largest exclusive listing network</li>\n</ul>\n<p>The result? A smooth, hassle-free experience for admins, agents, and their clients.</p>\n<p>A fast growing startup specializing in real estate technology with 500% YoY revenue growth. There’s no better place to be if you’re looking for a dynamic work environment with plenty of room to flex your professional muscles.</p>\n<p>Our team is tight-knit, whip-smart, and loves a good joke. Before the pandemic hit, you could find us innovating (or playing ping pong) at our shiny downtown Toronto office—these days, we’re transforming the real estate landscape one feature at a time from home.</p>\n<p>We’re ambitious, goal-driven, and take on big challenges together. 2020 has proven to be our busiest year yet and we’ve got our sights set high for the future\nMain Responsibilities</p>\n<ul>\n<li>Lead by example - a hands on role</li>\n<li>Design and implement core features and modules</li>\n<li>Conduct code reviews and architecture reviews</li>\n<li>Setup and enforce best practices</li>\n<li>Establish enhanced production monitoring processes\nMandatory Experience</li>\n<li>At least 4 years of building and scaling back-end systems in Node</li>\n<li>Scaling applications following increases in features, users and team size</li>\n<li>Refactoring large codebases</li>\n<li>Implementing GraphQL / microservices architecture</li>\n<li>Optimizing MongoDB queries and models</li>\n<li>Working understanding of devops (GCP/Kubernetes preferably)</li>\n</ul>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:poirier@iqpartners.com\">poirier@iqpartners.com</a> along with the best time to reach you for a follow up call.</p>\n",
        "company_logo": null
    },
    {
        "id": "0e9ae5fa-5bbd-4395-aef7-a7a32e0abd01",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0e9ae5fa-5bbd-4395-aef7-a7a32e0abd01",
        "created_at": "Fri Feb 12 16:03:36 UTC 2021",
        "company": "Mas & Pas Limited",
        "company_url": "http://http",
        "location": "London ",
        "title": "Experienced Full Stack Web Developer - London-Based or Remote",
        "description": "<p>Full Stack Web Developer; Experienced Developer for Complex Web Platform - London-Based or Remote</p>\n<p>Seeking an experienced, self-motivated Front and Back End Web Developer to join a small London-based team. Remote working arrangements could be considered.</p>\n<p>The right candidate would be responsible for developing advanced features in the community chat groups of the platform.</p>\n<p>They would also be responsible for managing other aspects of the live site and ensuring that its smooth operation.</p>\n<p>Who are we:</p>\n<p>Mas &amp; Pas is a parenting network with community forums, a local events platform, and a large library of web content.</p>\n<p>Responsibilities include:</p>\n<p>●      Plan and architect the technology for a number of new features - including live chat, video sharing webinar hosting and online booking systems.\n●      Migrate the website's content from Wordpress onto a new framework with a custom CMS.\n●      Deliver projects to agreed deadlines, in good quality and after thorough testing.\n●      Problem-solve any issues with the site, including diagnosing and correcting any bugs.\n●      Maintain and improve the operations and speed of the website in its current form.\n●      Apply technical SEO best practices to improve site speed and performance.\n●      Able to work either alone or in a small team.\n●      Able to communicate effectively with the other team members, both developers and non-developers.</p>\n<p>Key Requirements:</p>\n<p>●      5 years+ experience in development, testing, and deployment of web applications.\n●      Comfortable with custom-coding new applications without reliance on plug-ins.\n●      Knowledge and experience of all stages of web development.\n●      Extensive development experience using PHP, HTML5, Javascript, Java.\n●      Optional experience in C, C++, Ruby, React, Python, and microservices.\n●      Enjoy problem-solving.\n●      Self-motivated and able to work on your own initiative.\n●     Fluent or native level of English language is necessary.\n●     Excellent communication skills, especially in understanding requirements and explaining technical or complex concepts.</p>\n<p>Sounds interesting? Click APPLY to send your CV including examples of your works for immediate consideration.</p>\n<p>Candidates with previous experience in and job titles including; PHP Developer, HTML5 Developer, Javascript Engineer, Java Developer, C++ Developer, Python Developer, Ruby Developer, C Developer, Full Stack Developer, Git, Web Developer, Full Stack Web Development, Laravel, CSS Developer, PHP Engineer, Web Developer Full Stack Web Development may be considered.</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:hello@masandpas.com\">hello@masandpas.com</a> together with links to 5 examples of your work.</p>\n",
        "company_logo": null
    },
    {
        "id": "f4b18395-b295-4812-be28-76d816de17f1",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/f4b18395-b295-4812-be28-76d816de17f1",
        "created_at": "Fri Feb 12 15:43:56 UTC 2021",
        "company": "Secureworks",
        "company_url": "https://secureworks.com/",
        "location": "Remote",
        "title": "Golang and Kubernetes Platform Engineering",
        "description": "<p><strong>Software Engineer - Platform Engineering</strong>\n<strong>Location: Remote</strong></p>\n<p>We are a fully remote software engineering team working on the company's next generation security platform. Our goal is to increase the security posture of all of our customers while building a collaborative and innovative engineering culture. We are a proud member of the Dell Technologies family and offer competitive benefit and compensation packages and reward and recognize our employees for exceptional results.</p>\n<p>The platform team focuses on backend service and tooling development for other teams and customers to use. We build performant GraphQL APIs using Golang and Kubernetes for  different features of our product, creating and reviewing designs for new projects, building robust software that other teams and customers can use, and collaborating with other internal and external engineering teams to solve problems, as well as building our internal authorization systems. If there is backend work we are involved in one way or another - and our goal as a team is to raise the bar of engineering practices across the larger organization.</p>\n<p>Our primary tech stack consists of Golang, Kubernetes, Postgres, and Elasticsearch, but we also use tools like ScyllaDB, Redis, Kafka, SQS, and various other AWS services as well.</p>\n<h1>Skills and Requirements</h1>\n<h2>We expect to see:</h2>\n<ul>\n<li>Solid programming skills in Golang with experience developing applications similar to our tech stack</li>\n<li>Strong understanding of database fundamentals</li>\n<li>Strong understanding of common attack vectors and defensive programming skills</li>\n<li>Excellent problem solving skills and an ability to work through problems and get stakeholders and team mates to align</li>\n<li>Excellent debugging skills with the ability to walk from UI down to backend services and tracking where problems are happening</li>\n<li>Self motivating and self directed, great at communicating complex ideas with remote teams</li>\n</ul>\n<h2>What we like to see (but not required):</h2>\n<ul>\n<li>Experience working with kubernetes and designing microservice applications</li>\n<li>Remote work experience with a geographically distributed team (currently we have teammates in  PST  to GMT time zones)</li>\n<li>Experience working with UI developers, product managers, and UX researchers</li>\n<li>Comfortable working knowledge of a cloud platform such as AWS, GCP, or similar</li>\n</ul>\n<h2>Work Environment</h2>\n<p>We are a remote first team and are geographically distributed across the US, Canada, and UK - we utilize tools like Mattermost, Google Meet, Zoom to facilitate communication and tools like Miro and Lucid Charts for diagramming and communicating ideas. We also believe in a strong work-life balance and providing support for team members to accomplish that. We are a family first company that values our team members and has benefits and a culture that will help them through important life events - such as taking care of family, parental leave, etc. We also value continuing education and skills development and have Tech Tuesdays where team members can present to the engineering organization, 3rd parties coming in and giving presentations, as well as training for services like AWS and Kubernetes.</p>\n<p><em>Secureworks (A Dell Technologies Company) is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Secureworks are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Secureworks will not tolerate discrimination or harassment based on any of these characteristics.  Learn more about Diversity and Inclusion at Secureworks here.</em></p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:platform-jobs@secureworks.com\">platform-jobs@secureworks.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFdaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2cefca02f2059546e6e746db79560990c02e0d29/Screen%20Shot%202021-02-12%20at%2010.40.07%20AM.png"
    },
    {
        "id": "4b46a3fb-6a7c-46bc-96a5-eb4e79a71513",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/4b46a3fb-6a7c-46bc-96a5-eb4e79a71513",
        "created_at": "Thu Feb 11 15:11:10 UTC 2021",
        "company": "Cyware",
        "company_url": "http://Cyware",
        "location": "Anywhere",
        "title": "Solutions Architect",
        "description": "<p><strong>Solutions Architect</strong></p>\n<p><strong>United States, Remote</strong></p>\n<p><strong>About Cyware</strong>\nCyware is a venture-backed organization, headquartered in New York City. The firm was founded by innovative practitioners to solve the massive-scale cybersecurity challenges they saw daily while working for leading global banks and technology organizations.</p>\n<p>Cyware is disrupting the cybersecurity operations market with innovation that gives the firm claim to being the far-and-away ONLY company capable of delivering technology to build cyber fusion centers for customers in large enterprises and the mid-market.</p>\n<p>Cyware is in hyper-growth mode. Your next opportunity starts here!!</p>\n<p><strong>More on Cyware</strong>: (<a href=\"http://www.cyware.com\">www.cyware.com</a>)\nBuilt on innovation designed by SecOps practitioners and cybersecurity leaders, Cyware offers multiple technologies within its next-generation platform, including advanced threat intelligence solutions (TIP) for large and small security teams, vendor-agnostic security automation (SOAR), and security case management. As a result, organizations are able to increase speed and accuracy while reducing costs and analyst burnout. Cyware's Virtual Cyber Fusion solutions make secure collaboration, information sharing, and enhanced threat visibility a reality for enterprises, sharing communities (ISAC/ISAO), MSSPs, and government agencies of all sizes and needs.</p>\n<p>*<em>About you</em>:</p>\n<ul>\n<li>You can lead on strategic and tactical initiatives</li>\n<li>You are hungry, inquisitive, proactive, energetic, and driven</li>\n<li>You have a growth mindset and are committed to delivering results</li>\n<li>You thrive in a fast-paced, collaborative environment</li>\n</ul>\n<p><strong>Why We Are Hiring</strong>:\nThe Cyware Solutions Architect is responsible for delivering the technical win and product fit at customer accounts. They build customer trust in Cyware solutions, which results in customer success in the post-sale. The Solution Architect leads the technical pre-sales relationship, proposes technical architectures, demonstrates the product, anticipates concerns, and offers creative solutions.</p>\n<p>The Solutions Architect role is both highly technical and a skilled relationship builder. They are comfortable showing an engaging communications experience to a CEO or sketching out a flow on a whiteboard with technical decision makers. Utilize their technology background to lead the consultative discovery of the client/prospect’s business goals, objectives, and challenges and to translate them into effective technology solutions.</p>\n<p>The Solution Architect plays a leadership role, by analyzing business processes and requirements, presenting related solutions, and driving the business case and financial justifications.</p>\n<p><em>Come join an exciting startup company in the cybersecurity space that just completed their $10 million dollar Series A funding!</em></p>\n<p><strong>What You Will Do</strong>:</p>\n<ul>\n<li>Serve as the security solution architect / engineer responsible for the planning and design of both on-prem and cloud-based infrastructure solutions and complex POCs simulating customer environments.</li>\n<li>Lead research, development, and adherence to application standards and patterns, application portfolio strategy for solutions, security tools integrations, and infrastructure.</li>\n<li>Serve as a Lead Security Architect on project teams (including users, developers), to plan, coordinate, analyze, design, review and implement Cyware’s Software.</li>\n<li>Participate in the design review process and support the overall Enterprise Architecture Management process.</li>\n<li>Support Sales Engineers with solution selling into prospect account base and lead planning, preparation, and execution on strategic deals.</li>\n<li>Lead the deployment of Cyware products in the customer’s environment</li>\n<li>Establish and maintain effective working relationships with clients;  Track industry developments and trends on products, services, relevant information about legacy, existing, and emerging technologies</li>\n<li>Understand customer pain points and requirements and propose appropriate solutions</li>\n<li>Work with QA and development teams to troubleshoot and resolve complex product issues</li>\n<li>Develop Solution Architecture Models and Documentation (key written project deliverable).</li>\n<li>Oversee and approve the creation of architecture documentation.</li>\n<li>Act as a communication channel between the market needs and the development teams for Cyware product enhancements and roadmap creation</li>\n<li>Lead and deliver impactful demos and presentations to clearly communicate the uniqueness of the value proposition</li>\n<li>Act as a technical account manager for existing customers</li>\n<li>Understand the customer use cases and map it to the Cyware products and deliver the end to end working solution to the customer.</li>\n<li>Work with the customer to understand the new requirements post implementation and provide appropriate solutions within the product or suggest new requirements of the product to the engineering team.</li>\n</ul>\n<p><strong>Who You Are</strong></p>\n<ul>\n<li>Bachelor’s Degree and 8+ years of progressive experience in a combination of development, design, infrastructure and/or related IT and Security disciplines.</li>\n<li>Must have at least 3 years of direct infrastructure, system, application and/or other security solution architecture experience.</li>\n<li>Possess an understanding of both the Incident Response Lifecycle and Threat Intelligence Lifecycle Process.</li>\n<li>Exposure to multiple, diverse security integrations and automation (SOAR), security tools (SIEM, EDR, UEBA, TIP, CMDB, NAC, etc.), and processing environments, including cloud and SaaS technologies.</li>\n<li>Experience with SIEM Vendors/Tooling such as: Splunk, QRadar, Arcsight, RSA, Exabeam.</li>\n<li>Experience with SOAR, IR Vendors/Tooling such as: Demisto, Phantom, Siemplify, IBM Resilient, Swimlane.</li>\n<li>Experience with Threat Intel Vendors/Tooling such as: MISP, Anomali Threatstream, ThreatConnect, Threat Quotient.</li>\n<li>Experience with TI Feeds, Enrichment Vendors/Tooling such as: VirusTotal, FireEye, Recorded Future, Hybrid Analysis.</li>\n<li>Experience with EDR, Other Vendors/Tooling such as: Tanium, CarbonBlack, Crowdstrike, Symantec, AlienVault.</li>\n<li>Familiarity in scripting and Object Oriented Programming with Python, other programming  languages, and REST APIs is required.</li>\n<li>Strong experience in security solution design principles and practices, system development methodologies, and software life cycles.</li>\n<li>Experience leading security teams is a plus, especially hands-on and able to coach teams on new technologies and practices.</li>\n<li>Understanding or contribution to any open source projects in the domains like SOC, Incident Response, Threat Intelligence, Threat Hunting, etc.</li>\n<li>Strong understanding of the enterprise network architecture, operating system concepts and IT Security.</li>\n</ul>\n<p><em>We're a lean team, so your impact will be felt immediately. If this all sounds like a good fit for you, why not join us?</em></p>\n<p><strong>You’ll love working at Cyware because</strong></p>\n<p><strong>We value balance.</strong> We are committed to providing an environment in which you can balance great work with a great life. You’ll have a generous PTO structure and holidays covered.</p>\n<p><strong>We’re not just employees.</strong> We’re people. We offer 401(k) match, insurance coverage (health, vision, and dental), and reimbursements for your home office.</p>\n<p><strong>We’ll invest in your career.</strong> Our company’s growing quickly, and we’ll give you the opportunity to do the same. You’ll have access to a number of professional development opportunities so that you can keep up with the company’s evolving needs.</p>\n<p><strong>We offer competitive compensation packages.</strong> We deeply value the talent our team brings to the table and believe that fair and equitable total compensation packages are part of our commitment to everyone who works here.</p>\n<p><strong>And so much more…</strong></p>\n<p><strong>How to Apply</strong>\n<em>Checkout our website</em>: <a href=\"https://boards.greenhouse.io/cyware/jobs/4175262003?gh_jid=4175262003\">https://boards.greenhouse.io/cyware/jobs/4175262003?gh_jid=4175262003</a></p>\n",
        "how_to_apply": "<p>Check out our website to apply for this rolehttps://boards.greenhouse.io/cyware/jobs/4175262003?gh_jid=4175262003</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXlZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0d0a67cb8c233284f5eae90952a5fbe25ba26ab4/Cyware+Logo+CH.png"
    },
    {
        "id": "2b9d4a83-aa51-482a-b2db-7b0a0b5a6545",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/2b9d4a83-aa51-482a-b2db-7b0a0b5a6545",
        "created_at": "Fri Feb 12 13:56:41 UTC 2021",
        "company": "xential",
        "company_url": "https://www.xential.com/vacatures",
        "location": "Drachten, Netherlands",
        "title": "Back-end developer",
        "description": "<p>Als wij iets doen, doen we het goed! Dat moet ook wel, want zo’n 80.000 gebruikers in Nederland en Duitsland werken dagelijks met onze software. Op dit moment zijn we bezig met een mooie nieuwe ontwikkeling: het bouwen van een cloud native applicatie. Om daar maximaal op te kunnen focussen, zoeken we een team van top-IT’ers in Noord-Nederland (omgeving Drachten).</p>\n<p>Nieuwsgierig geworden? Kom je uit het noorden van Nederland? Wil je voor een groot aantal gebruikers mooie producten maken? Ben jij een topper op het gebied van het ontwikkelen van een cloud native applicatie, automatische integratie, deployment of ontwerp? Wij komen graag met je in contact!</p>\n<p>Kijk voor meer info op <a href=\"http://www.xential.com/vacatures\">http://www.xential.com/vacatures</a></p>\n<p>Als onze Backend software developer vernieuw je onze huidige architectuur. Je bouwt aan onze highavailable cloud native server backend. We ontwikkelen APIs (OAS, Rest, SOAP) , microservices, data stores, message brokers en worstelen met concurrency, encryptie en privacy design principles. We abstraheren complexe processen in praktische functies voor de JavaScript devs. Kortom: samen net ons bouw je aan een gave, modulaire en vooral futureproof business-logic cloud engine.</p>\n<p>Wat vragen wij van jou?</p>\n<p>Het kan niet anders of je kent JAVA als je broekzak. Daarnaast is het mooi meegenomen als je iets weet van MariaDB en Docker.</p>\n<p>Wat we ook heel belangrijk vinden is dat je enthousiasme meebrengt en het vermogen hebt hoofdzaken van bijzaken te onderscheiden. Natuurlijk ben je leergierig en blijf je graag op de hoogte van de laatste ontwikkelingen op je vakgebied. Daarbij heb je minimaal drie jaar werk ervaring en werk en denk je op hbo-niveau.</p>\n<p>Je gaat werken in een team met veel kennis en passie voor development. Steeds proberen we bij elkaar het beste naar boven te halen. Een team dat groot genoeg is om professioneel te zijn en klein genoeg voor de menselijke maat. We zoeken iemand die eraan bijdraagt om samen naar een nog hoger niveau te komen en tegelijkertijd zélf ook graag nieuwe dingen leert!</p>\n<p>Werkwijze en tools</p>\n<p>We werken Agile. We dwingen onszelf klein te beginnen en het steeds uit te laten groeien tot iets moois. Intussen hebben we een werkende basis en breiden dit uit met heldere planning. We houden elkaar daarin scherp.</p>\n<p>De tooling die we gebruiken zegt ook iets over onze manier van werken. Daarom zetten we ze hier op een rij. We staan overigens open voor jouw kijk hierop. Jij hebt tenslotte ervaring met tools die volgens jou meerwaarde bieden en we horen dan ook graag jouw mening!</p>\n<p>De tools waar wij enthousiast over zijn:</p>\n<p>Wij gaan voor ‘High quality code’; daarom gebruiken we Spotbugs / PMD / Clippy / ESLint. Zo helpen wij jou (en onszelf!) een betere programmeur te worden.</p>\n<p>Routinematige zaken worden we niet blij van, daarom proberen we juist dat te automatiseren. Hiervoor gebruiken we de toolset van GiT / Gitlab.\nWe werken naar continuous testing, door middel van automatische unittesting en Katalon als testautomatiseringstool.</p>\n<p>Last but not least de SDK, onze altijd actuele kennisbank, die helder maakt hoe je je code opbouwt.</p>\n<p>Kijk voor meer info op <a href=\"http://www.xential.com/vacatures\">http://www.xential.com/vacatures</a></p>\n<p>#vacature #developer #ontwikkelaar #JavaScript</p>\n",
        "how_to_apply": "<p>Kijk op <a href=\"https://www.xential.com/vacatures\">https://www.xential.com/vacatures</a> of stuur een e-mail naar <a href=\"mailto:hr@xential.com\">hr@xential.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEdaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d63743bf360550b9dcb744162eae98d407c72e43/Xential_Logo_Rood.png"
    },
    {
        "id": "0bbffc5b-d52b-49a5-aa2e-c868c1bcb545",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0bbffc5b-d52b-49a5-aa2e-c868c1bcb545",
        "created_at": "Fri Feb 12 13:27:04 UTC 2021",
        "company": "WoodWing",
        "company_url": "https://www.woodwing.com/en/jobs",
        "location": "Zaandam",
        "title": "Cloud Engineer (medior)",
        "description": "<p>Where you’ll work</p>\n<p>Every day, publishers and brands around the world work with WoodWing products to create magazines, newspapers, and other content, online, in-app, and in print. At WoodWing, you will help build the future of content production, in an organization with little hierarchy and lots of freedom to develop your own skills.</p>\n<p>About your role</p>\n<p>Join us to help develop and expand our cloud platform. By combining our products Studio, Assets DAM and Inception together, the WoodWing Cloud Services product is a solution which helps fast, flexible and cost-effective content creation, production, archiving, distribution and analytics.</p>\n<p>Who you are</p>\n<p>We’re looking for a developer who will, as part of our strong team, develop solutions for our cloud products. As a Cloud Developer, you’ll work on setting up and maintaining software which makes use of AWS infrastructure. Together with your team, you have the responsibility of developing the software and environment in such a way that it is highly stable, dependable and secure. You’ll be required to think about the architecture and new functionality and bring those to life together with your team. The teams at WoodWing have the freedom to decide for themselves which tools and technologies they use to be able to do their work. The core of the current technology stack is built within AWS. Aside from that, we use multiple languages, libraries and tools within our applications, as long as it helps us achieve our goals. We expect you to pick up new things quickly and to strengthen the team with your own experience and ideas. You will need to achieve a good balance between attention to detail, speed of development and maintaining code quality.</p>\n<p>Minimum requirements:</p>\n<ul>\n<li>Experience with Docker.</li>\n<li>Ability to design and develop cloud-based solutions.</li>\n<li>Experience with more than 2 programming languages.</li>\n<li>Experience with high availability infrastructure.</li>\n<li>Experience with infrastructure as code, automation, test driven development, troubleshooting and root cause analysis.</li>\n<li>Experience with Continuous Deployment or Continuous Delivery.</li>\n<li>You can pick up new programming languages or tools quickly if need be.</li>\n<li>You can work independently within a small, highly skilled team.</li>\n<li>3 years experience as a cloud developer.</li>\n<li>You can communicate in English, in both spoken and written word.</li>\n<li>Experience of applying an agile methodology.</li>\n</ul>\n<p>To your advantage:</p>\n<ul>\n<li>AWS Certification such as: AWS Certified Cloud Practitioner, AWS Developer, AWS Solutions Architect.</li>\n<li>Experience with Amazon Web Services (AWS) platform, including Elastic Container Service, Elastic Compute Cloud (EC2), CloudFormation, CodeBuild, CodePipeline, Lambda &amp; Step Functions.</li>\n<li>More than 4 years experience as a developer, in total.</li>\n<li>Experience with build servers like Jenkins or AWS CodeBuild.</li>\n<li>Experience with frameworks such as AWS SAM or CDK.</li>\n<li>Experience with NodeJS, Python, Bash and Makefiles.</li>\n<li>Experience with Jira and Confluence.</li>\n<li>Experience with developing for and contributing to Open Source projects</li>\n</ul>\n<p>What you’ll be doing</p>\n<ul>\n<li>Collaborate with a strong team of professional developers.</li>\n<li>Help to specify and build new functionality.</li>\n<li>Help the team improve and maintain existing codebases.</li>\n<li>Create solutions to be proud of, for large international customers.</li>\n</ul>\n<p>What we offer</p>\n<ul>\n<li>We build standard products, not custom work. At WoodWing you’ll have the time to build a good architecture.</li>\n<li>We offer the chance to attend professionally related international events.</li>\n<li>There are many possibilities to develop yourself further and grow within our mature and flexible organization, such as gaining AWS Certification.</li>\n<li>Located in Zaandam, easily reachable by both train or car. Plenty of parking spaces.</li>\n<li>Contact with colleagues working around the world, with a strong base of developers in Zaandam</li>\n<li>Possibility to occasionally work from home (we are currently working fully remotely)</li>\n<li>Excellent secondary employment benefits.</li>\n<li>Informal working environment including Nerf guns, table tennis table, foosball table, pool table and pair programming tables.</li>\n<li>Every six months, three explore days where you can work on any project you like.</li>\n</ul>\n<p>Our culture and values\nOur team is made up of more than 20 nationalities, across offices in the Netherlands, Malaysia, and the US. While we have a mix of people, we have a common goal: to build the future of content production for the world’s leading publishers and brands.</p>\n<p>WoodWing is an organization with a history of innovation. Nearly two decades ago, we helped popularize Adobe InDesign with our first plugin. In 2010 we were the first software provider to make it possible to publish on the iPad. And in 2019 we became the preferred partner of Apple for publishing to Apple News+.</p>\n<p>Our culture is built around six values - Exploration, Collaboration, Leadership, Fun, and People at Heart. Our values to bring culture to life in our day-to-day behavior. They are carefully selected based on what we have developed over our years as a company, and what we consider important to reach our vision.</p>\n<p>Ready to meet us?\nIf this role looks like your next challenge, please apply by sending your cv and motivation to <a href=\"mailto:jobapplications@woodwing.com\">jobapplications@woodwing.com</a>.</p>\n<p>Important Note:</p>\n<ul>\n<li>Applicants must be eligible to work in the EU.</li>\n<li>This is a direct hire, agencies are not welcome.</li>\n</ul>\n",
        "how_to_apply": "<p>Ready to meet us?\nIf this role looks like your next challenge, please apply by sending your cv and motivation to <a href=\"mailto:jobapplications@woodwing.com\">jobapplications@woodwing.com</a>.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2laIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--49acef93f082a5acf8c83e9c10efa16ff950db43/WW%20logo.png"
    },
    {
        "id": "42fe9c3d-bb5a-4e17-aa91-0ed2139bb057",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/42fe9c3d-bb5a-4e17-aa91-0ed2139bb057",
        "created_at": "Fri Feb 12 13:24:06 UTC 2021",
        "company": "WoodWing",
        "company_url": "https://www.woodwing.com/en/jobs",
        "location": "Zaandam",
        "title": "PHP Developer (medior/senior)",
        "description": "<p>Where you’ll work</p>\n<p>Every day, publishers and brands around the world work with WoodWing products to create magazines, newspapers, and other content, online, in-app, and in print. At WoodWing, you will help build the future of content production, in an organization with little hierarchy and lots of freedom to develop your own skills.</p>\n<p>About your role</p>\n<p>Come help us develop our Studio Server codebase further, taking us to the next level. Studio Server is the engine behind our advanced workflow- and content editing software, guiding many of the world’s top publishers to produce print- and digital content.</p>\n<p>We’re looking for a medior backend developer who will help maintain, build new functionality and implement improvements within the Studio Server. You’ll work with other developers to both support frontend functionality and expand the capabilities of the system. You think about the desired user process and design new or improved functionality or API’s. At WoodWing, developers have the freedom to choose which tools and technologies they want to use to get the work done, respecting the limitations of the existing frameworks and code. You enjoy working with other developers to improve your knowledge.</p>\n<p>The core of the current technology stack comprises PHP, SQL, Java, C++, Angular JS and JavaScript. Your main focus will be on PHP and SQL. We use other languages, libraries and tools in our applications – as long as it helps us reach our goals. We expect you to pick up new things quickly and to strengthen the team with your own experience and ideas.</p>\n<p>Who you are\nMinimum requirements:</p>\n<ul>\n<li>2+ years’ experience as a developer, preferably working on web apps</li>\n<li>Experience with object oriented programming languages, preferably Java or C++</li>\n<li>Experience with PHP</li>\n<li>Experience with test driven development</li>\n<li>Experience with troubleshooting and root cause analysis</li>\n<li>Experience with large data models, relational databases and SQL</li>\n<li>You can pick up new programming languages or tools quickly if need be.</li>\n<li>You can work independently within a small, multidisciplinary team.</li>\n<li>Experience with source code repositories, preferable Git/Github</li>\n<li>You can communicate in English, both spoken and written word</li>\n<li>Experience of working within the Agile methodology.</li>\n</ul>\n<p>What we offer</p>\n<ul>\n<li>We build secure, standard products, not custom work. At WoodWing, you’ll have the time to build a good architecture.</li>\n<li>We offer the chance to attend professionally related international events</li>\n<li>There are many possibilities to develop yourself further and grow within our mature and flexible organization</li>\n<li>Located in Zaandam, easily reachable by both train or car. Plenty of parking spaces.</li>\n<li>Contact with colleagues working around the world, with a strong base of developers in Zaandam.</li>\n<li>Possibility to occasionally work from home</li>\n<li>Informal working environment including Nerf guns, table tennis, fussball table, pooltable and pair programming tables.</li>\n<li>A competitive salary, a MacBook Pro, free drinks, fruits, and snacks.</li>\n</ul>\n<p>Our culture and values</p>\n<p>Our team is made up of more than 20 nationalities, across offices in the Netherlands, Malaysia, and the US. While we have a mix of people, we have a common goal: to build the future of content production for the world’s leading publishers and brands. WoodWing is an organization with a history of innovation. Nearly two decades ago, we helped popularize Adobe InDesign with our first plugin. In 2010 we were the first software provider to make it possible to publish on the iPad. And in 2019 we became the preferred partner of Apple for publishing to Apple News+.</p>\n<p>Our culture is built around six values - Exploration, Collaboration, Leadership, Fun, and People at Heart. Our values to bring culture to life in our day-to-day behavior. They are carefully selected based on what we have developed over our years as a company, and what we consider important to reach our vision.</p>\n<p>Ready to meet us?\nIf this role looks like your next challenge, please apply by sending us your cv and motivation to <a href=\"mailto:jobapplications@woodwing.com\">jobapplications@woodwing.com</a>.</p>\n<p>Important Note:</p>\n<ul>\n<li>Applicants must be eligible to work in the EU and work in Zaandam office</li>\n<li>This is a direct hire, agencies are not welcome.</li>\n</ul>\n",
        "how_to_apply": "<p>Ready to meet us?\nIf this role looks like your next challenge, please apply by sending us your cv and motivation to <a href=\"mailto:jobapplications@woodwing.com\">jobapplications@woodwing.com</a>.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2FaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a775c27d62ff94f29dd59b11fa6a40f9486ce37d/WW%20logo.png"
    },
    {
        "id": "7fa9c147-ce9d-4440-b4e2-fcc0e901c861",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/7fa9c147-ce9d-4440-b4e2-fcc0e901c861",
        "created_at": "Fri Feb 12 12:31:37 UTC 2021",
        "company": "MeisterLabs Software GmbH",
        "company_url": "https://www.meisterlabs.com/",
        "location": "Vienna",
        "title": "Senior Back-End Developer (f/m/d)",
        "description": "<p>Meister was founded in 2006 and although we're already a fully grown company, we’ve managed to sustain a startup culture that feels like working with friends. Our offices are truly international, with team members from the U.S., U.K., Ireland, Austria, Germany, Romania, Hungary, Costa Rica and India - a global team to serve an equally global user base. We're big advocates of diversity and are proud to have a growing number of women in our tech company, including in leadership positions. We feel our low employee turnover rate is proof of our positive working culture, including the 10-year employment jubilees we've recently celebrated together.</p>\n<p><strong>Your Responsibilities</strong></p>\n<p>As a Senior in our Back-End, you will be bringing our products to the next level. You develop and implement the coolest new features and also keep an eye on our infrastructure. To top things off, you will also give guidance to our juniors and thus raise the bar for software development at Meister.</p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>At least 5 years of experience in software development with OOP languages</li>\n<li>Hands-on experience with Ruby, Ruby on Rails and/or Elixir is a big plus</li>\n<li>DevOps mindset and knowledge of infrastructure (e.g. Docker, Kubernetes)</li>\n<li>Experience with web technologies</li>\n<li>Bonus: Experience in mentoring and coaching</li>\n<li>Good team spirit and organizational skills</li>\n<li>Curiosity to challenge the status quo</li>\n</ul>\n<p><strong>Our offer</strong></p>\n<ul>\n<li>Small, highly motivated team</li>\n<li>Competitive annual salary starting from 50.000 Euro gross, depending on your experience</li>\n<li>A strong focus on the personal and professional development of all employees</li>\n<li>Take part in fairs and conferences (e.g. Google I/O)</li>\n<li>Beautiful office in the heart of Vienna (snack bar, company garden, leisure rooms,…)</li>\n<li>Startup atmosphere (BBQs in the garden, sport sessions, annual retreats,…)</li>\n<li>Various employee benefits (additional holidays, public transport card, state-of-the-art equipment,…)</li>\n<li>Location: Vienna, Austria</li>\n</ul>\n<p><img src=\"https://camo.githubusercontent.com/623aacb2bcf817b2a6313c44cc6baa829b304432/68747470733a2f2f742e676f686972696e672e636f6d2f682f64396361323139383436333332383839623363306666383836643862326235383034373364303237363066346162636664396139613138393761333535343263\"></p>\n",
        "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/a685ba14f5def834468dcac0b5a30ffb04a42d504e1c4759b73a6865b73bf36b\">application form</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0taIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0ecfa21a7b8d3a6bddb9dc724f1eede6f734cbb4/MeisterLabs%20Software%20GmbH.png"
    },
    {
        "id": "86c8ea47-ce0f-4a32-99e9-c6ece94e0516",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/86c8ea47-ce0f-4a32-99e9-c6ece94e0516",
        "created_at": "Fri Feb 12 12:28:26 UTC 2021",
        "company": "Lampenwelt GmbH",
        "company_url": "https://www.lampenwelt.de/",
        "location": "Berlin",
        "title": "Senior Full-Stack Developer (m/w/x) 100% Remote",
        "description": "<p>Suchst du eine neue, spannende Herausforderung? Eine Anstellung mit starken Entwicklungsmöglichkeiten in einem der führenden Online-Unternehmen Deutschlands? Persönliche und berufliche Entfaltungsmöglichkeiten?</p>\n<p><a href=\"http://lampenwelt.de/\">Lampenwelt.de</a> gehört zu den führenden E-Commerce Unternehmen Deutschlands und ist unter den Online-Spezialisten in seiner Branche <strong>Marktführer</strong> und Benchmark in Europa. Wir sind in <strong>17 europäischen Ländern</strong> aktiv. Mit einem Team von aktuell <strong>über 500 Mitarbeitern aus 25 Nationen</strong> schreiben wir die Erfolgsgeschichte von Lampenwelt fort – und brauchen Verstärkung.</p>\n<p><strong>Deine Aufgaben:</strong></p>\n<ul>\n<li>contribute in architecture and other fundamental discussions</li>\n<li>implement assigned stories using the architecture and technology chosen by the team</li>\n<li>transform design layouts into state of the art mobile-first applications under consideration of our code guidelines</li>\n<li>taking care of APIs, connections to third party tools</li>\n<li>create high quality, reusable and resilient code</li>\n<li>explore and evaluate new technologies and frameworks</li>\n<li>implement all required tests to meet the „Definition of Done\"</li>\n<li>help and train other engineers on their technical tasks</li>\n</ul>\n<p><strong>Du bringst mit:</strong></p>\n<p>As a web developer by heart you:</p>\n<ul>\n<li>have a solid understanding of modern web architecture and advanced experience in a web framework like next.js, react, vuejs, node/nestjs, but also Ruby on Rails, Elixir or Phoenix</li>\n<li>have relevant experience in developing large web applications (preferably for e-commerce)</li>\n<li>have knowledge of cloud computing and how to write software in IAAS/PAAS mode</li>\n<li>have knowledge in event-drive / microservice architecture is advantageous</li>\n<li>have knowledge in test automation and CI/CD</li>\n<li>are looking for a place where you can challenge yourself, thrive and make your work time count</li>\n<li>have experience in stakeholder and time management</li>\n<li>have a deep understanding of agile work and use the know how to organize work around stories and tasks</li>\n<li>are proactive, self-reliant, self-reflective and assertive</li>\n<li>have 5-6 years of work experience</li>\n</ul>\n<p><strong>Wir bieten:</strong></p>\n<p><strong>Homeoffice</strong></p>\n<ul>\n<li>Homeoffice regulation</li>\n</ul>\n<p><strong>Employee discounts</strong></p>\n<ul>\n<li>Special conditions on our product range</li>\n</ul>\n<p><strong>FlexWork</strong></p>\n<ul>\n<li>Possibility of flexitime</li>\n</ul>\n<p><strong>Individual development opportunities</strong></p>\n<ul>\n<li>Individual training</li>\n</ul>\n<p><strong>JobBike</strong></p>\n<ul>\n<li>Contribution to your own dream bike</li>\n</ul>\n<p><strong>Sports and fitness offers</strong></p>\n<ul>\n<li>Special conditions for Lampenwelt employees in all fitness studios</li>\n</ul>\n<p><strong>Entrepreneurial atmosphere</strong></p>\n<ul>\n<li>Company events and high appreciation of employees</li>\n</ul>\n<p><strong>Team spirit</strong></p>\n<ul>\n<li>Meet for coffee with our CEO? Participate in the company's own running or soccer group? We live and breathe togetherness!</li>\n</ul>\n<p><strong>Dein Ansprechpartner:</strong></p>\n<p><strong>Melissa Barnes</strong></p>\n<p>+49 6642-406 99 9930\n<a href=\"mailto:melissa.barnes@lampenwelt.de\">melissa.barnes@lampenwelt.de</a></p>\n<p>Wir freuen uns auf deine aussagekräftigen Bewerbungsunterlagen!\n<strong>Bewerbungen bitte online unter dem Button \"Bewerben\" einreichen!</strong></p>\n<p><img src=\"https://camo.githubusercontent.com/5802eb011c2355537029d1f0c484d96819a43a06/68747470733a2f2f742e676f686972696e672e636f6d2f682f65303163643464663330333235333466663236613264393431653533653764336565393733653432616232663334333231383031646338313932373231383139\"></p>\n",
        "how_to_apply": "<p><a href=\"https://t.gohiring.com/h/3b672064a26cd3f6a5903afb02306e409aa062a70f5a808f0d8f0fa9a090a605\">application form</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0NaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fbdcab71e0920a20aac57d05c2d4cf1dd50dcac2/Lampenwelt%20GmbH.jpg"
    },
    {
        "id": "a104b3fe-db72-4f8c-a77b-affeb562d1ff",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/a104b3fe-db72-4f8c-a77b-affeb562d1ff",
        "created_at": "Fri Feb 12 11:00:23 UTC 2021",
        "company": "Imperial College Union",
        "company_url": null,
        "location": "London, UK",
        "title": "Web Developer",
        "description": "<p>Full time, fixed term\nSalary £33,376 – £37,682 plus benefits</p>\n<p>Imperial College Students’ Union is an innovative, democratic and evolving organisation based in South Kensington supporting students studying at Imperial College London.</p>\n<p>As a Web Developer you will bring an enthusiastic and positive approach to a high-performing development team within Imperial College Union. The solutions the team produces help the organisation meet its ambitious targets, providing excellent experiences for students at Imperial College.</p>\n<p>Working alongside developers and other staff in the organisation, your development skills (SQL, HTML, CSS, PHP etc.) will be the primary driver of improvement to our business management system and enable the team to produce exciting new applications for a range of functions including retail, finance, student engagement and marketing. Strong knowledge of databases and SQL will be especially beneficial to you in this role.</p>\n<p>You will be expected to use your skills to resolve issues and improve user interfaces across our systems while maintaining and improving our main customer-facing Drupal site at imperialcolleunion.org. You will contribute to supporting our existing systems and creating documentation where necessary.</p>\n<p>The ideal candidate for this role will have a broad range of skills in front-end web development, server management and web-based application development. Experience working in an Agile development team and knowledge of user experience principles would be of benefit. We are committed to producing user-friendly, highly accessible solutions for our users, so knowledge of accessibility standards and responsive web design is vital to this role.</p>\n<p>Imperial College Union has three bars, two catering outlets, two retail outlets and a Nightclub venue on site. Situated in a picturesque quadrangle immediately behind the Royal Albert Hall, the Union Building is also home to numerous spaces for student activities including a gym, cinema and concert hall.</p>\n<p>The team has been working remotely via Microsoft Teams for most of the Pandemic and will likely continue to do so for the foreseeable future. You will be expected to be comfortable with standard remote working tools.</p>\n<p><a href=\"https://www.imperial.ac.uk/jobs/description/PRO00486/web-developer/\">https://www.imperial.ac.uk/jobs/description/PRO00486/web-developer/</a></p>\n",
        "how_to_apply": "<p>Apply here: <a href=\"https://www.imperial.ac.uk/jobs/description/PRO00486/web-developer/\">https://www.imperial.ac.uk/jobs/description/PRO00486/web-developer/</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnlZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8bdb9983a93839e701544ac1ddb0aadf0759eeed/ICU%20Logo.jpg"
    },
    {
        "id": "46ab84b4-12dc-4a95-ab08-422428554dfc",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/46ab84b4-12dc-4a95-ab08-422428554dfc",
        "created_at": "Fri Oct 09 19:42:30 UTC 2020",
        "company": "Playco",
        "company_url": "http://www.play.co",
        "location": "Remote",
        "title": "Core/Backend Engineer",
        "description": "<p>Here at Playco, we make games that bring the world closer together through play.</p>\n<p>Our ideal teammates are thoughtful, humble, and passionate professionals who can both zoom into the details and zoom out to embrace the big picture. We are inspired by makers and tinkerers, who are unafraid to experiment with a healthy disregard for constraints. We hope you'll enrich our team with your enthusiasm and passion, both for games and for life.</p>\n<p>Our engineers are generally amazing at something and great at everything else. We write scalable backend systems, cross-compilers, JavaScript / TypeScript game APIs and tools, and whatever else it takes. No matter what you work on each day, you will work with the best engineers in the world; we have top talent in every part of our stack.</p>\n<p><strong>The Role</strong></p>\n<ul>\n<li>Be a key member of a high performing software engineering team.</li>\n<li>Architect and code sophisticated client/server systems for instant gaming.</li>\n<li>Play a critical role in day-to-day coding, performance profiling, optimization, and general troubleshooting.</li>\n<li>Collaborate with design, engineering, and production teams to devise optimal engineering solutions to game requirements.</li>\n<li>Learn from and mentor other engineers on your team.</li>\n<li>Take ownership of your projects to make them the best they can possibly be.</li>\n<li>Provide valuable input on the company’s long-term engineering roadmap and help identify areas of opportunity for improvement.</li>\n</ul>\n<p><strong>Desired Skills</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science or related field, or equivalent experience.</li>\n<li>3+ years of professional software engineering experience.</li>\n<li>Experience writing clean, testable, high-quality code and designing highly scalable systems in production.</li>\n<li>Solid familiarity with deployment on cloud environments (AWS, GCP, Azure, etc.).</li>\n<li>Strong Computer Science fundamentals in software systems design, algorithms, and data structures.</li>\n<li>Ability to interact with peers in a constructive and productive style.</li>\n<li>Familiarity with git, svn, or other VCS.</li>\n<li>Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers, and other developers.</li>\n<li>Strong team player with a positive attitude.</li>\n</ul>\n<p><strong>Bonus</strong></p>\n<ul>\n<li>Expert knowledge of NodeJS and ES6 / TypeScript.</li>\n<li>DevOps experience -- setting up CI/CD environments, orchestrating deployments, creating monitoring dashboards, anything that makes the development process easier, more enjoyable and more accountable.</li>\n<li>Experience in game development and shipped titles.</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://jobs.lever.co/playco/4cbca38a-563f-432f-978b-b41f1dabc66c?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">Apply Here</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2FMIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cb29d1ab0fec648aee52b0ad6e7ec0a0485551ca/Round_Logo1%20(1).png"
    },
    {
        "id": "1f21b777-6e99-483d-b3c2-d55b07654194",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/1f21b777-6e99-483d-b3c2-d55b07654194",
        "created_at": "Thu Feb 11 18:49:39 UTC 2021",
        "company": "Boston Red Sox ",
        "company_url": null,
        "location": "Boston",
        "title": "Data Engineer ",
        "description": "<p>POSITION OVERVIEW:\nThe Data Engineer, Baseball Systems position will be a member of the baseball operations software development team, and is responsible for integrating, collecting, processing, and storing many sources of baseball data, as well as designing and building new data solutions. This position must be comfortable with on-premises and cloud solutions, and take the initiative to explore new optimizations and cutting-edge data technologies. This individual will work closely with our data architect, analysts, developers, and other members of baseball operations.</p>\n<p>RESPONSIBILITIES:</p>\n<p> Build leading-edge baseball solutions together with the software development team, analysts, and others on new and existing baseball systems\n Build and maintain integration pipelines, often via an API or file-based, while also identifying areas of improvement and spending time to re-architect when required\n Build and maintain infrastructure to optimize extraction, transformation, and the loading of data from various sources\n Design, build, and maintain data warehousing solutions for the software development and analytics teams\n Build and maintain tools for the analysts to enable more efficient and extensive data modeling and simulation efforts\n Participate in key phases of the software development process of critical baseball applications, including requirements gathering, analysis, effort estimation, technical investigation, software design and implementation, testing, bug fixing, and quality assurance\n Actively participate with software developers and data architects in design reviews, code reviews, and other best practices\n Work closely at times with baseball analysts to design and implement data solutions\n Respond to and resolve technical problems and issues in a timely manner</p>\n<p>TECHNICAL SKILLS &amp; QUALIFICATIONS:</p>\n<p> Bachelor’s degree in Computer Science, Software Engineering, Computer Engineering, Statistics, Information Systems, or a related field\n 2-3 years of experience in a Data Engineer role\n Strong SQL skills, including query optimization and database design\n Experience building custom API integrations, interfacing with JSON, XML, and custom data structures\n Experience with AWS, GCP, or Azure cloud services, such as Cloud SQL, RDS, Redshift, Azure SQL, Azure SQL DW, or others\n Experience building data solutions using Python, C#, C++, Ruby, or other languages\n Experience with scheduling and workflow management platforms, such as Airflow\n Experience with big data frameworks such as Hadoop or Spark is a plus\n Experience with R and RStudio is a plus\n Experience with engineering and productionizing statistical/ML models a plus\n Professional experience as an analyst/data scientist (or extensive coursework) a plus</p>\n<p>GENERAL SKILLS:\n Ability to work autonomously and as a team in a fast paced environment\n High level of attention to detail with the ability to multi-task effectively\n Comfortable working remotely using Zoom, Teams, Slack, Trello, and other tools to communicate with all team members\n High degree of professionalism and ability to maintain confidential information\n Excellent organizational and time management skills\n An understanding of baseball is a plus</p>\n",
        "how_to_apply": "<p><a href=\"https://jobs.lever.co/redsox/e97bbd44-4dfa-483a-aab3-a0f7f822d87e\">https://jobs.lever.co/redsox/e97bbd44-4dfa-483a-aab3-a0f7f822d87e</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnFZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0a14d07473ed87e099577506264fd8e6ee906a83/download.png"
    },
    {
        "id": "efcb9d11-0c85-46ff-a593-2d9a2d290224",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/efcb9d11-0c85-46ff-a593-2d9a2d290224",
        "created_at": "Thu Feb 11 18:18:01 UTC 2021",
        "company": "unwynd.io",
        "company_url": "http://www.unwynd.io",
        "location": "Remote",
        "title": "Top-Notch Senior Full-Stack Developer (Electron.js & node.js)",
        "description": "<p>We are expanding our amazing team and looking for a top-notch <strong>5yr+ Full Stack Developer</strong> to join our team on a remote basis.</p>\n<p>We are building the very first text editor powering fully digitized documents in a dedicated project environment bringing structure to unorganized content to harness the power of hidden insight.</p>\n<p>You should be comfortable around both backend and frontend languages and frameworks as you will have the opportunity to work through our entire stack, from the backend API to the web and desktop App.</p>\n<p><em>Requirements:</em></p>\n<ul>\n<li>Strong knowledge of JavaScript web frameworks such as node.js, react.js, vue.js, electron.js, chromium, etc. (ideally electron &amp; chromium)</li>\n<li>Strong knowledge of frontend technologies such as HTML, CSS and LESS</li>\n<li>Good knowledge of database management such as MySQL and Postgres</li>\n<li>Knowledge of REST API concepts</li>\n<li>Proficient understanding of Git</li>\n<li>Passion for writing clean code, making use of coding standards and design patterns</li>\n</ul>\n<p><em>You will stand out if you have:</em></p>\n<ul>\n<li>Experience working on Add-Ons for VSCode or Atom.io</li>\n<li>Experience working with ReactJS and/or React Native</li>\n<li>Experience working with richly formatted text (.docx, .xlsx, etc.)</li>\n<li>Comfortable writing unit tests</li>\n<li>Familiarity with Docker</li>\n<li>Familiarity with AWS</li>\n</ul>\n",
        "how_to_apply": "<p>Email your resume/CV to <a href=\"mailto:contact@unwynd.io\">contact@unwynd.io</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdldZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c393a347d629cad343fbb97c300ffd14b8899166/linkedin-logo_2.png"
    },
    {
        "id": "fb73d8f4-6cf4-4559-9fc8-ce5e358bfafd",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/fb73d8f4-6cf4-4559-9fc8-ce5e358bfafd",
        "created_at": "Thu Feb 11 18:15:21 UTC 2021",
        "company": "Consumer Priority Services",
        "company_url": null,
        "location": "Brooklyn, NY",
        "title": "Full Stack Developer",
        "description": "<p>Full Stack Developer needed for well established and growing consumer based technology service company.</p>\n<p>Projects focus on enhancing and maintaining company’s proprietary platforms, including customer management, sales generation and sales team administration systems.</p>\n<p>Role requires deep experience and strong expertise with SQL, C#, VB.NET and Fluent Interface.</p>\n<p>Must also possess core competencies with HTML, CSS, Ajax, JavaScript, jQuery, JSON, .NET as well as SaaS vehicles including WordPress, Shopify, BigCommerce, Magento and Epicor.</p>\n<p>The ideal candidate:</p>\n<p>· A creative problem solver with a business mindset.</p>\n<p>· An analytical thinker with strong communication skills</p>\n<p>· A results oriented demeanor</p>\n<p>· Extremely accessible due to the dynamic nature of our business.</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:mfein@cpscentral.com\">mfein@cpscentral.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkdZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e6c1af228b81fb2fd01c6b28b93d9a12bc7944a8/CPS-Logo-high-res2.jpg"
    },
    {
        "id": "a0326666-9a5a-473d-bce3-546c69c676d5",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/a0326666-9a5a-473d-bce3-546c69c676d5",
        "created_at": "Wed Feb 10 22:40:36 UTC 2021",
        "company": "Timehop",
        "company_url": "https://www.timehop.com/",
        "location": "Remote",
        "title": "Programmatic Solutions Engineer",
        "description": "<p>About us</p>\n<p>Every day, millions of users come to Timehop to reminisce. Timehop surfaces all of your memories, from your camera roll and social media accounts to show you what you did and what you said on this day in history. Our platform has connected people to their past for nearly a decade, and we’ve successfully leveraged programmatic advertising to enable and empower our mission. We now offer this mobile advertising platform–called Nimbus–as a service to third-party mobile applications to power their programmatic advertising needs.\nWhat we’re looking for? We’re looking for an All-Star Solutions Engineer to help streamline Publisher/Client onboarding.</p>\n<p>How will you help us achieve it? You will be a pivotal touchpoint on new sales inbounds for publisher accounts. Your role will help facilitate the ease and transition starting from post-sales to onboarding to maintenance. Communication and creative thinking is a must! You’ll be responsible for managing expectations and help troubleshoot any technical issues.\nYou will have the opportunity to forge strong relationships with clients, build trust, understand objectives and communicate as a consultative partner. You’ll be recommending best strategies and will be required to illustrate how Nimbus fits into those strategies, etc. Your role will require you to comprehend, identify and take action on publisher/app behavior/patterns.</p>\n<p>Job Description</p>\n<ul>\n<li>Developing an in-depth understanding of Nimbus’s technology and underlying architectures and being able to articulate to potential clients from a technical perspective on differences between Nimbus, and other competing products in the market.</li>\n<li>Managing the customer’s problems through effective technical assistance, diagnosis, resolution, or implementation of debug tools to ensure successful integration as their Nimbus technical point of contact.</li>\n<li>Reviewing client applications and doing build reviews to diagnose, remedy, and approve clients before go-live.</li>\n<li>Identifying and triaging urgent issues that may happen while the publisher is live and understanding the potential root cause of the issues.</li>\n<li>Understanding customer needs, thinking through creative solutions and advocating for their requests with cross-functional teams all while setting expectations throughout the integration process.</li>\n</ul>\n<p>Qualifications</p>\n<ul>\n<li>Proven track record of growing accounts by forging a strong relationship with clients, understanding their objectives, and recommending the best strategies.</li>\n<li>Effective time management skills – Ability to prioritize and meet deadlines.</li>\n<li>A passion for figuring out solutions to complex business problems faced by clients.</li>\n<li>Outstanding troubleshooting, analytical, and problem-solving abilities, along with an ability to collaborate cross-functionally in a fast-paced start-up environment.</li>\n<li>Eagerness to work in a dynamic environment that will be rapidly changing.</li>\n<li>Professional demeanor. Strong oral and written communication skills.</li>\n<li>Experience in advocating for customer issues or needs while informing internal product decisions.</li>\n<li>BS or BA required &amp; advanced degree desirable.</li>\n<li>Familiarity with iOS and Android, along with a working knowledge of mobile software development.</li>\n<li>Familiarity with common network protocols (HTTP/HTTPS) and the use of REST APIs.</li>\n<li>Excellent communication skills and ability to explain technical issues and resolution via email,   phone, video-conference, and in-person.</li>\n<li>Minimum of 2 years of similar experience.</li>\n</ul>\n<p>Bonus Points</p>\n<ul>\n<li>Hands-on programming experience.</li>\n<li>Familiarity with mobile application development and marketing.</li>\n<li>Expertise in working with SSPs, RTB, DSPs, ad exchanges, aggregators, ad servers, and other optimization platforms is a plus.</li>\n</ul>\n",
        "how_to_apply": "<p>Complete an application with us using the following link:\n<a href=\"https://jobs.lever.co/timehop/\">https://jobs.lever.co/timehop/</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdE9ZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1ba871f4cfd49fe4199f403fb511d7cf0f12c0e6/timehop_logo_yellow_500px-04.png"
    },
    {
        "id": "798a5097-75bf-4659-90fd-78caf35999a1",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/798a5097-75bf-4659-90fd-78caf35999a1",
        "created_at": "Thu Feb 11 15:07:30 UTC 2021",
        "company": "Rijksoverheid",
        "company_url": "http://www.werkenvoornederland.nl",
        "location": "Den Haag",
        "title": "Clusterbeheerder / systeembeheerder",
        "description": "<p><strong>Clusterbeheerder / systeembeheerder</strong>\n<strong>Ministerie van Justitie en Veiligheid, Nederlands Forensisch Instituut</strong></p>\n<p><strong>Functieomschrijving</strong>\nAls clusterbeheerder ga je aan de slag bij team Crypto, dat verantwoordelijk is voor het ontcijferen van digitale bewijsstukken. Jij wordt verantwoordelijk voor het beheer en onderhoud van het rekencluster bij het Nederlands Forensisch Instituut (NFI). De taken en verantwoordelijkheden die bij deze functie horen, zijn het beheer en onderhoud van de rekennodes, het volgen van updates in de gebruikte software, en het testen en in-stalleren van nieuwe hard- en software. Een onderdeel van jouw baan zal zijn om de be-schikbaarheid van de rekennodes te controleren, en de bedrijfszekerheid te verbeteren door middel van het opzetten en onderhouden van een geautomatiseerd monitoringsysteem.</p>\n<p>Wij zoeken iemand die het onderzoeksteam ondersteunt in het uitvoeren van slimme wachtwoordaanvallen op het rekencluster. Iemand die kan helpen met het inrichten van back-ups, zorgen dat alle scripts op orde zijn, het automatisch inspoelen van rekennodes, zorgen dat alle services draaien, vervangen van kapotte hardware en het debuggen van problematische hardware.</p>\n<p>Daarnaast werken we aan het verbeteren van het aanvalsdistributieplatform dat we in gebruik hebben, en maken we veel van deze verbeteringen met enige regelmaat publiek: <a href=\"https://github.com/s3inlc/hashtopolis/pull/649\">https://github.com/s3inlc/hashtopolis/pull/649</a>\nHet kunnen werken aan deze code is een pre.</p>\n<p>Via onderstaande link kun je luisteren naar een podcast waarin een crypto onderzoeker uit ons team wordt geïnterviewd (vanaf 1:23).</p>\n<p><a href=\"https://open.spotify.com/episode/5EUGuYFQ8Ui4uM2G4gtOyP?si=LAnrdUx7QrK642NxtCA2zA\">https://open.spotify.com/episode/5EUGuYFQ8Ui4uM2G4gtOyP?si=LAnrdUx7QrK642NxtCA2zA</a></p>\n<p>of</p>\n<p><a href=\"https://www.nrc.nl/brandedcontent/nfi/podcastserie-de-stille-getuige\">https://www.nrc.nl/brandedcontent/nfi/podcastserie-de-stille-getuige</a></p>\n<p>Spreekt dit je aan? Solliciteer! Wij gaan graag met je in gesprek!</p>\n<p><strong>Functie-eisen</strong></p>\n<ul>\n<li>Je hebt een hbo werk- en denkniveau, en een afgeronde opleiding in een technische richting (minimaal MBO 4), bij voorkeur informatica of ICT.</li>\n<li>Je hebt relevante werkervaring als systeembeheerder of een vergelijkbare functie.</li>\n<li>Je hebt ervaring met het opzetten en onderhouden van gedistribueerde systemen met behulp van provisioningsystemen zoals bijvoorbeeld PXE, Ansible, MAAS, ROCKS, of soortgelijke tooling.</li>\n<li>Je hebt ervaring met scripting- en programmeertalen zoals Bash, Python, en PHP.</li>\n<li>Ervaring met het aansturen van GPU's is een pre.</li>\n<li>Ervaring met web-based applicaties en PHP is een pre.</li>\n<li>Je hebt een goed begrip van hardware in computersystemen.</li>\n<li>Je hebt de analytische vaardigheden en de praktische kennis om hardware te kunnen debuggen: je weet wel raad met een moederbord dat niet door de POST heen komt.</li>\n</ul>\n<p><strong>Wat vinden wij nog meer belangrijk?</strong>\nJe hebt een proactieve en resultaatgerichte instelling. Je ziet het als uitdaging om je taken in deze functie zoveel mogelijk te automatiseren. Je hebt affiniteit met cryptografie, cryp-to-analyse en hardware, en je kan goed samenwerken. Tot slot ben je zelfstandig waar het kan, en vraag je om ondersteuning wanneer dat nodig is.</p>\n<p><strong>Arbeidsvoorwaarden</strong>\n<strong>Salarisniveau:</strong> schaal 9, schaal 10\n<strong>Salarisomschrijving:</strong> Op deze functie is het Functiegebouw Rijk van toepassing.\n<strong>Maandsalaris min.</strong> €2.756 – max. €4.430 bruto, overeenkomstig met schaal 10 CAO Rijk.\nInschaling vindt plaats op basis van je opleiding en ervaring. De mogelijkheid bestaat dat je in beginsel via een aanvangsschaal wordt aangesteld. Deze kan één schaal lager zijn dan de betreffende functieschaal.</p>\n<p>Voor de functie geldt een tijdelijke arbeidsmarkttoelage van 8% die aan het vermelde maandsalarissalaris wordt toegevoegd.\n<strong>Maandsalaris:</strong> Min €2.756 – Max. €4.430 (bruto)\n<strong>Dienstverband:</strong> Arbeidsovereenkomst voor bepaalde tijd met uitzicht op onbepaalde tijd\n<strong>Contractduur:</strong> Tijdelijke aanstelling met uitzicht op een vaste aanstelling\n<strong>Minimaal aantal uren per week:</strong> 36\n<strong>Maximaal aantal uren per week:</strong> 36</p>\n<p><strong>Overige arbeidsvoorwaarden</strong>\nNaast het salaris ontvang je een Individueel Keuzebudget (IKB). Het IKB bestaat uit geld (16,37% van je bruto jaarsalaris) en tijd. Met het IKB maak jij de keuzes die bij jou pas-sen en kun je een deel van je arbeidsvoorwaarden zelf samenstellen. Je kunt er bijvoor-beeld voor kiezen om een deel van je maandinkomen te laten uitbetalen wanneer jij dat wenst. Ook kun je dit budget omzetten in verlof en andersom of besteden aan fiscaal vriendelijke doelen. De Rijksoverheid hecht sterk aan persoonlijke groei en loopbaanont-wikkeling en biedt daarvoor tal van mogelijkheden. Tot de secundaire arbeidsvoorwaarden behoren onder meer verschillende studiefaciliteiten, bedrijfsfitness, volledige vergoeding van je OV-reiskosten woon-werkverkeer en gedeeltelijk betaald ouderschapsverlof</p>\n<p><strong>Wat kunnen wij jou nog meer bieden?</strong>\nJe leert werken met de nieuwste en snelste hardware, in een continu veranderende en ontwikkelende omgeving. Samen met gepassioneerde collega’s werk je aan een maat-schappelijk relevant doel.</p>\n<p><strong>Bijzonderheden</strong></p>\n<ul>\n<li>Solliciteren? Nadat je via de sollicitatiebutton hebt gereageerd kun je jouw motivatie en cv als Word- of pdf-bestand uploaden. We nodigen je graag uit om in je motivatiebrief ook iets over jezelf te vertellen.</li>\n<li>Het toetsen van de integriteit van onze nieuwe collega’s is voor het Nederlands Forensisch Instituut van groot belang. Voor deze functie geldt dat er een veiligheidsonderzoek niveau B moet worden opgestart bij de Algemene Inlichtingen- en Veiligheidsdienst. Ook een geheimhoudingsverklaring maakt deel uit van het sollicitatieproces.</li>\n<li>Wanneer je als rijksambtenaar een beroep doet op een voorrangspositie, stuur dan ook een kopie van je beschikking mee.</li>\n<li>Een assessment (psychologische en vaardigheidstest) maakt deel uit van het sollicitatieproces, net als het opvragen van referenties en het inzetten van een (online) screening.</li>\n<li>Aan deze tekst kunnen geen rechten worden ontleend.</li>\n<li>Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.</li>\n</ul>\n",
        "how_to_apply": "<p>Het Rijk hecht waarde aan een diverse en inclusieve organisatie. Werken in divers samengestelde teams maakt ons effectiever, innovatiever en het werk leuker. Eenieder wordt daarom uitgenodigd te <a href=\"https://www.werkenvoornederland.nl/vacatures/clusterbeheerder-systeembeheerder-NFI-2020-0037?utm_source=github&amp;utm_medium=jobboard&amp;utm_campaign=&amp;utm_term=nfi200037&amp;utm_content=574\">solliciteren</a>.</p>\n<p>Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXFZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--41ee3895c7c3d15f3d701968ffc39afaab4653a8/Rijksoverheid.jpg"
    },
    {
        "id": "b3ae353e-29b9-4c4a-95bc-c5279ac06063",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/b3ae353e-29b9-4c4a-95bc-c5279ac06063",
        "created_at": "Thu Feb 11 11:15:51 UTC 2021",
        "company": "Livello GmbH",
        "company_url": "https://www.livello.com/technologies",
        "location": "Düsseldorf",
        "title": "Technology Lead - IoT Startup (m/f/d)",
        "description": "<p>We are looking for an experienced Head of Technology / Technology Lead with full stack Javascript, embedded and IoT experience. To lead the software and hardware team in the agile development of our our web, mobile and cloud applications, IoT products, as well building efficient and scalable solutions. A hands-on role, where you will build and manage your own teams and coordinate outsourced development as required.</p>\n<p><strong>Our technology:</strong></p>\n<p>Livello is building the future of autonomous retail and smart inventory management. We are developing a revolutionary IoT Platform and telemetric Smart Kiosks with state-of-the-art smart shelving and monitoring technology, leveraging newest concepts and engineering principles like automation, autoscaling, resilience, real time monitoring, sensor fusion, computer vision, machine learning and deep analytics. Our stack consists of modern Javascript, Typescript, Node.Js, React &amp; Redux, Docker, containers, client libraries, GraphQL, all built on a microservice-based kubernetes architecture, supported by the Google Cloud Platform. We strongly believe in the power of CICD and integrate and deploy our applications with modern CICD tools from Gitlab.</p>\n<p><strong>Tasks/Responsibilities:</strong></p>\n<ul>\n<li>Lead, manage and build our tech team and coordinate outsourced development as required</li>\n<li>Technical product design, solution architecture, specifications and implementation of Livello solutions</li>\n<li>Development and optimisation of innovative electronic hardware products in the IoT and embedded environment</li>\n<li>Development of modern Javascript-based applications in the front and back-end</li>\n<li>Quality assurance of the software through planning, creation and execution of tests</li>\n<li>Work with a cross-functional team to define, build, test, and deploy universal applications</li>\n<li>Version control with Git is part of your daily work and continuous integration</li>\n<li>Ensure the implementation of technical standards and best practices</li>\n</ul>\n<p><strong>Requirements / Experience:</strong></p>\n<ul>\n<li>Master in Computer Science or comparable field of study</li>\n<li>5+ years of experience in leading technical teams, designing, architecture and implementation of technical systems</li>\n<li>Full Stack experience with JavaScript, React, GraphQL, Node.JS, Nest.js, TypeScript, Python</li>\n<li>State management solutions (Redux, -Saga)</li>\n<li>Test and deployment automations: gitlab, fastlane, jest,</li>\n<li>IoT-to-Cloud managed services, Microservices, Kubernetes and Docker on GCP</li>\n<li>IoT device management and message brokers like AMQP or MQTT</li>\n</ul>\n<p><strong>What we offer:</strong></p>\n<ul>\n<li>ESOP Shares</li>\n<li>A leading position in a fast growing and highly innovative start-up</li>\n<li>Young, agile and diverse team with colleagues from all over the world</li>\n<li>Open work environment with flat hierarchies and short decision-making paths</li>\n<li>Cool office in a prime location with lots of shopping/restaurant options nearby</li>\n<li>Advanced technology stack leveraging newest IoT hardware and software</li>\n<li>Plenty of creative freedom for own ideas, projects and personal development</li>\n<li>Free coffee, water, food, fruits and snacks on regular basis</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://livello.join.com/jobs/1880129-technology-lead-iot-startup-full-stack-software-hardware-embedded?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=technology%2Blead%2B-%2Biot%2Bstartup%2Bfull%2Bstack%2Bsoftware%2Bhardware%2Bembedded\">https://livello.join.com/jobs/1880129-technology-lead-iot-startup-full-stack-software-hardware-embedded?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=technology%2Blead%2B-%2Biot%2Bstartup%2Bfull%2Bstack%2Bsoftware%2Bhardware%2Bembedded</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdWlZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--743c3294113248619b6bf2278a2a90ef559d907c/2547101_original.jpg"
    },
    {
        "id": "e478c566-6d2e-4036-aa8e-4d374a6a5b71",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e478c566-6d2e-4036-aa8e-4d374a6a5b71",
        "created_at": "Thu Feb 11 10:19:54 UTC 2021",
        "company": "Global Organ Group",
        "company_url": "http://www.globalorgangroup.com",
        "location": "Ede",
        "title": "Allround Software Ontwikkelaar M/V",
        "description": "<p><strong>Zoek jij een bedrijf waar software en audio bij elkaar komen?</strong></p>\n<p>Voor ons kantoor in Ede, waar we met circa 45 medewerkers werken aan de ontwikkeling, productie en verkoop van onze orgels, zoeken wij een collega voor de volgende functie:</p>\n<p><strong>Allround Software Ontwikkelaar M/V</strong>\nfulltime 39 uur per week</p>\n<p>Je komt te werken bij een internationale orgelbouwer die de digitale orgels volledig zelf ontwikkelt aan zowel de hard- als software kant. De afdeling R&amp;D is een belangrijk spil in dit proces. Omdat onze ontwikkeling niet stil staat willen wij ons R&amp;D team uitbreiden met een allround software ontwikkelaar voor zowel PC als embedded software.</p>\n<p><strong>Werken bij Global Organ Group is iets bijzonders</strong>\nVergis je niet, onder de klassieke huid van kerkorgels zit state of the art embedded electronica met snelle microcontrollers, FPGA’s en DSP’s. Denk aan technologie die ook in keyboards en synthesizers zit, maar dan met een veel grotere polyfonie. Wij zoeken de grenzen van de techniek op met onder andere de laatste generatie SHARC DSP’s. Ook ontwikkelen we veel software op de PC die nodig is voor de orgels.</p>\n<p><strong>Over de functie van Software Ontwikkelaar</strong>\nJouw taken bestaan uit het ontwikkelen van onze software sampler voor het maken van de samples, tooling voor het configureren en inrichten van verschillende orgel modellen en verschillende web applicaties. Daarnaast ben je betrokken bij de embedded ontwikkeling van een nieuwe generatie digitale orgels op een platform met microcontrollers en DSP’s. Affiniteit of interesse voor de embedded kant is dus wel wenselijk. Je zal voornamelijk werken met C++ en Qt, maar ook C, C# en Python komen aan bod in meerdere IDE’s.</p>\n<p><strong>Wat vragen wij</strong></p>\n<ul>\n<li>HBO werk- en denkniveau (bij voorkeur afgeronde opleiding) in software engineering of embedded software</li>\n<li>Vaardigheid met C++ en Object Oriënted programming</li>\n</ul>\n<p><strong>Competenties</strong></p>\n<ul>\n<li>Loyale teamspeler die niet schroomt om zelf initiatief te nemen</li>\n<li>Bevlogen in het vakgebied</li>\n<li>Pragmatisch van aanpak, maar gefocust op hoge kwaliteit.</li>\n<li>Uitstekende communicatieve vaardigheden in zowel Nederlands als Engels</li>\n</ul>\n<p><strong>Onze merken</strong>\nDe Global Organ Group is de grootste speler in de wereld van digitale orgels. Al decennialang is de liefde voor het authentieke kerkorgelgeluid onze belangrijkste drijfveer. Dat geluid in diverse toonaarden toegankelijk te maken voor een breed publiek, kan wel gezien worden als het hart van onze missie. De vertaalslag van het authentieke pijporgelgeluid naar digitale orgels kent een rijke variëteit. Al die soorten en smaken zijn terug te vinden in de 4 merken die onder de Global Organ Group vallen:</p>\n<ul>\n<li>Copeman Hart, dat zich toelegt op authentiek Engels maatwerk in de digitale kerkorgelwereld;</li>\n<li>Johannus, dat de rijke Europese muzikale traditie verklankt in zowel huiskamer- als kerkorgels;</li>\n<li>Makin, dat met zijn kerkorgels nadrukkelijk in de Engelse traditie staat;</li>\n<li>Rodgers, dat in zijn kerkorgels het typisch Amerikaanse pijporgelgeluid vertolkt.</li>\n</ul>\n<p><strong>Global Organ Group biedt jou</strong>\nEen fulltime functie in een mooie organisatie die gekenmerkt wordt door dynamiek, een open werksfeer en een platte hiërarchie. Wij bieden je een salaris afhankelijk van je opleiding en ervaring.\nJe begint met een tijdelijk contract dat bij gebleken geschiktheid omgezet zal worden naar een vast dienstverband.</p>\n",
        "how_to_apply": "<p>Stuur je CV met motivatiebrief naar onze interim HR afdeling via onze <strong><a href=\"https://global-organ-group.onlinevacatures.nl/nl/job/178079/apply?utm_source=github&amp;utm_medium=referral&amp;utm_term=2021&amp;utm_content=178079&amp;utm_campaign=allround-software-ontwikkelaar-m-v\">sollicitatiepagina</a></strong>.</p>\n<p>Voor meer informatie kan je contact opnemen met Marja Verweij (Interim HR) op telefoonnummer 0318-742142. Kijk ook eens op onze website: <a href=\"http://www.johannus.com/\">www.johannus.com</a>.</p>\n<p>Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.</p>\n<p><em>Trefwoorden: Software Ontwikkeling, Software Ontwikkelaar, Software Engineering, Embedded Software, IT, ICT</em></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdVdZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--199fbc97cc7dda06168fbe36b2c0b8a4e1bbb25e/Logo%202017.jpg"
    },
    {
        "id": "c05204de-9a30-4b5d-9e53-4db079155253",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/c05204de-9a30-4b5d-9e53-4db079155253",
        "created_at": "Mon Jan 11 03:48:08 UTC 2021",
        "company": "ExpressVPN",
        "company_url": "http://www.expressvpn.com",
        "location": "SIngapore / Remote",
        "title": "Server-side Software Developer",
        "description": "<p><strong>Location: Singapore or Remote</strong></p>\n<p><strong>We're looking for creative server-side software developers</strong></p>\n<p>Join our back-end teams building user-friendly online services for consumers. We use a micro-services architecture with a broad range of different technology stacks and high levels of automated test coverage. The majority of our back-end is written in Ruby.</p>\n<p><strong>Highlights</strong></p>\n<ul>\n<li>Scale and performance challenges. Handle tens of thousands of rpm, scale across geographically distributed datacenters, solve complex computational tasks quickly, and be highly available.</li>\n<li>Security. We work with world-class penetration testers.</li>\n<li>API design. We have client-side apps for Windows, Mac, Android, iOS, Linux, routers, and browser extensions for Chrome, Firefox, and Safari. Keep the API designs simple and meet the various requirements for our apps.</li>\n<li>Split-testing. We make heavy use of A/B testing to optimize our front-end for sales conversions. We have enough volume to often get significant results within one day.</li>\n</ul>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>\n<p>Your responsibilities may cover systems that each bring their own set of interesting technical and design challenges, especially around scale, security, and availability.</p>\n</li>\n<li>\n<p>Continuous Delivery. All logic is tested automatically. We deploy multiple times per day. We often use TDD.</p>\n</li>\n<li>\n<p>Microservices architecture. We can pick the right stack for each individual application. Currently those involve combinations of Ruby, Go, Node.JS, C, mySQL, Postgres, Redis, MongoDB, RabbitMQ, Docker, Chef and Ansible.</p>\n</li>\n<li>\n<p>Code-reviews. We invest in spreading knowledge around the team, and keeping our code easy to read, test, and maintain.</p>\n</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>You love to solve problems, you’re excited about building well-designed systems, eager to learn and continually improve your skills.</li>\n<li>You take great pride in the quality of your code</li>\n<li>Expert in at least one modern server-side language. You test your code primarily with automation.</li>\n<li>Eager to learn some Ruby (you’ll see a lot of it here, though it won’t necessarily be your primary language)</li>\n</ul>\n<p><strong>Optional</strong></p>\n<ul>\n<li>Nice to have: Experience building high-load scalable systems</li>\n<li>Nice to have: Devops experience (Linux, Docker, Nginx, Ansible, Kubernetes, Terraform, Cloud-based Databases, Queues)</li>\n<li>In general, we’re looking for someone with raw smarts and potential who can easily learn the specific skills needed for our work.</li>\n<li>We’re open to candidates with various levels of experience. From junior to very senior, come talk to us!</li>\n</ul>\n<p><strong>What we offer</strong></p>\n<ul>\n<li>Challenging work in a fun and collaborative environment</li>\n<li>Attractive compensation and time-off benefits</li>\n<li>Spacious open-concept and centrally located offices</li>\n<li>Full-time employment with flexible working hours</li>\n<li>Fully stocked pantry with fresh fruit and snacks</li>\n<li>Team lunches and company events every quarter</li>\n<li>Multicultural teams represented by 30+ nationalities</li>\n</ul>\n<p><strong>Note: Please upload your resume as a PDF and do not include any salary or compensation information in it.</strong></p>\n",
        "how_to_apply": "<p><a href=\"https://grnh.se/b589e4f52us\">Apply Here</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUtZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--55ea861d68f6b69fec38acf665ad79bdebcd1811/Red.png"
    },
    {
        "id": "11f4ce0e-3ee7-4474-b6f9-b1207307ff76",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/11f4ce0e-3ee7-4474-b6f9-b1207307ff76",
        "created_at": "Thu Feb 11 01:35:46 UTC 2021",
        "company": "Mitrais",
        "company_url": "https://www.mitrais.com/",
        "location": "Indonesia",
        "title": "C++ Senior Engineers required for world-class Australian Software projects",
        "description": "<p>Mitrais has engaged a large Australian software company on exciting software development projects. Our customer IR is an ASX listed organization (ASX:IRI), servicing over 1,000 organizations globally including over 25% of the Global Fortune 500 companies. IR develops and offers products providing visibility over systems that people can’t live without – systems that allow them to conduct millions of financial transactions every day and collaborate using unified communications ecosystems and contact centers. IR creates software that enables organizations to use data to optimize these systems.</p>\n<p>Working on IR projects will provide you with an indescribable challenge, experience, and exposure from both technical and personal perspectives.</p>\n<p>What will you be doing?\nAt Mitrais, you will be collaborating with your  colleagues and the client to maintain, enhance, develop and deliver a series of systems that include (but not limited to):</p>\n<ul>\n<li>IR Collaborate – a Unified Communications collaboration suite that offers enterprise-grade performance management across voice, video, and collaboration ecosystems. This can be on-premises, in the cloud, or hybrid;</li>\n<li>IR Transact – a solution that simplifies the complexity of managing modern payments ecosystems. Bringing real-time visibility to the client’s entire payments environment. Transact uncovers unparalleled insights into transactions and helps clients streamline the payments experience, turning data into intelligence;</li>\n<li>IR Infrastructure– an end-to-end infrastructure monitoring solution; and</li>\n<li>AWS Simple Email Service management.</li>\n</ul>\n<p>What’s in it for you?\nWork with world class Software Engineers in an organization that is conducting world class projects.</p>\n<p>You will get the ability to modularize the serverless project and deploy it into AWS. You will also gain experience in new technologies, such as:</p>\n<ul>\n<li>Snowflake, Dynamo DB.</li>\n<li>“Cloud Native” which is the future trend/modern way of software development (application/architecture/paradigm)</li>\n<li>Unit Testing</li>\n</ul>\n<p>What skills do you need to have?\nIf you are a C++ Engineer, you will have:</p>\n<ul>\n<li>Worked with C++ 11 or newer versions for 2 years or more; and</li>\n<li>Experience in C++ technologies such as standard library, STL containers, algorithms, dynamic polymorphism and C++ specific notions, such as friend classes</li>\n</ul>\n<p>If you have exposure to any of the following then that will be a big plus.</p>\n<ul>\n<li>SNMP, WMI, web services, HTTP listener, perfmon gatherer, networking (TCP/UDP), and parsers;</li>\n<li>Mainly using typescript;</li>\n<li>Frontend using React JS, styled-component, redux-saga, Ant Design, etc;</li>\n<li>Jenkins as CI/CD;</li>\n</ul>\n<p>What can Mitrais offer you?</p>\n<ul>\n<li>We will offer you a career, not just a job!;</li>\n<li>Competitive salary;</li>\n<li>Excellent working environment, with the possibility to relocate to our regional offices and working remotely;</li>\n<li>Free English classes; English is our working language;</li>\n<li>Lots of opportunities to improve your competencies on our technical boot camps, certification programs, and soft skills training courses;</li>\n<li>Hackathons with big prizes; and</li>\n<li>Take a break with Happy Hours, Billiard Tables, gaming rooms, and free drinks and snacks to keep you 100% effective.\n*Working from home during pandemic</li>\n</ul>\n<p>Learn about life at Mitrais from our current team by searching #mitraislife on Facebook, LinkedIn, or Instagram. Fill out the form below to apply.</p>\n",
        "how_to_apply": "<p>Fill out this form to apply\n<a href=\"https://bit.ly/3qekdmO\">https://bit.ly/3qekdmO</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdCtZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--499f04f55817f9019a97ff0df76b51f1b7d5fc8f/mitrais%20IR.JPG"
    },
    {
        "id": "caa2df9e-4b6c-42cb-916c-7ca1c241fa00",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/caa2df9e-4b6c-42cb-916c-7ca1c241fa00",
        "created_at": "Wed Feb 10 20:28:37 UTC 2021",
        "company": "Cambridge Associates",
        "company_url": null,
        "location": "Boston",
        "title": "Lead Developer",
        "description": "<p>Lead Software Developer – Investment Service Group</p>\n<p>Firm Overview</p>\n<p>Cambridge Associates was founded in the early 1970s to assist nonprofit institutions with the investment of their endowment assets.  Today, we provide investment management, financial planning and proprietary capital markets research to over 1000 clients including nonprofit institutions, private clients (families) and pension plans.  The firm advises on assets in all asset categories, including equities, bonds, non-US investments, real estate, venture capital, hedge funds, leveraged buyout funds, oil and gas partnerships, and many other types of investments.  We monitor the performance of nearly all major institutional investment managers and provide an advanced monitoring service for our clients to evaluate alternative assets managers such as venture capital and private equity.</p>\n<p>Cambridge Associates has a staff of more than 1,100 professionals, including 200 Investment Directors and 150 Investment Associates, based in eight offices located in Arlington, Beijing, Boston, Dallas, London, Menlo Park, Singapore and Sydney. We select our employees with great attention to their potential to become valuable members of a collegial, intelligent and hard-working team.</p>\n<p>Position Overview</p>\n<p>The Investment Systems Group is seeking a lead software developer to join our development team.  You will have the opportunity to work with a talented team designing and developing mission-critical software at our firm.</p>\n<p>The team is responsible for delivering data services to support business process and workflows, decision support systems, and reporting capabilities for our internal customers and the firm’s clients.  These include web applications, mobile apps, and backend services.</p>\n<p>Our developers are responsible for reviewing business needs, providing a technical design, implementation, testing and maintaining software.  Cambridge Associates is looking for creative individuals who are driven to produce great solutions while following standards and industry best practices.  These positions require intelligent and self-motivated developers.</p>\n<ul>\n<li>As part of an agile team, work closely with business analysts, architects and QA.</li>\n<li>Participate in planning activities, collaborate and coordinates the efforts across development teams.</li>\n<li>Provide suggestions and adjustments as needed to deliver quality software within project scope and timeframes.</li>\n<li>Promote and perform development work consistent with industry standards and best practices</li>\n<li>Where applicable, refactor existing code for performance improvements and compliance with latest standards</li>\n<li>Ability to work independently and understand application functionality through reverse engineering code</li>\n<li>Perform unit testing and support test automation.</li>\n<li>Apply continuous integration and continuous delivery techniques.</li>\n<li>Conduct peer code reviews.</li>\n<li>Work on R&amp;D activities and prototypes.</li>\n<li>Support Tier 1 systems.</li>\n</ul>\n<p>Qualifications</p>\n<ul>\n<li>A Bachelor’s degree in computer science or equivalent experience.</li>\n<li>7-10 years of professional experience building message driven applications on the JVM</li>\n<li>Experience with event sourcing and other event driven architecture patterns.</li>\n<li>Experience with building applications in AWS, specifically EC2 Container Service, EMR (Apache Spark), Lambda, Kinesis, SQS and SNS.</li>\n<li>Experience with relational databases and JDBC required. Experience with search engines such as - Elasticsearch or Lucene a plus.</li>\n<li>Demonstrated experience applying TDD, continuous integration and lean delivery.</li>\n<li>Experience building and maintaining micro-service components and architectures.</li>\n<li>Experience building measurement and continuous improvement into software.</li>\n<li>Ability to satisfy complex business requirements through simple design and execution.</li>\n<li>Possess strong problem-solving and analytical skills.</li>\n<li>Experience with mid/back-office financial services operations a plus.</li>\n<li>All candidates must be eligible to work in the US without sponsorship.</li>\n</ul>\n<p>Cambridge Associates is an equal opportunity employer. Diversity and inclusion are essential elements of our culture. We are committed to fostering an environment where individual perspectives, backgrounds, and life experiences make the firm a great place to work, and result in a more satisfying client experience.</p>\n",
        "how_to_apply": "<p>Apply at <a href=\"https://phe.tbe.taleo.net/phe02/ats/careers/v2/viewRequisition?org=CAMBRIDGEASSOCIATES&amp;cws=47&amp;rid=7721\">https://phe.tbe.taleo.net/phe02/ats/careers/v2/viewRequisition?org=CAMBRIDGEASSOCIATES&amp;cws=47&amp;rid=7721</a></p>\n",
        "company_logo": null
    },
    {
        "id": "e13be5b4-9039-408f-9b88-3327bac37f70",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e13be5b4-9039-408f-9b88-3327bac37f70",
        "created_at": "Wed Feb 10 16:28:03 UTC 2021",
        "company": "Basil Systems",
        "company_url": "http://www.basilsystems.com",
        "location": "Remote",
        "title": "Front-end Engineer",
        "description": "<p>Basil Systems is a healthcare-focused start-up delivering a SaaS application that leverages product, market and regulatory data to support all types of players in the medical device and pharmaceutical industries.  Our goal is to help our customers deliver safe and innovative healthcare products to patients and consumers, while reducing the time to get to market.  After 14 months of stealth development, we soft launched in late December 2020 to a very positive market reception and customers.</p>\n<p>In short, Basil is a funded, revenue generating, and growth-oriented company – and we are actively seeking talented developers as we expand our engineering team.  As a front-end engineer you'll play a vital role in the ongoing design and development of our app, noticing every detail without losing sight of the big picture.</p>\n<p><strong>Front-end Engineer</strong></p>\n<p>We are looking for a motivated self-starter; you’ll spend your time building reliable front-end experiences. We would like you to have:</p>\n<ul>\n<li>3+ years of professional experience as a front-end engineer</li>\n<li>Advanced proficiency in building modern web applications with Java Script</li>\n<li>Created displays of proprietary data using D3 or related libraries</li>\n<li>Demonstrated efficient use of APIs (REST/JSON) for data transfer and business processes</li>\n<li>Up-to-date knowledge of React and Typescript</li>\n<li>Experience integrating third party component libraries</li>\n</ul>\n<p>Not all of these are required, but ideally you have experience with:</p>\n<ul>\n<li>Building complex custom interface components</li>\n<li>Using software configuration management (SCM) tools (e.g. Git, Subversion) for software development</li>\n</ul>\n<p>Some nice to haves</p>\n<ul>\n<li>Demonstrated ability to improve code quality through writing unit tests, automation and performing code reviews</li>\n<li>Built scalable code bases with an emphasis on performance</li>\n<li>Experience with containers (Docker/Kubernetes) and the AWS ecosystem</li>\n<li>Interest in providing visualizations of ML-driven or algorithmic data</li>\n</ul>\n<p><strong>Finally</strong>\nWe are a distributed team headquartered in Boston, with an office in Nashville, TN.  However, our culture allows flexibility as to when, where and how you work best – and actively employ and support remote engineers.</p>\n<p>Benefits include:</p>\n<ul>\n<li>Competitive salary (Depending upon experience, range from $80k - $155k)</li>\n<li>Health and vision</li>\n<li>An attractive equity package</li>\n</ul>\n<p>Basil supports and encourages building a work environment that is diverse, inclusive, and safe for everyone -- and we welcome all applicants.  Contact us at: <a href=\"mailto:jobs@basilsys.com\">jobs@basilsys.com</a></p>\n",
        "how_to_apply": "<p><a href=\"mailto:jobs@basilsys.com\">jobs@basilsys.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczJZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--620133d535fb722eaafc849318e1ad8e06aecf8c/website_logo_transparent_background.png"
    }
]